{
    "title": "CNN.com - RSS Channel - HP Hero",
    "link": "https://www.cnn.com/index.html",
    "items": [
        {
            "title": "The former president faces more than 30 counts related to business fraud, sources say. Catch up on the latest developments.",
            "description": "",
            "link": "https://www.cnn.com/politics/live-news/trump-indictment-hush-money-stormy-daniels-03-31-23/index.html",
            "pubDate": ""
        },
        {
            "title": "Trump has been indicted. Here's what happens next in court",
            "description": "A Manhattan grand jury's indictment of former President Donald Trump will set in motion a criminal process that will in some ways work like that of any other defendant, and in other ways, look very different. ",
            "link": "https://www.cnn.com/2023/03/30/politics/what-happens-next-court-trump-indictment/index.html",
            "pubDate": "Fri, 31 Mar 2023 07:45:09 GMT"
        },
        {
            "title": "Judge signs off on DA request to publicly disclose Trump indictment that was returned, records show",
            "description": "",
            "link": "https://www.cnn.com/politics/live-news/trump-indictment-hush-money-stormy-daniels-03-31-23/h_dbcce6edb5a7e2b0ca90121ec249b797",
            "pubDate": ""
        },
        {
            "title": "Analysis: Could Trump ever be jailed? Your questions, answered",
            "description": "Could he still run for president? Why would the adult-film star case move before any of the ones about protecting democracy? How could you possibly find an impartial jury?",
            "link": "https://www.cnn.com/2023/03/31/politics/trump-indictment-questions-answered-what-matters/index.html",
            "pubDate": "Fri, 31 Mar 2023 22:47:33 GMT"
        },
        {
            "title": "Opinion: Trump's indictment answers a 50-year-old question",
            "description": "Donald Trump became the first ever former US president to be indicted on Thursday. Like so many other instances with Trump, we're venturing into new terrain. And while President Ulysses S. Grant was arrested in 1872 for speeding through Washington on a horse-drawn carriage, we can all agree it's hardly the same.",
            "link": "https://www.cnn.com/2023/03/31/opinions/trump-historical-question-president-accountability-zelizer/index.html",
            "pubDate": "Fri, 31 Mar 2023 21:54:41 GMT"
        },
        {
            "title": "Hear Stormy Daniels' first comments since Trump indictment",
            "description": "In an interview with the British newspaper \"The Times,\" adult film actress Stormy Daniels made her first public comments about the indictment of former President Donald Trump. CNN's Kyung Lah reports on Daniels' response and her role in the case.",
            "link": "https://www.cnn.com/videos/politics/2023/04/01/stormy-daniels-donald-trump-indictment-comments-pkg-lah-ebof-vpx.cnn",
            "pubDate": "Sat, 01 Apr 2023 00:39:39 GMT"
        },
        {
            "title": "In pictures: The indictment of Donald Trump",
            "description": "History was made Thursday when former President Donald Trump was indicted by a New York grand jury.",
            "link": "https://www.cnn.com/2023/03/31/politics/gallery/trump-indictment/index.html",
            "pubDate": "Fri, 31 Mar 2023 22:51:06 GMT"
        },
        {
            "title": "Tornadoes tear through Arkansas, Illinois, Iowa, Wisconsin, Mississippi and Tennessee",
            "description": "• At least 3 dead, dozens hospitalized after violent tornadoes devastate central US\n• Wynne, Arkansas, 'basically cut in half by damage' from apparent tornado, mayor says",
            "link": "https://www.cnn.com/us/live-news/severe-storm-midwest-midsouth-weather-03-31-23/index.html",
            "pubDate": "Sat, 01 Apr 2023 02:52:54 GMT"
        },
        {
            "title": "SE Cupp says 'no one should care' about GOP outrage over Trump indictment",
            "description": "• What we know: Trump caught off guard by indictment, source says",
            "link": "https://www.cnn.com/videos/politics/2023/03/31/se-cupp-gop-outrage-trump-indictment-newsroom-vpx.cnn",
            "pubDate": "Fri, 31 Mar 2023 18:10:35 GMT"
        },
        {
            "title": "Fetterman discharged from Walter Reed after receiving treatment for depression",
            "description": "Pennsylvania Sen. John Fetterman has been discharged from Walter Reed National Military Medical Center where he was being treated for depression, his office announced Friday. ",
            "link": "https://www.cnn.com/2023/03/31/politics/fetterman-discharged-walter-reed-mental-health-depression/index.html",
            "pubDate": "Sat, 01 Apr 2023 00:15:55 GMT"
        },
        {
            "title": "Motorcades, fingerprints, mugshot: The choreographed security behind Trump's arraignment",
            "description": "Former President Donald Trump is expected to appear in Manhattan criminal court for his arraignment as he faces more than 30 counts related to business fraud in an indictment by a New York grand jury.",
            "link": "https://www.cnn.com/videos/politics/2023/03/31/trump-arraignment-security-prokupecz-pkg-tsr-vpx.cnn",
            "pubDate": "Sat, 01 Apr 2023 00:18:16 GMT"
        },
        {
            "title": "After Gwyneth Paltrow won her case, here's what she said to the man who sued her",
            "description": "Terry Sanderson was \"very disappointed\" by losing his lawsuit against Gwyneth Paltrow, but it appears things have ended between the two of them on good terms.",
            "link": "https://www.cnn.com/2023/03/31/entertainment/gwyneth-paltrow-terry-sanderson-trial/index.html",
            "pubDate": "Fri, 31 Mar 2023 13:17:22 GMT"
        },
        {
            "title": "Hugh Grant would like to erase this film from his resume ",
            "description": "Hugh Grant knows he has had some bad performances, but which one would he really like to erase?",
            "link": "https://www.cnn.com/2023/03/31/entertainment/hugh-grant-movie-regret/index.html",
            "pubDate": "Fri, 31 Mar 2023 14:38:31 GMT"
        },
        {
            "title": "Carole Baskin's Florida animal sanctuary to close and move big cats, husband says",
            "description": "Most of the big cats at Carole Baskin's Florida animal sanctuary profiled in Netflix's \"Tiger King\" series will be moving to a sanctuary in Arkansas and Big Cat Rescue's land will eventually be sold.",
            "link": "https://www.cnn.com/2023/03/31/us/carole-baskin-big-cat-rescue-tiger-king-trnd/index.html",
            "pubDate": "Fri, 31 Mar 2023 16:55:36 GMT"
        },
        {
            "title": "Hear what Germans think of King Charles III during his visit",
            "description": "King Charles III arrived in Germany with the Queen Consort for his first overseas state visit as monarch. German President Frank-Walter Steinmeier and his wife, Elke Budenbender, rolled out the red carpet for the visiting monarch. CNN's Max Foster has more.",
            "link": "https://www.cnn.com/videos/world/2023/03/30/king-charles-iii-state-visit-berlin-germany-max-foster-pkg-ovn-contd-intl-ldn.cnn",
            "pubDate": "Fri, 31 Mar 2023 09:07:28 GMT"
        },
        {
            "title": "Chronic stress can affect your health. One activity can help",
            "description": "These days, many people find it hard to unplug. Inflation, global warming and gun violence are on the rise. Bullies proliferate on social media. The 24/7 news cycle constantly blares distressing news, and people often face difficult personal or professional situations. ",
            "link": "https://www.cnn.com/2023/03/31/health/exercises-to-reduce-stress-wellness/index.html",
            "pubDate": "Sat, 01 Apr 2023 01:12:25 GMT"
        },
        {
            "title": "Opinion: What you need to know about Captain America's real secret identity",
            "description": "You know the story: a young, undersized, aspiring artist from New York's Lower East Side who loves his country and hates bullies uses a superhero persona to take on the Nazis and becomes a war hero. It's the origin of Captain America. It's also the origin of Jack Kirby, his co-creator.",
            "link": "https://www.cnn.com/2023/03/31/opinions/real-captain-america-history-jack-kirby-schwartz-ctrp/index.html",
            "pubDate": "Fri, 31 Mar 2023 14:02:24 GMT"
        },
        {
            "title": "Dominion's historic defamation case against Fox News will go to trial, judge rules, in major decision dismantling key Fox defenses",
            "description": "• Fox News banned Trump legal team from air in December 2020, new message shows",
            "link": "https://www.cnn.com/2023/03/31/media/fox-news-dominion-lawsuit/index.html",
            "pubDate": "Fri, 31 Mar 2023 23:16:39 GMT"
        },
        {
            "title": "'You just press the brown button': 5-year-old spends $3,000 on her mom's Amazon",
            "description": "Five-year-old Lila Varisco was playing on her mom's phone during a car ride and spent over $3,000 on her mom's Amazon account. The order included 10 motorcycles and 10 pairs of cowgirl boots. CNN affiliate WJAR has more. ",
            "link": "https://www.cnn.com/videos/business/2023/03/31/child-orders-three-thousand-dollars-mom-amazon-affil-cprog-vpx.cnn",
            "pubDate": "Fri, 31 Mar 2023 19:51:32 GMT"
        },
        {
            "title": "8 bodies discovered by police and Canadian Coast Guard in a Mohawk Nation territory near US border",
            "description": "Police in Canada said Friday they have recovered eight bodies in Akwesasne, the Mohawk Nation territory that straddles the Canadian provinces of Quebec and Ontario along the banks of the St. Lawrence River.",
            "link": "https://www.cnn.com/2023/03/31/us/bodies-discovered-canada/index.html",
            "pubDate": "Sat, 01 Apr 2023 02:21:54 GMT"
        },
        {
            "title": "Most Wanted fugitive couple arrested in Mexico; five missing children recovered  ",
            "description": "Warning: This story contains graphic descriptions of child violence that may be disturbing. ",
            "link": "https://www.cnn.com/2023/03/31/us/fugitives-arrested-mexico-washington-state-missing-children/index.html",
            "pubDate": "Fri, 31 Mar 2023 20:26:16 GMT"
        },
        {
            "title": "US Army identifies nine soldiers killed in Black Hawk training accident",
            "description": "The US Army has identified the nine soldiers who were killed in a nighttime training accident on Wednesday evening, when two HH-60 Black Hawk helicopters crashed in a field near Fort Campbell, Kentucky.",
            "link": "https://www.cnn.com/2023/03/31/politics/army-identifies-soldiers-killed-black-hawk-accident/index.html",
            "pubDate": "Fri, 31 Mar 2023 21:31:11 GMT"
        },
        {
            "title": "A snowboarder got buried upside down in snow. See skier's quick reaction",
            "description": "Skier Francis Zuber sprang into action when he noticed a snowboarder had become trapped upside down in a tree well. Zuber, whose reaction has been applauded as a textbook example of what to do in such a situation, urged others to take up rescue courses.",
            "link": "https://www.cnn.com/videos/us/2023/03/31/snowboarder-rescue-mt-baker-washington-cprog-lon-orig-na.cnn",
            "pubDate": "Fri, 31 Mar 2023 12:33:33 GMT"
        },
        {
            "title": "One iguana's taste for cake leaves a young girl with a mysterious malady",
            "description": "The bump on a young California girl's hand was mysterious -- and growing. It wasn't until she had seen two doctors and undergone a biopsy that her family realized the cause: The child had gotten in the way of a hungry iguana with a sweet tooth, resulting in what may be the first documented infection of a rare bacterial infection in a human from an iguana bite. ",
            "link": "https://www.cnn.com/2023/03/31/health/iguana-cake-infection/index.html",
            "pubDate": "Fri, 31 Mar 2023 22:03:29 GMT"
        },
        {
            "title": "Democratic congressman announces he has 'serious but curable form of cancer'",
            "description": "Democratic Rep. Dan Kildee of Michigan announced in a statement on Friday that he has been \"diagnosed with squamous cell carcinoma, a serious but curable form of cancer.\"",
            "link": "https://www.cnn.com/2023/03/31/politics/dan-kildee-cancer/index.html",
            "pubDate": "Fri, 31 Mar 2023 16:01:19 GMT"
        },
        {
            "title": "Florida man stuns onlookers with risky drawbridge stunt",
            "description": "A mysterious climber scales a Miami drawbridge giving viewers sweaty palms. CNN's Jeanne Moos reports.",
            "link": "https://www.cnn.com/videos/us/2023/03/30/miami-drawbridge-climber-moos-cprog-orig-bdk.cnn",
            "pubDate": "Thu, 30 Mar 2023 16:27:21 GMT"
        },
        {
            "title": "Belarus says it will defend itself with nuclear weapons if West invades through Poland",
            "description": "• Reporter arrested in Russia on spying charges\n• Putin admits sanctions could hurt Russia's economy",
            "link": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-03-31-23/index.html",
            "pubDate": ""
        },
        {
            "title": "Russian plan to send nuclear weapons to Belarus proves Putin-Xi talks failed, Zelensky says",
            "description": "",
            "link": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-03-31-23/h_6333122d8b5123c4208885b41bb1f397",
            "pubDate": ""
        },
        {
            "title": "US official's warning for Americans in Russia",
            "description": "In light of the arrest of a US journalist in Russia, White House Coordinator for Strategic Communications at the National Security Council John Kirby is urging Americans in Russia to leave immediately.",
            "link": "https://www.cnn.com/videos/world/2023/03/31/kirby-russia-americans-leave-now-amanpour-vpx.cnn",
            "pubDate": "Fri, 31 Mar 2023 23:59:00 GMT"
        },
        {
            "title": "Opinion: Russia's nuclear blackmail is a spectacular success for Putin",
            "description": "Vladimir Putin last week gave details of Russia's stated intent to base tactical nuclear weapons in Belarus. The flurry of alarmist reporting on what this meant highlights much of what is wrong with Western responses to Russian nuclear intimidation. ",
            "link": "https://www.cnn.com/2023/03/29/opinions/russia-putin-nuclear-blackmail-belarus-giles/index.html",
            "pubDate": "Thu, 30 Mar 2023 07:42:07 GMT"
        },
        {
            "title": "Analysis: With the arrest of an American journalist, the Kremlin sharpens confrontation with Washington",
            "description": "American journalist Evan Gershkovich made a pointed observation last year following the arrest of prominent Russian opposition figure Ilya Yashin.",
            "link": "https://www.cnn.com/2023/03/31/europe/evan-gershkovich-us-russia-analysis-intl/index.html",
            "pubDate": "Fri, 31 Mar 2023 21:25:31 GMT"
        },
        {
            "title": "Russian man whose daughter made anti-war painting sentenced to two years in prison",
            "description": "A Russian man whose teenage daughter drew an anti-war picture at school has been sentenced to two years in prison by a court for his own online posts critical of the invasion of Ukraine.",
            "link": "https://www.cnn.com/2023/03/28/europe/russian-man-sentenced-anti-war-posts-intl/index.html",
            "pubDate": "Fri, 31 Mar 2023 21:53:39 GMT"
        },
        {
            "title": "How these Ukrainian soldiers show the effects of war on their faces",
            "description": "A group of American and Canadian surgeons called \"Face the Future\" work across the globe focusing on delicate reconstructive surgery. The foundation's work included Russia, until recently, but they quickly pivoted their efforts to Ukraine after the full-scale war began. CNN's David McKenzie has the story. ",
            "link": "https://www.cnn.com/videos/world/2023/03/31/facial-surgeons-ukrainian-soldiers-reconstruct-mckenzie-pkg-intl-vpx.cnn",
            "pubDate": "Fri, 31 Mar 2023 20:11:36 GMT"
        },
        {
            "title": "Podcast: Audie Cornish asks a former FBI agent how to talk to kids about active shooter trainings",
            "description": "",
            "link": "https://www.cnn.com/audio/podcasts/the-assignment/episodes/28effc17-55be-4d9b-a697-afd401677026",
            "pubDate": ""
        },
        {
            "title": "59% of readers who took this week's news quiz got 8 or more questions right. How will you fare?",
            "description": "",
            "link": "https://www.cnn.com/interactive/2023/03/us/cnn-5-things-news-quiz-march-30-sec/",
            "pubDate": ""
        },
        {
            "title": "Actress Jodie Turner-Smith strikes an immaculate pose. King Charles makes cheese in Germany. The week in 33 photos",
            "description": "Three 9-year-old children and three adults were killed Monday at a private Christian elementary school in Nashville.",
            "link": "https://www.cnn.com/2023/03/30/world/gallery/photos-this-week-march-23-march-30-ctrp/index.html",
            "pubDate": "Fri, 31 Mar 2023 00:31:07 GMT"
        },
        {
            "title": "Man sentenced to 22 years in prison for assaulting and killing Asian man in hate crime in New York",
            "description": "A man who brutally assaulted an Asian man in New York who later died was sentenced to 22 years in prison on Friday.",
            "link": "https://www.cnn.com/2023/03/31/us/man-attack-asian-death-new-york-sentence/index.html",
            "pubDate": "Fri, 31 Mar 2023 20:41:45 GMT"
        },
        {
            "title": "Three months, three missing radioactive items. Here's what you need to know",
            "description": "What do a capsule in Australia, a cylinder in Thailand and a camera in the US have in common? ",
            "link": "https://www.cnn.com/2023/03/31/asia/radioactive-isotopes-missing-explainer-intl-hnk/index.html",
            "pubDate": "Sat, 01 Apr 2023 01:15:28 GMT"
        },
        {
            "title": "Video: This is Eva Longoria's pick for her last meal on earth",
            "description": "In Mexico's Yucatán, Eva Longoria sampled grilled fish with sour orange, prepared beachside for flavorful tacos. \"Eva Longoria: Searching for Mexico airs Sundays at 9 p.m. ET. ",
            "link": "https://www.cnn.com/videos/travel/2023/03/04/searching-for-mexico-eva-longoria-grilled-whole-fish-origseriesfilms.cnn",
            "pubDate": "Fri, 31 Mar 2023 17:57:14 GMT"
        },
        {
            "title": "'Appalling': Australian surf swim club members shocked by ban on nudity in showers",
            "description": "An Australian surf lifesaving club has found itself at the center of a controversy following its implementation of a no-nudity policy in showers and changing rooms. ",
            "link": "https://www.cnn.com/2023/03/31/sport/australia-surf-club-nudity-policy-intl-spt-scli/index.html",
            "pubDate": "Fri, 31 Mar 2023 11:15:13 GMT"
        },
        {
            "title": "What Americans think of a TikTok ban",
            "description": "Half of Americans support a US government ban on TikTok, while 22% oppose the idea and more than a quarter are unsure, according to a Pew Research Center survey released Friday. ",
            "link": "https://www.cnn.com/2023/03/31/tech/tiktok-ban-pew-survey/index.html",
            "pubDate": "Fri, 31 Mar 2023 18:38:18 GMT"
        },
        {
            "title": "Chinese cities are so broke, they're cutting medical benefits for seniors",
            "description": "China's government, strapped for cash after years of enforcing a costly zero-Covid policy, is cutting medical benefits and planning to raise the retirement age, in deeply unpopular moves that are fueling widespread public anger.",
            "link": "https://www.cnn.com/2023/03/31/economy/china-pension-protests-aging-society-intl-hnk/index.html",
            "pubDate": "Fri, 31 Mar 2023 07:48:45 GMT"
        },
        {
            "title": "Why skinny soda cans are everywhere ",
            "description": "Suddenly, your beverage is taller. ",
            "link": "https://www.cnn.com/2023/03/30/business/soda-cans-slim-aluminum/index.html",
            "pubDate": "Thu, 30 Mar 2023 15:13:40 GMT"
        },
        {
            "title": "We tested seven cordless stick vacuums. Here are the best three",
            "description": "",
            "link": "https://www.cnn.com/cnn-underscored/reviews/best-cordless-stick-vacuum?iid=CNNUnderscoredHPcontainer",
            "pubDate": ""
        },
        {
            "title": "Is Le Creuset worth it? We tested it alongside the Lodge Dutch oven to see",
            "description": "",
            "link": "https://www.cnn.com/cnn-underscored/home/le-creuset-vs-lodge-dutch-oven?iid=CNNUnderscoredHPcontainer",
            "pubDate": ""
        },
        {
            "title": "We tested bidets for 3 months — we're never going back to standard toilets",
            "description": "",
            "link": "https://www.cnn.com/cnn-underscored/reviews/best-bidets?iid=CNNUnderscoredHPcontainer",
            "pubDate": ""
        },
        {
            "title": "Is a silk pillowcase worth it? Absolutely. Here's why and which to buy",
            "description": "",
            "link": "https://www.cnn.com/cnn-underscored/reviews/best-silk-pillowcase?iid=CNNUnderscoredHPcontainer",
            "pubDate": ""
        },
        {
            "title": "The best products we tested in March: Flashlights, photo printers and more",
            "description": "",
            "link": "https://www.cnn.com/cnn-underscored/reviews/best-tested-products-march-2023?iid=CNNUnderscoredHPcontainer",
            "pubDate": ""
        },
        {
            "title": "This $26 Amazon dress is about to become your spring wardrobe staple",
            "description": "",
            "link": "https://www.cnn.com/cnn-underscored/reviews/amazon-msbasic-dress?iid=CNNUnderscoredHPcontainer",
            "pubDate": ""
        },
        {
            "title": "Our editors' favorite picks to shop from Wayfair's 5 Days of Deals sale",
            "description": "",
            "link": "https://www.cnn.com/cnn-underscored/deals/wayfair-5-days-of-deals-sale-2023-03-31?iid=CNNUnderscoredHPcontainer",
            "pubDate": ""
        },
        {
            "title": "This $13 kitchen tool changed the way I cook. Here's why",
            "description": "",
            "link": "https://www.cnn.com/cnn-underscored/reviews/chefn-garliczoom-garlic-chopper?iid=CNNUnderscoredHPcontainer",
            "pubDate": ""
        },
        {
            "title": "We tested popular carpet cleaners to find the 3 that are worth your money",
            "description": "",
            "link": "https://www.cnn.com/cnn-underscored/reviews/best-carpet-cleaners?iid=CNNUnderscoredHPcontainer",
            "pubDate": ""
        },
        {
            "title": "We've found three of the best mops to handle grime on your hardwood and tile floors",
            "description": "",
            "link": "https://www.cnn.com/cnn-underscored/reviews/best-mops?iid=CNNUnderscoredHPcontainer",
            "pubDate": ""
        },
        {
            "title": "We tested over 30 vacuum models. Here are the six best for cleaning pet hair",
            "description": "",
            "link": "https://www.cnn.com/cnn-underscored/home/best-vacuum-for-pet-hair?iid=CNNUnderscoredHPcontainer",
            "pubDate": ""
        },
        {
            "title": "Spring cleaning checklist: How to actually clean every type of floor",
            "description": "",
            "link": "https://www.cnn.com/cnn-underscored/home/floor-cleaning-guide?iid=CNNUnderscoredHPcontainer",
            "pubDate": ""
        },
        {
            "title": "Trump finally faces accountability",
            "description": "It finally happened. After multiple investigations over half a dozen years, former President Donald Trump has been indicted by a grand jury in New York, according to sources familiar with the matter. Trump fired back, calling the indictment \"political persecution\" and warned \"this Witch-Hunt\" will backfire.",
            "link": "https://www.cnn.com/2023/03/30/opinions/donald-trump-indictment-new-york-courts-rodgers/index.html",
            "pubDate": "Fri, 31 Mar 2023 00:08:09 GMT"
        },
        {
            "title": "Michelle Obama empowers tall girls everywhere ",
            "description": "When my spouse saw on Instagram that former first lady Michelle Obama had addressed her struggles as a tall girl on the latest episode of her podcast, he immediately sent it my way. He knew it would resonate — after all, that very day, the planned publication of my latest middle grade novel had been announced: a story about a 12-year-old girl whose 4-inch summer growth spurt and accompanying signs of womanhood begin drawing unwanted attention from family, friends and strangers. ",
            "link": "https://www.cnn.com/2023/03/30/opinions/michelle-obama-podcast-conan-obrien-tall-vulnerability-wyman/index.html",
            "pubDate": "Thu, 30 Mar 2023 20:06:50 GMT"
        },
        {
            "title": "4 major hurdles to prosecuting Trump",
            "description": "Former prosecutor and CNN senior legal analyst Elie Honig explains why there is no such thing as a slam dunk criminal case against former President Donald Trump. ",
            "link": "https://www.cnn.com/videos/opinions/2023/03/28/trump-indictment-elie-honig-orig-jm.cnn",
            "pubDate": "Fri, 31 Mar 2023 14:19:42 GMT"
        },
        {
            "title": "Is Sweden afraid of publishing this book on race?",
            "description": "When mirrors show us how we look, we adjust what needs to be fixed. We don't break those mirrors simply because we won't accept our reflection.",
            "link": "https://www.cnn.com/2023/03/31/opinions/lola-akinmade-kerstrm-sweden-lgs-intl/index.html",
            "pubDate": "Fri, 31 Mar 2023 09:54:16 GMT"
        },
        {
            "title": "This could be a game changer on school shootings",
            "description": "The parents of a teenager who shot and killed four students at Oxford High School in Michigan in November 2021 are set to stand trial for involuntary manslaughter after an appellate court last week rejected their contention that the charges have no legal justification.",
            "link": "https://www.cnn.com/2023/03/28/opinions/school-shooting-crumbley-parents-trial-peterson-densley/index.html",
            "pubDate": "Tue, 28 Mar 2023 22:22:01 GMT"
        },
        {
            "title": "Review: 'Tetris' plays like a Cold War thriller built around the game's origins",
            "description": "As fact-based movies go, \"Tetris\" plays like a Cold War espionage thriller, which merely underscores the crazy amount of globetrotting intrigue that surrounded the introduction of this very popular game. Starring Taron Egerton, this Apple TV+ movie, like the game, is colorful and engaging enough that it's hard to take your eyes off the screen.",
            "link": "https://www.cnn.com/2023/03/31/entertainment/tetris-review/index.html",
            "pubDate": "Fri, 31 Mar 2023 13:26:02 GMT"
        },
        {
            "title": "Brian Cox is apparently a 'closet Spice Girls fan'",
            "description": "The best musical acts out there attract a wide range of fans -- young and old, from all walks of life. Case in point: Brian Cox and the Spice Girls.",
            "link": "https://www.cnn.com/2023/03/30/entertainment/brian-cox-spice-girls-carpool-karaoke/index.html",
            "pubDate": "Thu, 30 Mar 2023 19:44:30 GMT"
        },
        {
            "title": "Scarlett Johansson stars in 'Asteroid City' trailer",
            "description": "The official trailer for Wes Anderson's latest film, \"Asteroid City,\" has dropped. ",
            "link": "https://www.cnn.com/2023/03/30/entertainment/wes-anderson-scarlett-johansson-movie-trailer-asteroid-city/index.html",
            "pubDate": "Thu, 30 Mar 2023 16:51:39 GMT"
        },
        {
            "title": "Dolly Parton and Garth Brooks set to host the ACM Awards",
            "description": "Dolly Parton and Garth Brooks will be the hosts of the 58th Academy of Country Music Awards.",
            "link": "https://www.cnn.com/2023/03/30/entertainment/dolly-parton-garth-brooks-country-music-awards-hosts-show/index.html",
            "pubDate": "Thu, 30 Mar 2023 16:59:59 GMT"
        },
        {
            "title": "'The Mandalorian' comes into focus with a 'Rebels' yell",
            "description": "After what can at best be described as a somewhat disjointed third season thus far, the fifth episode of \"The Mandalorian\" began to bring those pieces together and into focus, while continuing to draw upon the \"Star Wars\" animated series that preceded it, including another cameo by a character from the rightfully lauded \"Rebels.\"",
            "link": "https://www.cnn.com/2023/03/29/entertainment/the-mandalorian-episode-5-recap/index.html",
            "pubDate": "Wed, 29 Mar 2023 16:52:12 GMT"
        },
        {
            "title": "The first round-the-world passenger cruise took place 100 years ago. Here's what it was like on board",
            "description": "On March 30, 1923, exactly 100 years ago, the world's first continuous passenger cruise ship arrived back in New York City after completing a 130-day voyage.",
            "link": "https://www.cnn.com/travel/article/laconia-world-cruise-1922-1923-eleanor-claudia-phelps/index.html",
            "pubDate": "Thu, 30 Mar 2023 13:01:07 GMT"
        },
        {
            "title": "It was once a city of 25,000 people. Now hardly anyone knows about this ancient site",
            "description": "You join a long line at the ticket turnstile, run the gauntlet past aggressive souvenir vendors, then emerge into a clearing to see ... thousands of other tourists gathered around the Mexican ruins. ",
            "link": "https://www.cnn.com/travel/article/mexico-uncrowded-archaeological-sites/index.html",
            "pubDate": "Fri, 31 Mar 2023 10:52:15 GMT"
        },
        {
            "title": "Relaxed entry rules make it easier than ever to visit this stunning Asian nation",
            "description": "Due to its remoteness and short summer season, Mongolia has long been a destination overlooked by travelers. ",
            "link": "https://www.cnn.com/travel/article/mongolia-reasons-to-visit-2023/index.html",
            "pubDate": "Fri, 31 Mar 2023 04:25:31 GMT"
        },
        {
            "title": "'World's best airport' facing rare delays amid tech issues",
            "description": "Singapore's Changi is often hailed as the world's best airport and is considered \"a destination in itself,\" but that reputation is at risk as the city-state's border control authority warned of delays and long queues due to a technical issue with its immigration systems on Friday, March 31.",
            "link": "https://www.cnn.com/travel/article/singapore-changi-airport-delays-intl-hnk/index.html",
            "pubDate": "Fri, 31 Mar 2023 08:56:41 GMT"
        }
    ]
}
