{"title": "TechCrunch", "link": "", "items": [{"title": "Silicon Valley Bank’s chief risk officer is out, months after taking the job", "description": "When Silicon Valley Bank\\u2019s collapse was first unfolding, a belated disclosure colored some of the chaos: The bank spent most of last year without a chief risk officer, and the one who left sold more than $4 million of stock in the bank before departing. The new CRO, Kim Olson, who joined in January 2023, [\\u2026]\\nSilicon Valley Bank\\u2019s chief risk officer is out, months after taking the job by Natasha Mascarenhas originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/silicon-valley-banks-chief-risk-officer-is-out-months-after-taking-the-job/", "pubDate": "Tue, 11 Apr 2023 22:33:02 +0000"}, {"title": "GM leads $50M EnergyX deal to lock down lithium for its EVs", "description": "Eager to secure all the lithium it needs to power a growing lineup of electric vehicles, General Motors said on Tuesday that it will lead a $50 million investment into lithium extraction and refining startup EnergyX. With the deal, the legacy automaker says it will help EnergyX scale its lithium-extraction tech. In exchange, GM will [\\u2026]\\nGM leads $50M EnergyX deal to lock down lithium for its EVs by Harri Weber originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/gm-leads-50m-energyx-deal-to-lock-down-lithium-for-its-evs/", "pubDate": "Tue, 11 Apr 2023 22:13:57 +0000"}, {"title": "Daily Crunch: YouTube sets $249 starting price for NFL Sunday Ticket subscriptions ", "description": "Hello, friends, and welcome to Daily Crunch, bringing you the most important startup, tech and venture capital news in a single package.\\nDaily Crunch: YouTube sets $249 starting price for NFL Sunday Ticket subscriptions\\xa0 by Christine Hall originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/daily-crunch-youtube-sets-249-starting-price-for-nfl-sunday-ticket-subscriptions/", "pubDate": "Tue, 11 Apr 2023 22:05:48 +0000"}, {"title": "Elizabeth Holmes is denied request to stay out of prison", "description": "Former Theranos CEO and convicted fraud Elizabeth Holmes is expected to go to prison on April 27 for a sentence of more than 11 years. After Holmes was found guilty on four fraud counts last year, her lawyers have made numerous attempts to delay her incarceration, like petitioning for a new trial. Now Judge Edward [\\u2026]\\nElizabeth Holmes is denied request to stay out of prison by Amanda Silberling originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/elizabeth-holmes-is-denied-request-to-stay-out-of-prison/", "pubDate": "Tue, 11 Apr 2023 21:59:59 +0000"}, {"title": "Hyundai Motor to invest $18B in South Korea’s EVs by 2030", "description": "Hyundai Motor Group will invest 24 trillion won (~$18 billion) in South Korea\\u2019s electric vehicle industry through 2030, the company said Tuesday. The news comes a week after Kia, which falls under the Hyundai umbrella, announced its own 32 trillion won (~$24 billion) investment into electrification and future business areas. Hyundai\\u2019s investment plan was revealed [\\u2026]\\nHyundai Motor to invest $18B in South Korea\\u2019s EVs by 2030 by Rebecca Bellan originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/hyundai-motor-to-invest-18b-in-south-koreas-evs-by-2030/", "pubDate": "Tue, 11 Apr 2023 21:33:06 +0000"}, {"title": "Twitter, Inc. is now X Corp.", "description": "Twitter, Inc. is now called X Corp., according to a court filing in California. Since Twitter is no longer a public company, it does not have to report updates like name changes to the SEC. But in any case, the new name was spotted in an April 4 document related to far-right activist Laura Loomer\\u2019s [\\u2026]\\nTwitter, Inc. is now X Corp. by Amanda Silberling originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/twitter-inc-is-now-x-corp/", "pubDate": "Tue, 11 Apr 2023 21:22:11 +0000"}, {"title": "Whoops, using crypto and cannabis don’t mix after all", "description": "Life comes at you fast. A couple of months ago I wrote how Smoakland was testing a loophole to sell cannabis by credit card. The test failed, apparently. \\u201cUpon further review, it has come to our attention that the way the process was described in the article could potentially be seen as bank fraud. As [\\u2026]\\nWhoops, using crypto and cannabis don\\u2019t mix after all by Haje Jan Kamps originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/just-kidding-about-the-crypto/", "pubDate": "Tue, 11 Apr 2023 20:53:12 +0000"}, {"title": "TikTok quietly launched a GIF-like ‘video stickers’ feature for direct messages", "description": "TikTok quietly launched \\u201canimated video stickers\\u201d for direct messages in February, the company confirmed to TechCrunch. Video stickers essentially work like GIFs and are an expansion of TikTok Stickers, which rolled out last December and allow users to create and upload their own custom images to be used in direct messages. Users can browse through [\\u2026]\\nTikTok quietly launched a GIF-like \\u2018video stickers\\u2019 feature for direct messages by Aisha Malik originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/tiktok-quietly-launched-a-gif-like-video-stickers-feature-for-direct-messages/", "pubDate": "Tue, 11 Apr 2023 20:06:13 +0000"}, {"title": "Prohibition of AI that ‘subverts state power’ in China may chill its nascent industry", "description": "Chinese regulators have proposed restrictive rules around AI models like ChatGPT being built in the country, requiring user identification and security reviews, and prohibiting \\u201cany content that subverts state power, advocates the overthrow of the socialist system, incites splitting the country or undermines national unity.\\u201d The rules come hot on the heels of Chinese tech [\\u2026]\\nProhibition of AI that \\u2018subverts state power\\u2019 in China may chill its nascent industry by Devin Coldewey originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/prohibition-of-ai-that-subverts-state-power-in-china-may-chill-its-nascent-industry/", "pubDate": "Tue, 11 Apr 2023 20:00:24 +0000"}, {"title": "New York’s mayor wants you to know how much he loves police robots", "description": "Former cop and self-declared \\u201cgeek\\u201d Eric Adams held a press conference in Times Square today to let the city know how much he loves police robots. New York City\\u2019s mayor presided over a press conference alongside police officials to discuss a pair of pilots designed to increase the city\\u2019s surveillance. \\u201cI\\u2019ve stated this from day [\\u2026]\\nNew York\\u2019s mayor wants you to know how much he loves police robots by Brian Heater originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/new-yorks-mayor-wants-you-to-know-how-much-he-loves-police-robots/", "pubDate": "Tue, 11 Apr 2023 19:12:51 +0000"}, {"title": "Upfront’s Kobie Fuller has designed an investment framework for modern enterprise software", "description": "Kobie Fuller, a partner at Upfront Ventures, had a notion that there are certain characteristics that every successful enterprise software company shares. You might think that\\u2019s not something that\\u2019s easily quantifiable or identifiable, maybe just something that any investor knows or senses when they see it. But Fuller decided to sit down and figure out [\\u2026]\\nUpfront\\u2019s Kobie Fuller has designed an investment framework for modern enterprise software by Ron Miller originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/upfronts-kobie-fuller-has-designed-an-investment-framework-for-modern-enterprise-software/", "pubDate": "Tue, 11 Apr 2023 19:01:18 +0000"}, {"title": "Turo is blocking access to third-party services and hosts are freaking out", "description": "Turo, the peer-to-peer car rental company,\\xa0plans to block access to third-party services like CarSync and Fleetwire starting April 30, according to an email that hosts received and TechCrunch viewed. Turo confirmed the move, which hosts say will cut them off from essential fleet management tools that allow them to share multiple cars on the platform. [\\u2026]\\nTuro is blocking access to third-party services and hosts are freaking out by Rebecca Bellan originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/turo-is-blocking-access-to-third-party-services-and-hosts-are-freaking-out/", "pubDate": "Tue, 11 Apr 2023 18:58:59 +0000"}, {"title": "The Security Stage debuts at Disrupt 2023", "description": "If you haven\\u2019t noticed, the internet is frequently on fire. Overseas cyberattacks are hitting public services like healthcare at home. Data breaches are the new school \\u201csnow days.\\u201d Small towns and local governments are largely unable to fend off ransomware attacks on their own. Nation-state hackers are undermining human rights and the security and privacy [\\u2026]\\nThe Security Stage debuts at Disrupt 2023 by Zack Whittaker originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/the-security-stage-debuts-at-disrupt-2023/", "pubDate": "Tue, 11 Apr 2023 18:30:19 +0000"}, {"title": "3CX blames North Korea for supply chain mass-hack", "description": "Enterprise phone provider 3CX has confirmed that North Korea\\u2013backed hackers were behind last month\\u2019s supply chain attack that appeared to target cryptocurrency companies. 3CX, which provides online voice, video conferencing and messaging services for businesses, worked with cybersecurity company Mandiant to investigate the attack. Hackers compromised the company\\u2019s desktop phone software used by hundreds of [\\u2026]\\n3CX blames North Korea for supply chain mass-hack by Carly Page originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/3cx-north-korea-cryptocurrency-hack/", "pubDate": "Tue, 11 Apr 2023 18:05:34 +0000"}, {"title": "TechCrunch+ roundup: 5-year business models, RevOps tactics, how much to pay founders?", "description": "When a fighter has no reasonable chance of winning the match, throwing in the towel is the smart move. This also applies to startup founders.\\nTechCrunch+ roundup: 5-year business models, RevOps tactics, how much to pay founders? by Walter Thompson originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/techcrunch-roundup-5-year-business-models-revops-tactics-how-much-to-pay-founders/", "pubDate": "Tue, 11 Apr 2023 17:33:02 +0000"}, {"title": "Artifact, the news aggregator from Instagram’s co-founders, adds a social discussions feature", "description": "Artifact, the recently launched personalized news app from Instagram\\u2019s founders, is today launching a key new feature: a social discussions component. Previously in private testing, the feature introduces a way for users to comment and engage in conversations around news articles they\\u2019re reading on the service. With today\\u2019s update, all Artifact users will now see [\\u2026]\\nArtifact, the news aggregator from Instagram\\u2019s co-founders, adds a social discussions feature by Sarah Perez originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/artifact-the-news-aggregator-from-instagrams-co-founders-adds-a-social-discussions-feature/", "pubDate": "Tue, 11 Apr 2023 17:19:29 +0000"}, {"title": "Instagram adds new features to its creator marketplace, expands access to brand agencies", "description": "Instagram announced today that it\\u2019s extending access to parts of its creator marketplace via API to make it easier for brands to discover and work with creators on the third-party creator marketing platform they already use. The company is also expanding creator marketplace access to brand agencies. The social network launched its creator marketplace last [\\u2026]\\nInstagram adds new features to its creator marketplace, expands access to brand agencies by Aisha Malik originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/instagram-adds-new-features-to-its-creator-marketplace-expands-access-to-brand-agencies/", "pubDate": "Tue, 11 Apr 2023 17:00:12 +0000"}, {"title": "Over 300 gigafactories will make tomorrow’s EVs. We mapped them all", "description": "Venture capitalists and private equity firms have invested over $40 billion into battery technology startups, and some of those investments are now coming to fruition.\\nOver 300 gigafactories will make tomorrow\\u2019s EVs. We mapped them all by Miranda Halpern originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/gigafactory-location-map-electric-vehicles/", "pubDate": "Tue, 11 Apr 2023 17:00:05 +0000"}, {"title": "After spinning out of IBM-acquisition NS1, open source startup NetBox Labs raises $20M", "description": "NetBox Labs, a new open source startup spun out of VC-backed network automation company NS1 back in January, today announced it has raised $20 million in a Series A round of funding from a slew of high-profile investors. NS1, for the uninitiated, is a 10-year-old domain name system (DNS) and network automation platform used by [\\u2026]\\nAfter spinning out of IBM-acquisition NS1, open source startup NetBox Labs raises $20M by Paul Sawers originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/after-spinning-out-of-ibm-acquisition-ns1-open-source-startup-netbox-labs-raises-20m/", "pubDate": "Tue, 11 Apr 2023 16:34:49 +0000"}, {"title": "MCU’s female superhero trio team up in ‘The Marvels’ movie", "description": "Marvel Studios released a teaser trailer today for \\u201cThe Marvels,\\u201d featuring three badass female superheroes \\u2014 Captain Marvel, Ms. Marvel and Captain Rambeau. The movie is set to hit theaters on November 10 and sees Brie Larson, Iman Vellani and Teyonah Parris reprise their roles. \\u201cThe Marvels\\u201d is the third movie of the MCU\\u2019s Phase [\\u2026]\\nMCU\\u2019s female superhero trio team up in \\u2018The Marvels\\u2019 movie by Lauren Forristal originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/mcus-female-superhero-trio-team-up-in-the-marvels-movie/", "pubDate": "Tue, 11 Apr 2023 16:24:12 +0000"}]}