{
    "title": "TechCrunch",
    "link": "",
    "items": [
        {
            "title": "DocuSign could be suffering from a pandemic growth hangover",
            "description": "DocuSign was flying during the pandemic when people couldn't meet in person, but it might have grown too quickly, and it's paying the price.\\nDocuSign could be suffering from a pandemic growth hangover by Ron Miller originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/04/01/docusign-slow-growth/",
            "pubDate": "Sat, 01 Apr 2023 13:00:49 +0000"
        },
        {
            "title": "OpenAI geoblocks ChatGPT in Italy",
            "description": "No, it\\u2019s not an April Fools\\u2019 joke: OpenAI has started geoblocking access to its generative AI chatbot, ChatGPT, in Italy. The move follows an order by the local data protection authority Friday that it must stop processing Italians\\u2019 data for the ChatGPT service. In a statement which appears online to users with an Italian IP [\\u2026]\\nOpenAI geoblocks ChatGPT in Italy by Natasha Lomas originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/04/01/chatgpt-blocked-in-italy/",
            "pubDate": "Sat, 01 Apr 2023 10:15:53 +0000"
        },
        {
            "title": "Ethicists fire back at ‘AI Pause’ letter they say ‘ignores the actual harms’",
            "description": "A group of well-known AI ethicists have written a counterpoint to this week\\u2019s controversial letter asking for a six-month \\u201cpause\\u201d on AI development, criticizing it for a focus on hypothetical future threats when real harms are attributable to misuse of the tech today. Thousands of people, including such familiar names as Steve Wozniak and Elon [\\u2026]\\nEthicists fire back at \\u2018AI Pause\\u2019 letter they say \\u2018ignores the actual harms\\u2019 by Devin Coldewey originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/03/31/ethicists-fire-back-at-ai-pause-letter-they-say-ignores-the-actual-harms/",
            "pubDate": "Sat, 01 Apr 2023 00:18:03 +0000"
        },
        {
            "title": "Daily Crunch: Citing data privacy concerns, Italy temporarily bans ChatGPT",
            "description": "Hello, friends, and welcome to Daily Crunch, bringing you the most important startup, tech and venture capital news in a single package.\\nDaily Crunch: Citing data privacy concerns, Italy temporarily bans ChatGPT by Christine Hall originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/03/31/daily-crunch-citing-data-privacy-concerns-italy-temporarily-bans-chatgpt/",
            "pubDate": "Fri, 31 Mar 2023 22:05:51 +0000"
        },
        {
            "title": "NASA’s DAGGER could give advance warning of the next big solar storm",
            "description": "There\\u2019s enough trouble on this planet already that we don\\u2019t need new problems coming here from the sun. Unfortunately, we can\\u2019t yet destroy this pitiless star, so we are at its mercy. But NASA at least may soon be able to let us know when one of its murderous flares is going to send our [\\u2026]\\nNASA\\u2019s DAGGER could give advance warning of the next big solar storm by Devin Coldewey originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/03/31/nasas-dagger-could-give-advance-warning-of-the-next-big-solar-storm/",
            "pubDate": "Fri, 31 Mar 2023 21:56:08 +0000"
        },
        {
            "title": "A judge dismissed Phhhoto’s antitrust suit against Meta",
            "description": "A U.S. District Court Judge for the Eastern District of New York threw out a lawsuit against Meta this week that had been simmering for a year and a half. The suit, filed in late 2021 by now-shuttered social app Phhhoto, alleged that Meta violated federal antitrust law by copying its core features with the [\\u2026]\\nA judge dismissed Phhhoto\\u2019s antitrust suit against Meta by Taylor Hatmaker originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/03/31/a-judge-dismissed-phhhotos-antitrust-suit-against-meta/",
            "pubDate": "Fri, 31 Mar 2023 20:41:02 +0000"
        },
        {
            "title": "Celebrities don’t want to pay Elon for a blue check",
            "description": "April 1 is the dumbest day on the internet, and this year, it\\u2019s not just because brands will try to prank you by selling \\u201chot iced coffee.\\u201d Starting on Saturday, Twitter will begin removing blue checks from \\u201clegacy verified\\u201d users if they don\\u2019t sign up for a Twitter Blue subscription. This is part of new [\\u2026]\\nCelebrities don\\u2019t want to pay Elon for a blue check by Amanda Silberling originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/03/31/celebrity-blue-check-twitter-verification/",
            "pubDate": "Fri, 31 Mar 2023 20:16:35 +0000"
        },
        {
            "title": "Twitter reveals some of its source code, including its recommendation algorithm",
            "description": "As repeatedly promised by Twitter CEO Elon Musk, Twitter has opened a portion of its source code to public inspection, including the algorithm it uses to recommend tweets in users\\u2019 timelines. On GitHub, Twitter published two repositories containing code for many parts that make the social network tick, including the mechanism Twitter uses to control [\\u2026]\\nTwitter reveals some of its source code, including its recommendation algorithm by Kyle Wiggers originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/03/31/twitter-reveals-some-of-its-source-code-including-its-recommendation-algorithm/",
            "pubDate": "Fri, 31 Mar 2023 18:45:43 +0000"
        },
        {
            "title": "24 hours left to save $200 on TC Early Stage tickets",
            "description": "TechCrunch Early Stage is less than three weeks away from kicking off on April 20 in the Hub of the Universe \\u2014 Boston. That\\u2019s just one of Boston\\u2019s nicknames. Who knew? But listen up, because in less than 24 hours you\\u2019ll miss out on saving some big-time cash if you don\\u2019t take advantage of our [\\u2026]\\n24 hours left to save $200 on TC Early Stage tickets by Alexandra Ames originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/03/31/24-hours-left-to-save-200-on-tc-early-stage-tickets/",
            "pubDate": "Fri, 31 Mar 2023 18:45:17 +0000"
        },
        {
            "title": "Stability AI CEO has the ambition to IPO in next few years",
            "description": "Emad Mostaque, the CEO and founder of open source platform Stability AI, hinted at plans to go public in the next few years, during the Cerebral Valley AI Conference in San Francisco on Thursday. He also shut down the idea that Stability AI, an OpenAI rival and leader in the generative artificial intelligence space, will [\\u2026]\\nStability AI CEO has the ambition to IPO in next few years by Natasha Mascarenhas originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/03/31/stability-ai-ceo-has-the-ambition-to-ipo-in-next-few-years/",
            "pubDate": "Fri, 31 Mar 2023 18:37:45 +0000"
        },
        {
            "title": "Netflix restructures its film units, aiming to make fewer (but better) original movies",
            "description": "Netflix is restructuring its film units and vowing to make fewer but better movies, according to a new report from Bloomberg, which Netflix partially confirmed. The report said the streaming giant is combining film units that produce small and midsize films, resulting in a handful of layoffs, including two longtime executives. Netflix told TechCrunch that [\\u2026]\\nNetflix restructures its film units, aiming to make fewer (but better) original movies by Aisha Malik originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/03/31/netflix-restructures-its-film-units-aiming-to-make-fewer-but-better-original-movies/",
            "pubDate": "Fri, 31 Mar 2023 18:20:01 +0000"
        },
        {
            "title": "What’s going on with the TikTok ban?",
            "description": "TikTok\\u2019s fate is far from sealed. We\\u2019ve answered some common questions about a situation that\\u2019s complex, confusing and changing as we speak.\\nWhat\\u2019s going on with the TikTok ban? by Taylor Hatmaker originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/03/31/whats-going-on-with-the-tiktok-ban/",
            "pubDate": "Fri, 31 Mar 2023 18:00:02 +0000"
        },
        {
            "title": "Hulu debuts a new interface with a vertical sidebar on Fire TV, Apple TV and Roku",
            "description": "Hulu is slowly rolling out a new interface on streaming devices like Fire TV, Apple TV and Roku, among other compatible devices. The new redesign moves the navigation to the left side with options for TV, Movies and My Stuff. The company confirmed to TechCrunch that the updated interface began rolling yesterday. It will be [\\u2026]\\nHulu debuts a new interface with a vertical sidebar on Fire TV, Apple TV and Roku by Ivan Mehta originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/03/31/hulus-new-interface-with-a-revamped-sidebar-is-rolling-out-on-fire-tv-apple-tv-and-roku/",
            "pubDate": "Fri, 31 Mar 2023 17:45:13 +0000"
        },
        {
            "title": "TechCrunch+ roundup: 3 key hiring metrics, building SDR teams, insurtech investor survey",
            "description": "Marketing teams get a lot of credit for landing new customers, but in reality, sales development representatives do most of the actual work.\\nTechCrunch+ roundup: 3 key hiring metrics, building SDR teams, insurtech investor survey by Walter Thompson originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/03/31/techcrunch-roundup-3-key-hiring-metrics-building-sdr-teams-insurtech-investor-survey/",
            "pubDate": "Fri, 31 Mar 2023 17:01:47 +0000"
        },
        {
            "title": "The lowdown for European startups looking to raise money in 2023",
            "description": "We\\u2019re looking at Europe's Q1 2023 venture capital tallies and considering the three largest venture markets in the region: the U.K., Germany and France.\\nThe lowdown for European startups looking to raise money in 2023 by Anna Heim originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/03/31/venture-fundraising-european-startups-2023/",
            "pubDate": "Fri, 31 Mar 2023 17:00:30 +0000"
        },
        {
            "title": "Artie sidesteps the app stores by putting high-quality games in your browser",
            "description": "When you play a game, how do you play it? Monopoly or Settlers of Catan around the dining table? Mario Kart on your Nintendo Switch? Assassin\\u2019s Creed on your Xbox? Among Us on your phone? Usually, they are games with a physical form, a console or an app. Artie is gearing up to shake up [\\u2026]\\nArtie sidesteps the app stores by putting high-quality games in your browser by Haje Jan Kamps originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/03/31/artie-browser/",
            "pubDate": "Fri, 31 Mar 2023 16:00:16 +0000"
        },
        {
            "title": "Investors unfazed by Q1 crypto funding decline",
            "description": "Crypto-focused venture capital investors remain confident in the market as total capital raised dropped in the first quarter.\\nInvestors unfazed by Q1 crypto funding decline by Jacquelyn Melinek originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/03/31/crypto-q1-decline-analysis/",
            "pubDate": "Fri, 31 Mar 2023 16:00:11 +0000"
        },
        {
            "title": "Review: Xbloom makes perfect pour-over so you don’t have to",
            "description": "Coffee nerds love the ceremony of making a good cup of coffee, but once you get advanced enough, things get really complex really fast. Making high-end pour-over coffee is a fine dance of grinding, pouring, temperature and patience, and it turns out that a lot of us just cannot be bothered with learning enough (or [\\u2026]\\nReview: Xbloom makes perfect pour-over so you don\\u2019t have to by Haje Jan Kamps originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/03/31/xbloom-pour-over/",
            "pubDate": "Fri, 31 Mar 2023 15:55:50 +0000"
        },
        {
            "title": "France moves forward with influencer bill cracking down on risky products and more",
            "description": "The lower chamber of the French parliament, the National Assembly, passed a cross-party bill that aims to introduce some new requirements for social media influencers. This is a preliminary vote as the bill will move to the Senate, but there\\u2019s a high probably that it will be adopted in a few weeks as all the [\\u2026]\\nFrance moves forward with influencer bill cracking down on risky products and more by Romain Dillet originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/03/31/france-moves-forward-with-influencer-bill-cracking-down-on-risky-products-and-more/",
            "pubDate": "Fri, 31 Mar 2023 15:42:51 +0000"
        },
        {
            "title": "Groupon, which has lost 99.4% of its value since its IPO, names a new CEO… based in Czech Republic",
            "description": "A dozen years ago, Groupon shot to fame popularizing the online group buying format, confidently rejecting a $6 billion acquisition offer from Google and instead going public with a $17.8 billion market cap. The company today says it has 14 million active users, but almost consistently for the last decade, its financial position has been [\\u2026]\\nGroupon, which has lost 99.4% of its value since its IPO, names a new CEO\\u2026 based in Czech Republic by Ingrid Lunden originally published on TechCrunch\\n",
            "link": "https://techcrunch.com/2023/03/31/groupon-which-has-lost-99-4-of-its-value-since-its-ipo-names-a-new-ceo-based-in-czech-republic/",
            "pubDate": "Fri, 31 Mar 2023 15:17:39 +0000"
        }
    ]
}
