[{"id_field": "05013e4c-52b8-4162-b8c3-5b8f0850edbe", "embed_text": "Twitter Is Dead: It's All 'X Corp' Now - Twitter has been subsumed by billionaire Elon Musk in more ways than one. Now, however, the company itself is officially no longer its own entity, having been officially gobbled up by Musk\\u2019s X Corp. It stands as the blue bird app owner\\u2019s first official move to reinvent Twitter into a twisted version of its former\\u2026Read more...", "title": "Twitter Is Dead: It's All 'X Corp' Now", "description": "Twitter has been subsumed by billionaire Elon Musk in more ways than one. Now, however, the company itself is officially no longer its own entity, having been officially gobbled up by Musk\\u2019s X Corp. It stands as the blue bird app owner\\u2019s first official move to reinvent Twitter into a twisted version of its former\\u2026Read more...", "link": "https://gizmodo.com/twitter-x-elon-musk-wechat-everything-app-1850322566", "pubDate": "Tue, 11 Apr 2023 13:12:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "054c606f-72b1-42ec-8266-7a2b6cb8dbfc", "embed_text": "China Will Smash a Spacecraft Into This Near-Earth Asteroid in Planetary Defense Test - China has selected a small, near-Earth asteroid as the target for an upcoming mission that will help it prepare against future threats of incoming space rocks.Read more...", "title": "China Will Smash a Spacecraft Into This Near-Earth Asteroid in Planetary Defense Test", "description": "China has selected a small, near-Earth asteroid as the target for an upcoming mission that will help it prepare against future threats of incoming space rocks.Read more...", "link": "https://gizmodo.com/china-smash-spacecraft-asteroid-planetary-defense-1850323095", "pubDate": "Tue, 11 Apr 2023 17:10:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "071a1634-0567-425a-85db-47762587c169", "embed_text": "Disney's Peter Pan & Wendy Shares a Fanciful New Trailer - Just because Disney is releasing Peter Pan & Wendy straight to Disney+, it doesn\\u2019t want you to think any less of what it\\u2019s describing as an \\u201cepic movie event.\\u201d A new trailer suggests this latest release from David Lowery\\u2014the director of the noted visual feast The Green Knight\\u2014will indeed be cramming as much epic as it\\u2026Read more...", "title": "Disney's Peter Pan & Wendy Shares a Fanciful New Trailer", "description": "Just because Disney is releasing Peter Pan & Wendy straight to Disney+, it doesn\\u2019t want you to think any less of what it\\u2019s describing as an \\u201cepic movie event.\\u201d A new trailer suggests this latest release from David Lowery\\u2014the director of the noted visual feast The Green Knight\\u2014will indeed be cramming as much epic as it\\u2026Read more...", "link": "https://gizmodo.com/disney-peter-pan-and-wendy-trailer-jude-law-tinker-bell-1850319294", "pubDate": "Mon, 10 Apr 2023 17:45:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "095d545e-8e60-4d33-a1e1-711ecbedbb38", "embed_text": "Pentagon Classified Documents Leak Linked to Discord - After a batch of classified documents were leaked from the Pentagon, it appears  open-source intelligence analysts have pinned the leak down to an unlikely place: Discord. The documents were apparently used by patrons of the messaging platform, which is frequently used by avid video game players, in order to settle a\\u2026Read more...", "title": "Pentagon Classified Documents Leak Linked to Discord", "description": "After a batch of classified documents were leaked from the Pentagon, it appears  open-source intelligence analysts have pinned the leak down to an unlikely place: Discord. The documents were apparently used by patrons of the messaging platform, which is frequently used by avid video game players, in order to settle a\\u2026Read more...", "link": "https://gizmodo.com/pentagon-leaked-documents-discord-russia-1850324107", "pubDate": "Tue, 11 Apr 2023 19:25:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "0a3e7925-5573-407d-b0fb-70e5d45ef7aa", "embed_text": "Google is No Longer Supporting These Five-Year-Old Devices - Google does not plan to update third-party smart displays in the future. If you own any of the Lenovo, JBL, or LG-made smart displays that have come out over the past five years, it\\u2019s time to consider alternatives for your Google smart home. Another reason to be wary of being a Google early adopter.Read more...", "title": "Google is No Longer Supporting These Five-Year-Old Devices", "description": "Google does not plan to update third-party smart displays in the future. If you own any of the Lenovo, JBL, or LG-made smart displays that have come out over the past five years, it\\u2019s time to consider alternatives for your Google smart home. Another reason to be wary of being a Google early adopter.Read more...", "link": "https://gizmodo.com/google-smart-home-third-party-displays-android-things-1850320510", "pubDate": "Mon, 10 Apr 2023 21:20:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "1006f891-abeb-4e2c-ad5e-32ecb2ff8f6c", "embed_text": "Studio Ghibli Teases Another Star Wars Collaboration - Last November, the nerd-o-sphere understandably freaked out when Studio Ghibli co-founder and all-time most beloved anime filmmaker Hayao Miyazaki released a single photo of the director with the above Grogu figurine. Star Wars fans  (including us!) wondered if it meant the legendary anime studio would be making a\\u2026Read more...", "title": "Studio Ghibli Teases Another Star Wars Collaboration", "description": "Last November, the nerd-o-sphere understandably freaked out when Studio Ghibli co-founder and all-time most beloved anime filmmaker Hayao Miyazaki released a single photo of the director with the above Grogu figurine. Star Wars fans  (including us!) wondered if it meant the legendary anime studio would be making a\\u2026Read more...", "link": "https://gizmodo.com/star-wars-ghibli-hayao-miyazaki-anime-studio-ahsoka-1850319395", "pubDate": "Mon, 10 Apr 2023 17:00:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "126fc241-297b-4891-8efe-16973b70c6d5", "embed_text": "Study Finds Shockingly Fast Sea Level Rise Around U.S. Southeast and Gulf Coast - Sea level rise is transforming the U.S. coastline across the country, but researchers have noticed that the rate of sea level rise has increased faster in the last decade around the Gulf and Southeastern coasts. Read more...", "title": "Study Finds Shockingly Fast Sea Level Rise Around U.S. Southeast and Gulf Coast", "description": "Sea level rise is transforming the U.S. coastline across the country, but researchers have noticed that the rate of sea level rise has increased faster in the last decade around the Gulf and Southeastern coasts. Read more...", "link": "https://gizmodo.com/fast-sea-level-rise-southeast-gulf-coast-usa-1850319658", "pubDate": "Mon, 10 Apr 2023 21:05:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "1412e25e-48e1-48eb-b17b-62c3cc1d8878", "embed_text": "Judge Orders Elizabeth Holmes to Trade Mansion for Prison as She Appeals - After being convicted of wire fraud for her dealings with her failed blood startup Theranos, Elizabeth Holmes was hoping to remain free on bail while she appeals the decision. Unfortunately for her, a federal judge has denied her that luxury.Read more...", "title": "Judge Orders Elizabeth Holmes to Trade Mansion for Prison as She Appeals", "description": "After being convicted of wire fraud for her dealings with her failed blood startup Theranos, Elizabeth Holmes was hoping to remain free on bail while she appeals the decision. Unfortunately for her, a federal judge has denied her that luxury.Read more...", "link": "https://gizmodo.com/elizabeth-holmes-theranos-appeal-prison-1850322560", "pubDate": "Tue, 11 Apr 2023 14:25:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "18030e4b-7208-439a-afbc-b7eb0cd4f9ff", "embed_text": "New NASA Official Took Her Oath of Office on Carl Sagan’s ‘Pale Blue Dot’ - When Dr. Makenzie Lystrup was sworn in as the new director of NASA\\u2019s Goddard Space Flight Center last week, she didn\\u2019t take her oath of office on the Bible or the U.S. Constitution, but rather on a tome revered by space enthusiasts everywhere: Carl Sagan\\u2019s Pale Blue Dot.Read more...", "title": "New NASA Official Took Her Oath of Office on Carl Sagan’s ‘Pale Blue Dot’", "description": "When Dr. Makenzie Lystrup was sworn in as the new director of NASA\\u2019s Goddard Space Flight Center last week, she didn\\u2019t take her oath of office on the Bible or the U.S. Constitution, but rather on a tome revered by space enthusiasts everywhere: Carl Sagan\\u2019s Pale Blue Dot.Read more...", "link": "https://gizmodo.com/nasa-goddard-makenzie-lystrup-sagan-pale-blue-dot-1850320312", "pubDate": "Tue, 11 Apr 2023 17:11:56 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "1d3a36d2-f125-499b-9e47-2294c6881418", "embed_text": "FTX's Cybersecurity Was Hilariously Bad - \\xa0Read more...", "title": "FTX's Cybersecurity Was Hilariously Bad", "description": "\\xa0Read more...", "link": "https://gizmodo.com/ftx-sam-bankman-fried-cybersecurity-hacking-crypto-1850321150", "pubDate": "Tue, 11 Apr 2023 01:50:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "238cf8c5-7291-45d9-8e0a-543fe7191ed0", "embed_text": "'Thirsty' AI: Training ChatGPT Required Enough Water to Fill a Nuclear Reactor's Cooling Tower, Study Finds - Popular large language models (LLMs) like OpenAI\\u2019s ChatGPT and Google\\u2019s Bard are energy intensive, requiring massive server farms to provide enough data to train the powerful programs. Cooling those same data centers also makes the AI chatbots incredibly thirsty. New research suggests training for GPT-3 alone consumed\\u2026Read more...", "title": "'Thirsty' AI: Training ChatGPT Required Enough Water to Fill a Nuclear Reactor's Cooling Tower, Study Finds", "description": "Popular large language models (LLMs) like OpenAI\\u2019s ChatGPT and Google\\u2019s Bard are energy intensive, requiring massive server farms to provide enough data to train the powerful programs. Cooling those same data centers also makes the AI chatbots incredibly thirsty. New research suggests training for GPT-3 alone consumed\\u2026Read more...", "link": "https://gizmodo.com/chatgpt-ai-water-185000-gallons-training-nuclear-1850324249", "pubDate": "Tue, 11 Apr 2023 19:45:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "409a8301-0eb9-4884-9a97-8d067f3c603c", "embed_text": "Stay Warm Like a Polar Bear With Sunlight-Capturing Fabric - Bundling up in a puffy Canada Goose jacket isn\\u2019t just a fashion statement; the coats are filled with goose down that helps trap and retain body heat when temperatures plummet. But engineers from the  University of Massachusetts Amherst have drawn inspiration from another animal that calls Canada home, and have now \\u2026Read more...", "title": "Stay Warm Like a Polar Bear With Sunlight-Capturing Fabric", "description": "Bundling up in a puffy Canada Goose jacket isn\\u2019t just a fashion statement; the coats are filled with goose down that helps trap and retain body heat when temperatures plummet. But engineers from the  University of Massachusetts Amherst have drawn inspiration from another animal that calls Canada home, and have now \\u2026Read more...", "link": "https://gizmodo.com/fabric-polar-bear-fur-jacket-sunlight-solar-fiber-optic-1850322902", "pubDate": "Tue, 11 Apr 2023 16:17:25 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "4bc70688-3831-495b-94dc-95bb137ee123", "embed_text": "Upper Stage of NASA's Artemis 2 Megarocket Is Ready for Tests - NASA\\u2019s Artemis 2 is feeling realer by the minute. The next upper stage of the Space Launch System (SLS) megarocket is now ready for tests at Cape Canaveral, Florida, in advance of the upcoming mission. Read more...", "title": "Upper Stage of NASA's Artemis 2 Megarocket Is Ready for Tests", "description": "NASA\\u2019s Artemis 2 is feeling realer by the minute. The next upper stage of the Space Launch System (SLS) megarocket is now ready for tests at Cape Canaveral, Florida, in advance of the upcoming mission. Read more...", "link": "https://gizmodo.com/upper-stage-nasa-artemis-sls-megarocket-ready-tests-1850324870", "pubDate": "Tue, 11 Apr 2023 21:10:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "4e8c6b69-e07e-47e1-a9c2-d5ce87d24069", "embed_text": "'Better Drugs, Better Health': A Human Genome Pioneer Talks About the Future of Genetics - Twenty years ago, the Human Genome Project officially wrapped up. It was a feat of collaborative science that took  13 years\\u2014from 1990 to 2003\\u2014and involved researchers from around the globe.Read more...", "title": "'Better Drugs, Better Health': A Human Genome Pioneer Talks About the Future of Genetics", "description": "Twenty years ago, the Human Genome Project officially wrapped up. It was a feat of collaborative science that took  13 years\\u2014from 1990 to 2003\\u2014and involved researchers from around the globe.Read more...", "link": "https://gizmodo.com/richard-gibbs-human-genome-project-future-genetics-1850309699", "pubDate": "Tue, 11 Apr 2023 20:06:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "528df13a-421d-4848-9299-edb9d57b5394", "embed_text": "Renfield's Director and Writer Talk Practical Effects | io9 Interview - Read more...", "title": "Renfield's Director and Writer Talk Practical Effects | io9 Interview", "description": "Read more...", "link": "https://gizmodo.com/renfield-video-interview-chris-mckay-robert-kirkman-1850298392", "pubDate": "Tue, 11 Apr 2023 15:15:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "57a57dbf-93d0-4fd1-b2f7-a7635b426a14", "embed_text": "Binance Searches for Alleged Source Code Leaker - The world\\u2019s largest crypto exchange is on the hunt for a user it says publicly posted the keys to its crypto kingdom. In court documents first filed April 7, Binance asked the court to grant a subpoena against GitHub, trying to find any information about a user whom the company said had leaked excerpts of the Binance\\u2026Read more...", "title": "Binance Searches for Alleged Source Code Leaker", "description": "The world\\u2019s largest crypto exchange is on the hunt for a user it says publicly posted the keys to its crypto kingdom. In court documents first filed April 7, Binance asked the court to grant a subpoena against GitHub, trying to find any information about a user whom the company said had leaked excerpts of the Binance\\u2026Read more...", "link": "https://gizmodo.com/binance-source-code-crypto-cz-1850323685", "pubDate": "Tue, 11 Apr 2023 17:46:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "885bcac7-90fd-46a0-a03a-f17c1107607f", "embed_text": "Google Pixel 7a Leak Shows a 90Hz Refresh Rate, More Memory - It\\u2019ll be a while before Google reprises its flagship Pixel series. Until then, we have Pixel 7a leaks to tide us over. The latest hints from overseas include a look at the phone itself and hint as to what kind of specs might be inside it. Google\\u2019s next mid-range Pixel could have more memory than its predecessor and a\\u2026Read more...", "title": "Google Pixel 7a Leak Shows a 90Hz Refresh Rate, More Memory", "description": "It\\u2019ll be a while before Google reprises its flagship Pixel series. Until then, we have Pixel 7a leaks to tide us over. The latest hints from overseas include a look at the phone itself and hint as to what kind of specs might be inside it. Google\\u2019s next mid-range Pixel could have more memory than its predecessor and a\\u2026Read more...", "link": "https://gizmodo.com/google-pixel-7a-refresh-rate-memory-90hz-6a-leak-specs-1850220667", "pubDate": "Mon, 10 Apr 2023 16:19:45 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "9751f035-d130-476c-962d-384fed242a18", "embed_text": "The Strangest Amber Fossils Ever Discovered - Amber fossils are like a time capsule, preserving the three-dimensional structure of animals, plants, and other prehistoric items of interest. Every once in a while, however, paleontologists stumble upon some particularly bizarre specimens and scenes.Read more...", "title": "The Strangest Amber Fossils Ever Discovered", "description": "Amber fossils are like a time capsule, preserving the three-dimensional structure of animals, plants, and other prehistoric items of interest. Every once in a while, however, paleontologists stumble upon some particularly bizarre specimens and scenes.Read more...", "link": "https://gizmodo.com/the-strangest-amber-fossils-ever-discovered-1845427065", "pubDate": "Mon, 10 Apr 2023 17:05:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "9e2d562b-3914-4c9a-826a-284c41509e76", "embed_text": "Bid Star Trek: Picard a Supersized Farewell by Watching the Finale in Imax - The end of Star Trek: Picard is nearly here, and Paramount+ is giving the series  a big send-off. Oversized, even: the remaining two episodes of the show\\u2019s third and final season (this week\\u2019s \\u201cVox\\u201d and the series finale) will be shared in a special Imax live presentation. Even better, fans will get to see the finale\\u2026Read more...", "title": "Bid Star Trek: Picard a Supersized Farewell by Watching the Finale in Imax", "description": "The end of Star Trek: Picard is nearly here, and Paramount+ is giving the series  a big send-off. Oversized, even: the remaining two episodes of the show\\u2019s third and final season (this week\\u2019s \\u201cVox\\u201d and the series finale) will be shared in a special Imax live presentation. Even better, fans will get to see the finale\\u2026Read more...", "link": "https://gizmodo.com/star-trek-picard-finale-imax-paramount-patrick-stewart-1850324673", "pubDate": "Tue, 11 Apr 2023 21:00:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com"}, {"id_field": "041bbf9f-1e64-4945-9252-f7c597057766", "embed_text": "Best dating sites for women: How to find the connection you're looking for online - Being a woman on the internet is hard. At times scary and exhausting, too.From Twitter reply guys to other forms of online harassment to straight-up cyberstalking, letting women exist in peace seems to be a hard concept for society to grasp. When it comes to dating apps specifically, unfortunately, some people assume that merely having a profile is an invitation to send creepy comments and overstep boundaries, so the chance of women enduring such unsettling experiences feels doubled. The onslaught of men grasping at straws for attention with messages saying \"think they saw you somewhere\" or requesting nudes in their opening line is an online dating specialty. Queer women on dating apps face all of these same challenges, plus an extra shop of horrors run by fetishization, ignorant cis straight people, and the feeling of not being queer enough.\\nSEE ALSO:\\n\\n            How to maneuver dating apps when you're bisexual\\n            \\n\\n\\nIs it easier to shoot your shot by simply using a hot selfie on your Instagram story as bait for your crush to swipe up on? I mean, that's a classic tactic that'll never die. But unless you and said crush are already in some sort of flirtationship and already follow each other on social media, finding love, a hookup, or someone to grab a drink with could happen a lot faster with the right dating app. At least, it definitely offers more opportunities than waiting to meet someone at work or agreeing to a blind date set up by your mom. We promise you have more options than TinderThough it may have a bad rep, the OG swiping app Tinder can truly be a great place to meet genuine people who are open to getting serious, find a reliable friend with benefits, or get a good old-fashioned confidence boost from a mutual right swipe. But if you're frustrated with horny jerks disguising themselves as relationship seekers or actual relationship seekers who can't handle it when you say you're just looking for a hookup, opting for a dating site more finely tuned to what you're looking for lets you narrow the pool and save some time. Maybe you can't stand starting every conversation from scratch. Maybe your biggest fear is ending up on a date with someone who doesn't care about voting. Instead of a half-assed bio, dating apps that delve into someone's hobbies, favorite movies, career goals, or political views before even talking to them provide a wealth of clever icebreakers to ensure that you aren't going into things blindly. Dating apps are trying to make things safer IRLMeeting someone from the internet in person for the first time is nerve-wracking for anyone. But for women, it can dredge up the same fear that occurs when walking alone past a big group of men. Though there are always some precautions you can take, having in-app safety features can go a long way in making you more comfortable with online dating.Match Group is making strides toward a safer dating experience: Tinder was the first to unveil features coming out of its partnership with Noonlight, a safety app that tracks the location of users and notifies authorities if there are concerns. Before heading out on a date, Tinder users can log info about where they're going and who they're meeting, as well as hit a panic button to alert authorities if there's an emergency. (Match Group plans to roll out the same features for its other apps, like Hinge and OkCupid, later.) As of March 2022, after a year of testing, all Tinder users can access free background checks on their matches. How the pandemic has changed dating for the betterCOVID changed online dating dynamics forever. \"Double vaxxed up and boosted\" being a genuine turn-on is the obvious addition to 2022 dating checklists, but there's something about dating discourse that we think could positively affect communication between strangers in the long run.\\nSEE ALSO:\\n\\n            4 of the top dating trends for 2022, so far\\n            \\n\\n\\nWaiting to meet each other and getting to know a match through FaceTime is kind of the norm now \\u2014 and people don't really want that to change, even once the pandemic has fully subsided. For the women who'd prefer to gather crumbs of someone's vibe before meeting in person, online dating's shift to video dating in 2020 could prove comforting. It goes without saying that you're never required to meet up with a match in person immediately, but it'd be nice not to be pestered about it.The communication skills gained through hashing out COVID-related issues aren't for nothing, either. People have gotten comfortable with bringing up personal boundaries and bonding over universal anxieties with someone they met on a dating app \\u2014 both of which could benefit women online. Tinder thinks the honesty will carry over when things are back to normal, and hopefully the assholes will continue to weed themselves out. What are the best dating sites for women?Here are the best dating sites and apps for single women looking for a date, a movie buddy, a friend with benefits, or a romantic commitment.\\xa0", "title": "Best dating sites for women: How to find the connection you're looking for online", "description": "Being a woman on the internet is hard. At times scary and exhausting, too.From Twitter reply guys to other forms of online harassment to straight-up cyberstalking, letting women exist in peace seems to be a hard concept for society to grasp. When it comes to dating apps specifically, unfortunately, some people assume that merely having a profile is an invitation to send creepy comments and overstep boundaries, so the chance of women enduring such unsettling experiences feels doubled. The onslaught of men grasping at straws for attention with messages saying \"think they saw you somewhere\" or requesting nudes in their opening line is an online dating specialty. Queer women on dating apps face all of these same challenges, plus an extra shop of horrors run by fetishization, ignorant cis straight people, and the feeling of not being queer enough.\\nSEE ALSO:\\n\\n            How to maneuver dating apps when you're bisexual\\n            \\n\\n\\nIs it easier to shoot your shot by simply using a hot selfie on your Instagram story as bait for your crush to swipe up on? I mean, that's a classic tactic that'll never die. But unless you and said crush are already in some sort of flirtationship and already follow each other on social media, finding love, a hookup, or someone to grab a drink with could happen a lot faster with the right dating app. At least, it definitely offers more opportunities than waiting to meet someone at work or agreeing to a blind date set up by your mom. We promise you have more options than TinderThough it may have a bad rep, the OG swiping app Tinder can truly be a great place to meet genuine people who are open to getting serious, find a reliable friend with benefits, or get a good old-fashioned confidence boost from a mutual right swipe. But if you're frustrated with horny jerks disguising themselves as relationship seekers or actual relationship seekers who can't handle it when you say you're just looking for a hookup, opting for a dating site more finely tuned to what you're looking for lets you narrow the pool and save some time. Maybe you can't stand starting every conversation from scratch. Maybe your biggest fear is ending up on a date with someone who doesn't care about voting. Instead of a half-assed bio, dating apps that delve into someone's hobbies, favorite movies, career goals, or political views before even talking to them provide a wealth of clever icebreakers to ensure that you aren't going into things blindly. Dating apps are trying to make things safer IRLMeeting someone from the internet in person for the first time is nerve-wracking for anyone. But for women, it can dredge up the same fear that occurs when walking alone past a big group of men. Though there are always some precautions you can take, having in-app safety features can go a long way in making you more comfortable with online dating.Match Group is making strides toward a safer dating experience: Tinder was the first to unveil features coming out of its partnership with Noonlight, a safety app that tracks the location of users and notifies authorities if there are concerns. Before heading out on a date, Tinder users can log info about where they're going and who they're meeting, as well as hit a panic button to alert authorities if there's an emergency. (Match Group plans to roll out the same features for its other apps, like Hinge and OkCupid, later.) As of March 2022, after a year of testing, all Tinder users can access free background checks on their matches. How the pandemic has changed dating for the betterCOVID changed online dating dynamics forever. \"Double vaxxed up and boosted\" being a genuine turn-on is the obvious addition to 2022 dating checklists, but there's something about dating discourse that we think could positively affect communication between strangers in the long run.\\nSEE ALSO:\\n\\n            4 of the top dating trends for 2022, so far\\n            \\n\\n\\nWaiting to meet each other and getting to know a match through FaceTime is kind of the norm now \\u2014 and people don't really want that to change, even once the pandemic has fully subsided. For the women who'd prefer to gather crumbs of someone's vibe before meeting in person, online dating's shift to video dating in 2020 could prove comforting. It goes without saying that you're never required to meet up with a match in person immediately, but it'd be nice not to be pestered about it.The communication skills gained through hashing out COVID-related issues aren't for nothing, either. People have gotten comfortable with bringing up personal boundaries and bonding over universal anxieties with someone they met on a dating app \\u2014 both of which could benefit women online. Tinder thinks the honesty will carry over when things are back to normal, and hopefully the assholes will continue to weed themselves out. What are the best dating sites for women?Here are the best dating sites and apps for single women looking for a date, a movie buddy, a friend with benefits, or a romantic commitment.\\xa0", "link": "https://mashable.com/roundup/best-dating-sites-women", "pubDate": "Mon, 10 Apr 2023 15:45:04 +0000", "feed_title": "Mashable", "feed_link": "null"}, {"id_field": "128212e3-f6ed-4e4e-af82-62ee3ecb151c", "embed_text": "'Quordle' today: Here are the answers and hints for April 11 - If Quordle is a little too challenging today, you've come to the right place for hints. There aren't just hints here, but the whole Quordle solution. Scroll to the bottom of this page, and there it is. But are you sure you need all four answers? Maybe you just need a strategy guide. Either way, scroll down, and you'll get what you need. What is Quordle?Quordle is a five-letter word guessing game similar to Wordle, except each guess applies letters to four words at the same time. You get nine guesses instead of six to correctly guess all four words. It looks like playing four Wordle games at the same time, and that is essentially what it is. But it's not nearly as intimidating as it sounds.Is Quordle harder than Wordle?Yes, though not diabolically so.Where did Quordle come from?Amid the Wordle boom of late 2021 and early 2022, when everyone was learning to love free, in-browser, once-a-day word guessing games, creator Freddie Meyer says he took inspiration from one of the first big Wordle variations, Dordle \\u2014 the one where you essentially play two Wordles at once. He took things up a notch, and released Quordle on January 30. Meyer's creation was covered in The Guardian six days later, and now, according to Meyer, it attracts millions of daily users. Today, Meyer earns modest revenue from Patreon, where dedicated Quordle fans can donate to keep their favorite puzzle game running.\\xa0How is Quordle pronounced?\\u201cKwordle.\\u201d It should rhyme with \\u201cWordle,\\u201d and definitely should not be pronounced exactly like \"curdle.\\u201dIs Quordle strategy different from Wordle?Yes and no.Your starting strategy should be the same as with Wordle. In fact, if you have a favorite Wordle opening word, there\\u2019s no reason to change that here. We suggest something rich in vowels, featuring common letters like C, R, and N. But you do you.After your first guess, however, you\\u2019ll notice things getting out of control if you play Quordle exactly like Wordle.What should I do in Quordle that I don\\u2019t do in Wordle?Solving a Wordle puzzle can famously come down to a series of single letter-change variations. If you\\u2019ve narrowed it down to \\u201c-IGHT,\\u201d you could guess \\u201cMIGHT\\u201d \\u201cNIGHT\\u201d \\u201cLIGHT\\u201d and \\u201cSIGHT\\u201d and one of those will probably be the solution \\u2014 though this is also a famous way to end up losing in Wordle, particularly if you play on \\u201chard mode.\\u201d In Quordle, however, this sort of single-letter winnowing is a deadly trap, and it hints at the important strategic difference between Wordle and Quordle: In Quordle, you can't afford to waste guesses unless you're eliminating as many letters as possible at all times.\\xa0Guessing a completely random word that you already know isn't the solution, just to eliminate three or four possible letters you haven\\u2019t tried yet, is thought of as a desperate, latch-ditch move in Wordle. In Quordle, however, it's a normal part of the player's strategic toolset.Is there a way to get the answer faster?In my experience Quordle can be a slow game, sometimes dragging out longer than it would take to play Wordle four times. But a sort of blunt-force guessing approach can speed things up. The following strategy also works with Wordle if you only want the solution, and don\\u2019t care about having the fewest possible guesses:Try starting with a series of words that puts all the vowels (including Y) on the board, along with some other common letters. We've had good luck with the three words: \\u201cNOTES,\\u201d \\u201cACRID,\\u201d and \\u201cLUMPY.\\u201d YouTuber DougMansLand suggests four words: \\u201cCANOE,\\u201d \\u201cSKIRT,\\u201d \\u201cPLUMB,\\u201d and \\u201cFUDGY.\\u201dMost of the alphabet is now eliminated, and you\\u2019ll only have the ability to make one or two wrong guesses if you use this strategy. But in most cases you\\u2019ll have all the information you need to guess the remaining words without any wrong guesses.If strategy isn't helping, and you're still stumped, here are some hints:Are there any double or triple letters in today\\u2019s Quordle words?One word has a double letter.Are any rare letters being used in today\\u2019s Quordle like Q or Z?No.What do today\\u2019s Quordle words start with?S, S, A, and T.What are the answers for today\\u2019s Quordle?Are you sure you want to know?There\\u2019s still time to turn back.OK, you asked for it. The answers are:STOOLSHOCKALIGN\\xa0THUMB", "title": "'Quordle' today: Here are the answers and hints for April 11", "description": "If Quordle is a little too challenging today, you've come to the right place for hints. There aren't just hints here, but the whole Quordle solution. Scroll to the bottom of this page, and there it is. But are you sure you need all four answers? Maybe you just need a strategy guide. Either way, scroll down, and you'll get what you need. What is Quordle?Quordle is a five-letter word guessing game similar to Wordle, except each guess applies letters to four words at the same time. You get nine guesses instead of six to correctly guess all four words. It looks like playing four Wordle games at the same time, and that is essentially what it is. But it's not nearly as intimidating as it sounds.Is Quordle harder than Wordle?Yes, though not diabolically so.Where did Quordle come from?Amid the Wordle boom of late 2021 and early 2022, when everyone was learning to love free, in-browser, once-a-day word guessing games, creator Freddie Meyer says he took inspiration from one of the first big Wordle variations, Dordle \\u2014 the one where you essentially play two Wordles at once. He took things up a notch, and released Quordle on January 30. Meyer's creation was covered in The Guardian six days later, and now, according to Meyer, it attracts millions of daily users. Today, Meyer earns modest revenue from Patreon, where dedicated Quordle fans can donate to keep their favorite puzzle game running.\\xa0How is Quordle pronounced?\\u201cKwordle.\\u201d It should rhyme with \\u201cWordle,\\u201d and definitely should not be pronounced exactly like \"curdle.\\u201dIs Quordle strategy different from Wordle?Yes and no.Your starting strategy should be the same as with Wordle. In fact, if you have a favorite Wordle opening word, there\\u2019s no reason to change that here. We suggest something rich in vowels, featuring common letters like C, R, and N. But you do you.After your first guess, however, you\\u2019ll notice things getting out of control if you play Quordle exactly like Wordle.What should I do in Quordle that I don\\u2019t do in Wordle?Solving a Wordle puzzle can famously come down to a series of single letter-change variations. If you\\u2019ve narrowed it down to \\u201c-IGHT,\\u201d you could guess \\u201cMIGHT\\u201d \\u201cNIGHT\\u201d \\u201cLIGHT\\u201d and \\u201cSIGHT\\u201d and one of those will probably be the solution \\u2014 though this is also a famous way to end up losing in Wordle, particularly if you play on \\u201chard mode.\\u201d In Quordle, however, this sort of single-letter winnowing is a deadly trap, and it hints at the important strategic difference between Wordle and Quordle: In Quordle, you can't afford to waste guesses unless you're eliminating as many letters as possible at all times.\\xa0Guessing a completely random word that you already know isn't the solution, just to eliminate three or four possible letters you haven\\u2019t tried yet, is thought of as a desperate, latch-ditch move in Wordle. In Quordle, however, it's a normal part of the player's strategic toolset.Is there a way to get the answer faster?In my experience Quordle can be a slow game, sometimes dragging out longer than it would take to play Wordle four times. But a sort of blunt-force guessing approach can speed things up. The following strategy also works with Wordle if you only want the solution, and don\\u2019t care about having the fewest possible guesses:Try starting with a series of words that puts all the vowels (including Y) on the board, along with some other common letters. We've had good luck with the three words: \\u201cNOTES,\\u201d \\u201cACRID,\\u201d and \\u201cLUMPY.\\u201d YouTuber DougMansLand suggests four words: \\u201cCANOE,\\u201d \\u201cSKIRT,\\u201d \\u201cPLUMB,\\u201d and \\u201cFUDGY.\\u201dMost of the alphabet is now eliminated, and you\\u2019ll only have the ability to make one or two wrong guesses if you use this strategy. But in most cases you\\u2019ll have all the information you need to guess the remaining words without any wrong guesses.If strategy isn't helping, and you're still stumped, here are some hints:Are there any double or triple letters in today\\u2019s Quordle words?One word has a double letter.Are any rare letters being used in today\\u2019s Quordle like Q or Z?No.What do today\\u2019s Quordle words start with?S, S, A, and T.What are the answers for today\\u2019s Quordle?Are you sure you want to know?There\\u2019s still time to turn back.OK, you asked for it. The answers are:STOOLSHOCKALIGN\\xa0THUMB", "link": "https://mashable.com/article/quordle-today-word-answer-april-11", "pubDate": "Tue, 11 Apr 2023 02:00:38 +0000", "feed_title": "Mashable", "feed_link": "null"}, {"id_field": "201b972c-6b44-42bc-9eb7-b44752be8e93", "embed_text": "Twitter ponders the meaning of love after Taylor Swift and Joe Alwyn's split - Romance is dead. On Saturday (April 8), Entertainment Tonight reported that Taylor Swift and Joe Alwyn broke up after six years together. Their source revealed the couple split \"a few weeks ago\" and that \"it wasn't dramatic,\" explaining \"the relationship had just run\\xa0its course.\\xa0It's why [Alwyn] hasn't been spotted at any shows.\" People independently confirmed the news that sent Swifties and Lover supremacists spiraling on social media. As with any modern heartbreak, memes were made and Swift lyrics were tweeted. \\nSEE ALSO:\\n\\n            Swifties made it to 'The Eras Tour' after all\\n            \\n\\n\\nIf you're unfamiliar with the lore of Toe (portmanteau and couple name of Swift and Alywn), you probably don't understand the distress caused by the news. For most, Alwyn is not even a household name, but for Swifties, he's the titular Lover.The Midnights singer and British actor started dating in 2016. Fans speculate they met at the 2016 Met Gala based on the lyrics of Reputation cut \"Dress\": \"Flashback to when you met me / Your buzzcut and my hair bleached.\" Because, you guessed it, Alwyn sported a buzzcut and Swift's hair was bleached. At a secret session for Reputation, Swift reportedly told fans that the single \"Gorgeous\" was about her \"angel boyfriend of one year.\" Other tracks off of Reputation like \"Delicate,\" \"Call It What You Want,\" and \"King Of My Heart\" are also thought to be about Alwyn. Her next album, Lover, is also understood to be about Alwyn with songs like \"London Boy\" \\u2014 Alwyn is famously British and a Pisces\\u2014 \"Paper Rings,\" \"Cornelia Street,\" \"Daylight,\" and the titular \"Lover.\" During quarantine the couple started collaborating creatively. Alwyn surpassed his muse status and co-wrote Folklore tracks \"Exile\" and \"Betty,\" Evermore songs \"Champagne Problems\" and \"Coney Island, and most recently, \"Sweet Nothing\" off Midnights. Other tracks on her most recent three albums canonically about Alwyn include: \"Invisible String\" and \"Peace.\" Phew, that's a lot of Toe mythology. And boy, oh boy are they. Out-of-context lyrics are running amuck on Twitter on TikTok. (\"Cornelia Street,\" \"King Of My Heart,\" and \"Peace\" are hitting Swifties particularly hard.) As one Twitter user wrote, \"taylor swift breaking up with the person she wrote peace about has the potential to be absolutely catastrophic for the girls.\" \\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\nNeedless to say it's a tumultuous time to be a Swiftie, many using ironic political memes to convey the gravity of the situation. One shows former President Obama in the Situation Room. \\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\nSame fans are focused on the implications of this break up on the Multiverse of Sadness, the fan-made mind map connecting the leading men of Sally Rooney adaptations, female musicians, and other essential Girl Media. One tweet reads, \"the sally rooney verse is crumbling before our very eyes.\"\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\nOther fans have translated their online grief into real-life action by making the pilgrimage to Swift's old apartment on Cornelia Street in New York City to leave flowers and take photos. \\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\nOnly time will tell what era is in store for Swift next. ", "title": "Twitter ponders the meaning of love after Taylor Swift and Joe Alwyn's split", "description": "Romance is dead. On Saturday (April 8), Entertainment Tonight reported that Taylor Swift and Joe Alwyn broke up after six years together. Their source revealed the couple split \"a few weeks ago\" and that \"it wasn't dramatic,\" explaining \"the relationship had just run\\xa0its course.\\xa0It's why [Alwyn] hasn't been spotted at any shows.\" People independently confirmed the news that sent Swifties and Lover supremacists spiraling on social media. As with any modern heartbreak, memes were made and Swift lyrics were tweeted. \\nSEE ALSO:\\n\\n            Swifties made it to 'The Eras Tour' after all\\n            \\n\\n\\nIf you're unfamiliar with the lore of Toe (portmanteau and couple name of Swift and Alywn), you probably don't understand the distress caused by the news. For most, Alwyn is not even a household name, but for Swifties, he's the titular Lover.The Midnights singer and British actor started dating in 2016. Fans speculate they met at the 2016 Met Gala based on the lyrics of Reputation cut \"Dress\": \"Flashback to when you met me / Your buzzcut and my hair bleached.\" Because, you guessed it, Alwyn sported a buzzcut and Swift's hair was bleached. At a secret session for Reputation, Swift reportedly told fans that the single \"Gorgeous\" was about her \"angel boyfriend of one year.\" Other tracks off of Reputation like \"Delicate,\" \"Call It What You Want,\" and \"King Of My Heart\" are also thought to be about Alwyn. Her next album, Lover, is also understood to be about Alwyn with songs like \"London Boy\" \\u2014 Alwyn is famously British and a Pisces\\u2014 \"Paper Rings,\" \"Cornelia Street,\" \"Daylight,\" and the titular \"Lover.\" During quarantine the couple started collaborating creatively. Alwyn surpassed his muse status and co-wrote Folklore tracks \"Exile\" and \"Betty,\" Evermore songs \"Champagne Problems\" and \"Coney Island, and most recently, \"Sweet Nothing\" off Midnights. Other tracks on her most recent three albums canonically about Alwyn include: \"Invisible String\" and \"Peace.\" Phew, that's a lot of Toe mythology. And boy, oh boy are they. Out-of-context lyrics are running amuck on Twitter on TikTok. (\"Cornelia Street,\" \"King Of My Heart,\" and \"Peace\" are hitting Swifties particularly hard.) As one Twitter user wrote, \"taylor swift breaking up with the person she wrote peace about has the potential to be absolutely catastrophic for the girls.\" \\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\nNeedless to say it's a tumultuous time to be a Swiftie, many using ironic political memes to convey the gravity of the situation. One shows former President Obama in the Situation Room. \\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\nSame fans are focused on the implications of this break up on the Multiverse of Sadness, the fan-made mind map connecting the leading men of Sally Rooney adaptations, female musicians, and other essential Girl Media. One tweet reads, \"the sally rooney verse is crumbling before our very eyes.\"\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\nOther fans have translated their online grief into real-life action by making the pilgrimage to Swift's old apartment on Cornelia Street in New York City to leave flowers and take photos. \\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\nOnly time will tell what era is in store for Swift next. ", "link": "https://mashable.com/article/taylor-swift-joe-alwyn-break-up", "pubDate": "Mon, 10 Apr 2023 17:45:10 +0000", "feed_title": "Mashable", "feed_link": "null"}, {"id_field": "3208c272-38a7-4940-adb8-4fa2001d0fc4", "embed_text": "YouTube TV reveals NFL Sunday Ticket pricing - The NFL season just ended two months ago. My beloved Kansas City Chiefs are champions once again. And it's time for all of us cord-cutters to figure out how the heck we're going to watch football in 2023.Fortunately, the answer is easy, if a bit pricey. Starting in the 2023 season, YouTube TV will be the exclusive home of NFL Sunday Ticket, a streaming subscription that allows you to watch every out-of-market NFL game live on Sundays. With YouTube TV and Sunday Ticket, you can see every NFL game you could possibly want to see.And you might want to pony up the cash now instead of waiting for September. Here's why.\\nSEE ALSO:\\n\\n            Why I finally switched from Sling to YouTube TV\\n            \\n\\n\\nNFL Sunday Ticket on YouTube TV: How it works, price, and early-bird specialIf you're not familiar with NFL Sunday Ticket, the main thing you need to know is that it used to belong to DirecTV and now it belongs to YouTube TV. In practical terms, that means you can now access it without a satellite subscription and, thus, without dealing with all the ridiculous hidden fees that come with a satellite subscription.But you're still going to have to pay, and pay quite a bit to get Sunday Ticket. The regular price for Sunday Ticket if you subscribe to YouTube TV will be $349, on top of the $73/mo you already pay for the base service. That doesn't get you Sunday Ticket forever; you just get it for one season. There's also a $389 option that bundles Sunday Ticket and RedZone, a special channel that whips through all the NFL action on a Sunday, going from game to game when the action starts getting exciting.\\n\\n\\n\\n\\nHere's where you add Sunday Ticket and RedZone to your YouTube TV plan.\\nCredit: Screenshot: Google\\n\\n\\nSidenote: RedZone is 100 percent worth it if you really care about football. It's seven straight hours of commercial-free football and you only see the fun parts. It's intoxicating. You can add either of those options to your YouTube TV plan by going to your Google account and clicking on \"Payments and Subscriptions.\" That's not all, though. Google is also offering Sunday Ticket and RedZone through its PrimeTime Channels service. Put simply, this is a way to get all of the NFL action without paying for YouTube TV on top of it. Unfortunately, there's a big price hike if you decide to go down this road. Via Primetime Channels, NFL Sunday Ticket will cost $449, and the RedZone bundle costs $489.And that's still not all. If you subscribe to any of those options before June 6, you'll get a $100 discount. Suddenly, for YouTube TV subscribers, Sunday Ticket plus RedZone for $289 doesn't seem like such a bad deal. It definitely beats the price of going to a bar every week, and it's less risky than watching football through, erm, other, less reliable means.Whether you choose to patronize Google or keep watching football your own way, at least now you know there's a way to get everything for less than a month's rent.", "title": "YouTube TV reveals NFL Sunday Ticket pricing", "description": "The NFL season just ended two months ago. My beloved Kansas City Chiefs are champions once again. And it's time for all of us cord-cutters to figure out how the heck we're going to watch football in 2023.Fortunately, the answer is easy, if a bit pricey. Starting in the 2023 season, YouTube TV will be the exclusive home of NFL Sunday Ticket, a streaming subscription that allows you to watch every out-of-market NFL game live on Sundays. With YouTube TV and Sunday Ticket, you can see every NFL game you could possibly want to see.And you might want to pony up the cash now instead of waiting for September. Here's why.\\nSEE ALSO:\\n\\n            Why I finally switched from Sling to YouTube TV\\n            \\n\\n\\nNFL Sunday Ticket on YouTube TV: How it works, price, and early-bird specialIf you're not familiar with NFL Sunday Ticket, the main thing you need to know is that it used to belong to DirecTV and now it belongs to YouTube TV. In practical terms, that means you can now access it without a satellite subscription and, thus, without dealing with all the ridiculous hidden fees that come with a satellite subscription.But you're still going to have to pay, and pay quite a bit to get Sunday Ticket. The regular price for Sunday Ticket if you subscribe to YouTube TV will be $349, on top of the $73/mo you already pay for the base service. That doesn't get you Sunday Ticket forever; you just get it for one season. There's also a $389 option that bundles Sunday Ticket and RedZone, a special channel that whips through all the NFL action on a Sunday, going from game to game when the action starts getting exciting.\\n\\n\\n\\n\\nHere's where you add Sunday Ticket and RedZone to your YouTube TV plan.\\nCredit: Screenshot: Google\\n\\n\\nSidenote: RedZone is 100 percent worth it if you really care about football. It's seven straight hours of commercial-free football and you only see the fun parts. It's intoxicating. You can add either of those options to your YouTube TV plan by going to your Google account and clicking on \"Payments and Subscriptions.\" That's not all, though. Google is also offering Sunday Ticket and RedZone through its PrimeTime Channels service. Put simply, this is a way to get all of the NFL action without paying for YouTube TV on top of it. Unfortunately, there's a big price hike if you decide to go down this road. Via Primetime Channels, NFL Sunday Ticket will cost $449, and the RedZone bundle costs $489.And that's still not all. If you subscribe to any of those options before June 6, you'll get a $100 discount. Suddenly, for YouTube TV subscribers, Sunday Ticket plus RedZone for $289 doesn't seem like such a bad deal. It definitely beats the price of going to a bar every week, and it's less risky than watching football through, erm, other, less reliable means.Whether you choose to patronize Google or keep watching football your own way, at least now you know there's a way to get everything for less than a month's rent.", "link": "https://mashable.com/article/youtube-tv-nfl-sunday-ticket-price", "pubDate": "Tue, 11 Apr 2023 19:59:41 +0000", "feed_title": "Mashable", "feed_link": "null"}, {"id_field": "325835e4-3425-4503-b44f-7f7585fcb74a", "embed_text": "A speeding black hole is birthing baby stars across light years - Astronomers think they have discovered a supermassive black hole traveling away from its home galaxy at 4 million mph  \\u2014 so fast it's not doing what it's notorious for: sucking light out of the universe. Quite the opposite, possibly. Rather than ripping stars to shreds and swallowing up every morsel, this black hole is believed to be fostering new star formation, leaving a trail of newborn stars stretching 200,000 light-years through space. Pieter van Dokkum, an astronomy professor at Yale University, said as the black hole rams into gas, it seems to trigger a narrow corridor of new stars, where the gas has a chance to cool. How exactly it works, though, isn't known, said van Dokkum, who led research on the phenomenon captured by NASA's Hubble Space Telescope accidentally. A paper on the findings was published last week in The Astrophysical Journal Letters.\\u201cWhat we\\u2019re seeing is the aftermath,\" he said in a statement. \"Like the wake behind a ship, we\\u2019re seeing the wake behind the black hole.\\u201d\\nSEE ALSO:\\n\\n            Black holes, ranked\\n            \\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\nBlack holes are some of the most elusive things in outer space. The most common kind, a stellar black hole, is often thought to be the result of an enormous star dying in a supernova explosion. The star's material then collapses onto itself, condensing into a relatively tiny area.But how supermassive black holes, millions to billions of times more massive than the sun, form is even more mysterious. Many astrophysicists and cosmologists believe these behemoths lurk at the center of virtually all galaxies. Recent Hubble Space Telescope observations have bolstered the theory that supermassive black holes get their start in the dusty cores of starburst galaxies, where new stars are rapidly churned out, but scientists are still trying to get to the bottom of it.Want more science and tech news delivered straight to your inbox? Sign up for Mashable's Top Stories newsletter today.\\n    \"Like the wake behind a ship, we\\u2019re seeing the wake behind the black hole.\\u201d\\n    \\nBlack holes don't have surfaces, like on a planet or star. Instead, they have a boundary called an \"event horizon\"\\u2014it's a point of no return. Generally, if anything swoops too close, it will fall in, never to escape the hole's gravitational pull. But this weird black hole may be moving too fast to consume celestial objects as usual, defying the status quo. \\n\\n\\n\\n\\nSagittarius A* is the supermassive black hole found in the center of the Milky Way galaxy. \\nCredit: Event Horizon Telescope\\n\\n\\nThe research team has suggested a possible theory: Maybe the runaway black hole is the result of a chain of events caused by three colliding supermassive black holes. One could have been stealing momentum from the other two and gotten ejected out of its host galaxy, while the other two shot off in the other direction. Evidence that might support this idea is that there is no sign of an active black hole remaining at the galaxy's core. Van Dokkum was looking for star clusters in a nearby galaxy when he noticed what appeared to be a little streak in his Hubble image. At first, he thought it was a cosmic ray causing an artifact in the photo. After further analysis at the Keck Observatory in Hawaii, he and his team predicted it must be a train of young blue stars. The trail is almost half as bright as the host galaxy, indicating it is a hotbed of stellar action. The scientists plan to confirm the black hole explanation with follow-up observations using the James Webb Space Telescope and the Chandra X-ray Observatory.", "title": "A speeding black hole is birthing baby stars across light years", "description": "Astronomers think they have discovered a supermassive black hole traveling away from its home galaxy at 4 million mph  \\u2014 so fast it's not doing what it's notorious for: sucking light out of the universe. Quite the opposite, possibly. Rather than ripping stars to shreds and swallowing up every morsel, this black hole is believed to be fostering new star formation, leaving a trail of newborn stars stretching 200,000 light-years through space. Pieter van Dokkum, an astronomy professor at Yale University, said as the black hole rams into gas, it seems to trigger a narrow corridor of new stars, where the gas has a chance to cool. How exactly it works, though, isn't known, said van Dokkum, who led research on the phenomenon captured by NASA's Hubble Space Telescope accidentally. A paper on the findings was published last week in The Astrophysical Journal Letters.\\u201cWhat we\\u2019re seeing is the aftermath,\" he said in a statement. \"Like the wake behind a ship, we\\u2019re seeing the wake behind the black hole.\\u201d\\nSEE ALSO:\\n\\n            Black holes, ranked\\n            \\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\nBlack holes are some of the most elusive things in outer space. The most common kind, a stellar black hole, is often thought to be the result of an enormous star dying in a supernova explosion. The star's material then collapses onto itself, condensing into a relatively tiny area.But how supermassive black holes, millions to billions of times more massive than the sun, form is even more mysterious. Many astrophysicists and cosmologists believe these behemoths lurk at the center of virtually all galaxies. Recent Hubble Space Telescope observations have bolstered the theory that supermassive black holes get their start in the dusty cores of starburst galaxies, where new stars are rapidly churned out, but scientists are still trying to get to the bottom of it.Want more science and tech news delivered straight to your inbox? Sign up for Mashable's Top Stories newsletter today.\\n    \"Like the wake behind a ship, we\\u2019re seeing the wake behind the black hole.\\u201d\\n    \\nBlack holes don't have surfaces, like on a planet or star. Instead, they have a boundary called an \"event horizon\"\\u2014it's a point of no return. Generally, if anything swoops too close, it will fall in, never to escape the hole's gravitational pull. But this weird black hole may be moving too fast to consume celestial objects as usual, defying the status quo. \\n\\n\\n\\n\\nSagittarius A* is the supermassive black hole found in the center of the Milky Way galaxy. \\nCredit: Event Horizon Telescope\\n\\n\\nThe research team has suggested a possible theory: Maybe the runaway black hole is the result of a chain of events caused by three colliding supermassive black holes. One could have been stealing momentum from the other two and gotten ejected out of its host galaxy, while the other two shot off in the other direction. Evidence that might support this idea is that there is no sign of an active black hole remaining at the galaxy's core. Van Dokkum was looking for star clusters in a nearby galaxy when he noticed what appeared to be a little streak in his Hubble image. At first, he thought it was a cosmic ray causing an artifact in the photo. After further analysis at the Keck Observatory in Hawaii, he and his team predicted it must be a train of young blue stars. The trail is almost half as bright as the host galaxy, indicating it is a hotbed of stellar action. The scientists plan to confirm the black hole explanation with follow-up observations using the James Webb Space Telescope and the Chandra X-ray Observatory.", "link": "https://mashable.com/article/runaway-black-hole-hubble-discovery", "pubDate": "Sun, 09 Apr 2023 20:02:24 +0000", "feed_title": "Mashable", "feed_link": "null"}, {"id_field": "64b25125-e9ad-4c48-a778-d12892769890", "embed_text": "If Owen Wilson isn't Bob Ross in 'Paint', who is he? - Owen Wilson, Mikaela Watkins and Brit McAdams discuss how much the iconic Bob Ross inspired the lead character of Paint. Paint premieres in theaters April 7th.", "title": "If Owen Wilson isn't Bob Ross in 'Paint', who is he?", "description": "Owen Wilson, Mikaela Watkins and Brit McAdams discuss how much the iconic Bob Ross inspired the lead character of Paint. Paint premieres in theaters April 7th.", "link": "https://mashable.com/video/paint-owen-wilson-bob-ross", "pubDate": "Mon, 10 Apr 2023 14:20:07 +0000", "feed_title": "Mashable", "feed_link": "null"}, {"id_field": "7ec0de51-d9dc-479b-93f6-c87efd534fc5", "embed_text": "How to connect your AirPods to a computer - So, you can't quite figure out how to connect your AirPods to your computer. Stuff happens! It's OK, because the problem is easy enough to solve. We've got a quick rundown for you, but there's also a helpful page from Apple itself that can point you in the right direction for any model computer. Now, first things first. The process of pairing your AirPods via Bluetooth might look different depending on what type of computer you use. Let's go with a Mac first. How to connect AirPods to a MacFirst you want to make sure that your Mac's operating system is up to date. To do that, click on the Apple icon in the upper left hand corner of your desktop screen and click on \"About this Mac.\" A screen will pop up, and there you can click on \"Software Update.\" According to Apple, regular, 2nd generation AirPods require macOS Mojave 10.14.4 or later, and AirPods Pro require Catalina 10.15.1 or later.Now that you've made sure your mac is up to date with the latest software, follow these simple steps to connect your AirPods. 1. Open System Preferences If you can't find it, it's the icon on your desktop that looks like a gear. You can also search for System Preferences using Spotlight (the magnifying glass in the upper right hand corner of your desktop.)2. Select Bluetooth I happen to use a Mac, so here's what I'm talking about. This is the icon you're looking for.\\n\\n\\n\\n\\nThe Bluetooth icon is easy to find in system preferences.\\nCredit: Screenshot: apple / system preferences\\n\\n\\n3. Place both AirPods in the case and open the lidSimple enough. 4. Hold the button on the AirPod caseYou should see the light start to blink white. Once it does, you can let go of the button.5. Wait for your AirPods to show up on your devices, then click ConnectPresto. That should be it. Note: If you do not see your AirPods, double-check that Bluetooth is turned on, then restart the process.\\n\\n\\n\\n\\nConnecting AirPods to your Mac is easy.\\nCredit: SCREENSHOT: APPLE\\n\\n\\nNow, what if you don't use a Mac? Well, the process should be pretty much exactly the same. Pretty much. How to connect AirPods to a PC or Windows laptopThe only thing that's really going to change is how you navigate to the Bluetooth page. Here's a few different ways you might get there: On a PC, open Settings from your Start menu. Select devices, navigate to Bluetooth and other devices, then hit the plus sign where it says \"Add Bluetooth or other device.\" Open the AirPods' case lid, hold the button, and select your AirPods once they pop up on the screen. The headphones should connect, then you'll click \"Done.\" Not all PCs come equipped with Bluetooth, especially desktops. However if you have a laptop, it's quite likely that your PC does have Bluetooth capabilities. There you have it, folks. Enjoy your brave new world in which your AirPods pair seamlessly with your computer. ", "title": "How to connect your AirPods to a computer", "description": "So, you can't quite figure out how to connect your AirPods to your computer. Stuff happens! It's OK, because the problem is easy enough to solve. We've got a quick rundown for you, but there's also a helpful page from Apple itself that can point you in the right direction for any model computer. Now, first things first. The process of pairing your AirPods via Bluetooth might look different depending on what type of computer you use. Let's go with a Mac first. How to connect AirPods to a MacFirst you want to make sure that your Mac's operating system is up to date. To do that, click on the Apple icon in the upper left hand corner of your desktop screen and click on \"About this Mac.\" A screen will pop up, and there you can click on \"Software Update.\" According to Apple, regular, 2nd generation AirPods require macOS Mojave 10.14.4 or later, and AirPods Pro require Catalina 10.15.1 or later.Now that you've made sure your mac is up to date with the latest software, follow these simple steps to connect your AirPods. 1. Open System Preferences If you can't find it, it's the icon on your desktop that looks like a gear. You can also search for System Preferences using Spotlight (the magnifying glass in the upper right hand corner of your desktop.)2. Select Bluetooth I happen to use a Mac, so here's what I'm talking about. This is the icon you're looking for.\\n\\n\\n\\n\\nThe Bluetooth icon is easy to find in system preferences.\\nCredit: Screenshot: apple / system preferences\\n\\n\\n3. Place both AirPods in the case and open the lidSimple enough. 4. Hold the button on the AirPod caseYou should see the light start to blink white. Once it does, you can let go of the button.5. Wait for your AirPods to show up on your devices, then click ConnectPresto. That should be it. Note: If you do not see your AirPods, double-check that Bluetooth is turned on, then restart the process.\\n\\n\\n\\n\\nConnecting AirPods to your Mac is easy.\\nCredit: SCREENSHOT: APPLE\\n\\n\\nNow, what if you don't use a Mac? Well, the process should be pretty much exactly the same. Pretty much. How to connect AirPods to a PC or Windows laptopThe only thing that's really going to change is how you navigate to the Bluetooth page. Here's a few different ways you might get there: On a PC, open Settings from your Start menu. Select devices, navigate to Bluetooth and other devices, then hit the plus sign where it says \"Add Bluetooth or other device.\" Open the AirPods' case lid, hold the button, and select your AirPods once they pop up on the screen. The headphones should connect, then you'll click \"Done.\" Not all PCs come equipped with Bluetooth, especially desktops. However if you have a laptop, it's quite likely that your PC does have Bluetooth capabilities. There you have it, folks. Enjoy your brave new world in which your AirPods pair seamlessly with your computer. ", "link": "https://mashable.com/article/how-to-connect-airpods-computer", "pubDate": "Tue, 11 Apr 2023 04:27:45 +0000", "feed_title": "Mashable", "feed_link": "null"}, {"id_field": "9a1ea51e-e94d-4b9d-a983-f696e8971a8a", "embed_text": "Le Creuset is having a huge spring sale right now - As of April 11, Le Creuset is having a massive spring sale on several cookware items. See the best deals:BEST SKILLET DEAL: The Le Creuset Traditional Skillet is super versatile and can be used for everything from searing to sauteeing. $99 $175 (save $76)BEST CHEF'S OVEN DEAL: The Le Creuset Signature Chef's Oven is generously sized, perfect for large families or gatherings. $300 $462 (save $162)BEST COOKWARE SET DEAL: The Le Creuset Signature Enameled Cast Iron 5-Piece Cookware Set includes the brand's signature bestselling Dutch Oven and Traditional Skillet. $575 $820 (save $245)This Mother's Day, surprise your mom with some new cookware\\u2014and honestly, you can't get better than Le Creuset. This cookware is well known for its durability and style, and has beautiful enamel cast-iron in various fun colors for mom to choose from. With Le Creuset's spring sale going on right now, it's never been a better time to shop. See the best deals here:Best skillet deal\\n\\n\\n\\n\\n\\n                        Opens in a new tab\\n                    \\n\\n\\n\\nCredit: Le Creuset\\n\\n\\n\\n\\n            Le Creuset Traditional Skillet\\n            (opens in a new tab)\\n\\n$99 at Le Creuset (save $76)\\n\\nGet Deal\\n(opens in a new tab)\\n\\n\\n\\nWhy we like itLe Creuset's traditional skillet is pre-seasoned for easy stirring, sauteeing, and frying. It's also specifically formulated to withstand higher temperatures for quick cooking, but that doesn't mean it will make a mess: The skillet is dishwasher-safe, non-stick, and easy to clean.Best chef's oven deal\\n\\n\\n\\n\\n\\n                        Opens in a new tab\\n                    \\n\\n\\n\\nCredit: Le Creuset\\n\\n\\n\\n\\n            Le Creuset Signature Chef's Oven\\n            (opens in a new tab)\\n\\n$300 at Le Creuset (save $162)\\n\\nGet Deal\\n(opens in a new tab)\\n\\n\\n\\nWhy we like itWith Le Creuset\\u2019s Signature Chef's Oven, you can slow cook, roast, or bake just about anything. It has sloped sides, which helps increase its effectiveness during stirring, and thanks to its extra depth, you can easily avoid boilovers and potentially disastrous splatters. It\\u2019s also dishwasher safe, making cleanup a breeze. Best cookware set deal\\n\\n\\n\\n\\n\\n                        Opens in a new tab\\n                    \\n\\n\\n\\nCredit: Le Creuset\\n\\n\\n\\n\\n            Le Creuset Signature Enameled Cast Iron 5-Piece Cookware Set\\n            (opens in a new tab)\\n\\n$575 at Le Creuset (save $245)\\n\\nGet Deal\\n(opens in a new tab)\\n\\n\\n\\nWhy we like itLe Creuset\\u2019s 5-piece Signature Cookware Set includes one Dutch oven, one signature skillet, and one saucepan. Each piece is ready to use (no pre-seasoning required), compatible with all cooktops, and oven-safe up to 500 degrees Fahrenheit. This set is also available in 11 color options, including Cerise, Chambray, and Azure.", "title": "Le Creuset is having a huge spring sale right now", "description": "As of April 11, Le Creuset is having a massive spring sale on several cookware items. See the best deals:BEST SKILLET DEAL: The Le Creuset Traditional Skillet is super versatile and can be used for everything from searing to sauteeing. $99 $175 (save $76)BEST CHEF'S OVEN DEAL: The Le Creuset Signature Chef's Oven is generously sized, perfect for large families or gatherings. $300 $462 (save $162)BEST COOKWARE SET DEAL: The Le Creuset Signature Enameled Cast Iron 5-Piece Cookware Set includes the brand's signature bestselling Dutch Oven and Traditional Skillet. $575 $820 (save $245)This Mother's Day, surprise your mom with some new cookware\\u2014and honestly, you can't get better than Le Creuset. This cookware is well known for its durability and style, and has beautiful enamel cast-iron in various fun colors for mom to choose from. With Le Creuset's spring sale going on right now, it's never been a better time to shop. See the best deals here:Best skillet deal\\n\\n\\n\\n\\n\\n                        Opens in a new tab\\n                    \\n\\n\\n\\nCredit: Le Creuset\\n\\n\\n\\n\\n            Le Creuset Traditional Skillet\\n            (opens in a new tab)\\n\\n$99 at Le Creuset (save $76)\\n\\nGet Deal\\n(opens in a new tab)\\n\\n\\n\\nWhy we like itLe Creuset's traditional skillet is pre-seasoned for easy stirring, sauteeing, and frying. It's also specifically formulated to withstand higher temperatures for quick cooking, but that doesn't mean it will make a mess: The skillet is dishwasher-safe, non-stick, and easy to clean.Best chef's oven deal\\n\\n\\n\\n\\n\\n                        Opens in a new tab\\n                    \\n\\n\\n\\nCredit: Le Creuset\\n\\n\\n\\n\\n            Le Creuset Signature Chef's Oven\\n            (opens in a new tab)\\n\\n$300 at Le Creuset (save $162)\\n\\nGet Deal\\n(opens in a new tab)\\n\\n\\n\\nWhy we like itWith Le Creuset\\u2019s Signature Chef's Oven, you can slow cook, roast, or bake just about anything. It has sloped sides, which helps increase its effectiveness during stirring, and thanks to its extra depth, you can easily avoid boilovers and potentially disastrous splatters. It\\u2019s also dishwasher safe, making cleanup a breeze. Best cookware set deal\\n\\n\\n\\n\\n\\n                        Opens in a new tab\\n                    \\n\\n\\n\\nCredit: Le Creuset\\n\\n\\n\\n\\n            Le Creuset Signature Enameled Cast Iron 5-Piece Cookware Set\\n            (opens in a new tab)\\n\\n$575 at Le Creuset (save $245)\\n\\nGet Deal\\n(opens in a new tab)\\n\\n\\n\\nWhy we like itLe Creuset\\u2019s 5-piece Signature Cookware Set includes one Dutch oven, one signature skillet, and one saucepan. Each piece is ready to use (no pre-seasoning required), compatible with all cooktops, and oven-safe up to 500 degrees Fahrenheit. This set is also available in 11 color options, including Cerise, Chambray, and Azure.", "link": "https://mashable.com/deals/april-11-le-creuset-spring-sale", "pubDate": "Tue, 11 Apr 2023 16:43:46 +0000", "feed_title": "Mashable", "feed_link": "null"}, {"id_field": "a00419da-867f-4060-9028-eee074745c59", "embed_text": "Get 25% off two EV rides with Uber's Earth Month promo - SAVE 25% ON TWO EV UBER RIDES: Now through April 30, Uber is offering 25% off two Comfort Electric rides with promo code GOELECTRIC.\\n\\n\\n\\n\\n\\n                        Opens in a new tab\\n                    \\n\\n\\n\\nCredit: Uber\\n\\n\\n\\n\\n            Discounted Uber Comfort Electric rides\\n            (opens in a new tab)\\n\\nSave 25% on two rides with code GOELECTRIC\\n\\nGet Deal\\n(opens in a new tab)\\n\\n\\n\\nApril marks the unofficial start to \"sitting outside for happy hour\" season, which often translates to \"treating yourself to an Uber\" season.Uber is incentivizing riders to take the eco-friendly route on their April trips with an Earth Month discount on its Comfort Electric tier. Enter the code GOELECTRIC in the Wallet tab of the Uber app by clicking \"add promo code\" and enjoy an automatic 25% off two rides in a premium electric vehicle like a Tesla, Polestar, or Ford Mustang Mach-E. Make sure to select the \"Comfort Electric\" option when choosing your ride.The discount slashes up to $10 off each ride and should bring your total cost near or below the cost of the traditional UberX that most of us typically take \\u2014 so there's no reason to not go electric here. You'll officially be a contributor to Uber's end goal of becoming a zero-emissions mobility platform in North America (and Europe) by 2030.\\nSEE ALSO:\\n\\n            The Uber app got a redesign. See what's new.\\n            \\n\\n\\nComfort Electric isn't available everywhere, but Uber's introduction of 14 new markets for Earth Month brings the total number of participating cities to more than 40. Participating cities in the U.S. are as follows: Atlanta, Austin, Baltimore, Boston, Charlotte, Chicago, Connecticut, Dallas, Denver, Detroit, Houston, Indianapolis, Jacksonville, Las Vegas, Los Angeles, Miami, Minneapolis-St. Paul, Nashville, New Jersey, New Orleans, Orange County, Orlando, Palm Springs, Philadelphia, Phoenix, Pittsburgh, Portland, Sacramento, Salt Lake City, San Antonio, San Diego, San Francisco, Seattle, St Louis, Tampa Bay, Washington D.C., and the NYC suburbs.", "title": "Get 25% off two EV rides with Uber's Earth Month promo", "description": "SAVE 25% ON TWO EV UBER RIDES: Now through April 30, Uber is offering 25% off two Comfort Electric rides with promo code GOELECTRIC.\\n\\n\\n\\n\\n\\n                        Opens in a new tab\\n                    \\n\\n\\n\\nCredit: Uber\\n\\n\\n\\n\\n            Discounted Uber Comfort Electric rides\\n            (opens in a new tab)\\n\\nSave 25% on two rides with code GOELECTRIC\\n\\nGet Deal\\n(opens in a new tab)\\n\\n\\n\\nApril marks the unofficial start to \"sitting outside for happy hour\" season, which often translates to \"treating yourself to an Uber\" season.Uber is incentivizing riders to take the eco-friendly route on their April trips with an Earth Month discount on its Comfort Electric tier. Enter the code GOELECTRIC in the Wallet tab of the Uber app by clicking \"add promo code\" and enjoy an automatic 25% off two rides in a premium electric vehicle like a Tesla, Polestar, or Ford Mustang Mach-E. Make sure to select the \"Comfort Electric\" option when choosing your ride.The discount slashes up to $10 off each ride and should bring your total cost near or below the cost of the traditional UberX that most of us typically take \\u2014 so there's no reason to not go electric here. You'll officially be a contributor to Uber's end goal of becoming a zero-emissions mobility platform in North America (and Europe) by 2030.\\nSEE ALSO:\\n\\n            The Uber app got a redesign. See what's new.\\n            \\n\\n\\nComfort Electric isn't available everywhere, but Uber's introduction of 14 new markets for Earth Month brings the total number of participating cities to more than 40. Participating cities in the U.S. are as follows: Atlanta, Austin, Baltimore, Boston, Charlotte, Chicago, Connecticut, Dallas, Denver, Detroit, Houston, Indianapolis, Jacksonville, Las Vegas, Los Angeles, Miami, Minneapolis-St. Paul, Nashville, New Jersey, New Orleans, Orange County, Orlando, Palm Springs, Philadelphia, Phoenix, Pittsburgh, Portland, Sacramento, Salt Lake City, San Antonio, San Diego, San Francisco, Seattle, St Louis, Tampa Bay, Washington D.C., and the NYC suburbs.", "link": "https://mashable.com/deals/april-11-uber-earth-month-promo-code", "pubDate": "Tue, 11 Apr 2023 15:51:07 +0000", "feed_title": "Mashable", "feed_link": "null"}, {"id_field": "d9bc23f2-7f5f-450c-9fe5-2d04d5aa2617", "embed_text": "Save 93% on this cybersecurity training and exam prep bundle - TL;DR: A lifetime access to a InfoSec4TC Platinum Membership is on sale for \\xa355.97, saving you 93% on list price.The cybersecurity industry is growing all the time, and current predictions estimate it will be worth $376.32 billion by 2029. All that growth points towards a steady supply of promising career opportunities, but those positions require a lot of training. If you want to get started on your own time, then try an InfoSec4TC Platinum Membership and get unlimited access to nearly 2,000 hours of expert training materials and a community of like-minded learners, all for \\xa355.97.\\xa0Cybersecurity isn\\u2019t just one skill that you can master. It encompasses many topics to learn, but this bundle has resources for all experience levels. Many of the courses do rely on some experience in IT and cybersecurity, but the bundle also provides the course materials to get to that level. Learn about ethical hacking in The Complete Ethical Hacker Course and Hacking using Python From A to Z, or check out any of the other intro courses.This bundle even gives you access to certification practice exams, and they update often so you won\\u2019t be studying old, outdated material. It\\u2019s like a study guide that could land you an exciting new job. Prove to potential employers that you\\u2019re a self-motivated expert in your field by studying courses in GSEC, CISSP, CISM, CISA, and other internationally recognised IT certifications. Passing your exams might just land you that first industry job, and you can get support the whole way through by checking out everything your InfoSec4TC student portal has to offer.\\xa0Expensive university courses aren\\u2019t the only way you can start your cybersecurity training. Join over 1,000 other students and get lifetime access to 1,840 hours of cybersecurity instruction. Get an InfoSec4TC Platinum Membership on sale for \\xa355.97.\\xa0\\n\\n\\n\\n\\n\\n                        Opens in a new tab\\n                    \\n\\n\\n\\nCredit: InfoSec4TC\\n\\n\\n\\n\\n            InfoSec4TC Platinum Membership (Lifetime Access)\\n            (opens in a new tab)\\n\\n\\xa355.97 at the Mashable Shop\\n\\nGet Deal\\n(opens in a new tab)\\n\\n\\n", "title": "Save 93% on this cybersecurity training and exam prep bundle", "description": "TL;DR: A lifetime access to a InfoSec4TC Platinum Membership is on sale for \\xa355.97, saving you 93% on list price.The cybersecurity industry is growing all the time, and current predictions estimate it will be worth $376.32 billion by 2029. All that growth points towards a steady supply of promising career opportunities, but those positions require a lot of training. If you want to get started on your own time, then try an InfoSec4TC Platinum Membership and get unlimited access to nearly 2,000 hours of expert training materials and a community of like-minded learners, all for \\xa355.97.\\xa0Cybersecurity isn\\u2019t just one skill that you can master. It encompasses many topics to learn, but this bundle has resources for all experience levels. Many of the courses do rely on some experience in IT and cybersecurity, but the bundle also provides the course materials to get to that level. Learn about ethical hacking in The Complete Ethical Hacker Course and Hacking using Python From A to Z, or check out any of the other intro courses.This bundle even gives you access to certification practice exams, and they update often so you won\\u2019t be studying old, outdated material. It\\u2019s like a study guide that could land you an exciting new job. Prove to potential employers that you\\u2019re a self-motivated expert in your field by studying courses in GSEC, CISSP, CISM, CISA, and other internationally recognised IT certifications. Passing your exams might just land you that first industry job, and you can get support the whole way through by checking out everything your InfoSec4TC student portal has to offer.\\xa0Expensive university courses aren\\u2019t the only way you can start your cybersecurity training. Join over 1,000 other students and get lifetime access to 1,840 hours of cybersecurity instruction. Get an InfoSec4TC Platinum Membership on sale for \\xa355.97.\\xa0\\n\\n\\n\\n\\n\\n                        Opens in a new tab\\n                    \\n\\n\\n\\nCredit: InfoSec4TC\\n\\n\\n\\n\\n            InfoSec4TC Platinum Membership (Lifetime Access)\\n            (opens in a new tab)\\n\\n\\xa355.97 at the Mashable Shop\\n\\nGet Deal\\n(opens in a new tab)\\n\\n\\n", "link": "https://mashable.com/uk/deals/best-infosec-4tc-deal", "pubDate": "Mon, 10 Apr 2023 04:00:00 +0000", "feed_title": "Mashable", "feed_link": "null"}, {"id_field": "27b92262-c2d3-49cc-a1d2-124ca24f1749", "embed_text": "SE Cupp says 'no one should care' about GOP outrage over Trump indictment - • What we know: Trump caught off guard by indictment, source says", "title": "SE Cupp says 'no one should care' about GOP outrage over Trump indictment", "description": "• What we know: Trump caught off guard by indictment, source says", "link": "https://www.cnn.com/videos/politics/2023/03/31/se-cupp-gop-outrage-trump-indictment-newsroom-vpx.cnn", "pubDate": "Fri, 31 Mar 2023 18:10:35 GMT", "feed_title": "CNN.com - RSS Channel - HP Hero", "feed_link": "https://www.cnn.com/index.html"}, {"id_field": "36937b63-00e8-46a5-8808-b5827d767d07", "embed_text": "We tested bidets for 3 months — we're never going back to standard toilets - ", "title": "We tested bidets for 3 months — we're never going back to standard toilets", "description": "null", "link": "https://www.cnn.com/cnn-underscored/reviews/best-bidets?iid=CNNUnderscoredHPcontainer", "pubDate": "null", "feed_title": "CNN.com - RSS Channel - HP Hero", "feed_link": "https://www.cnn.com/index.html"}, {"id_field": "3b560d1d-8c2c-407c-91c4-c36a814377c6", "embed_text": "How these Ukrainian soldiers show the effects of war on their faces - A group of American and Canadian surgeons called \"Face the Future\" work across the globe focusing on delicate reconstructive surgery. The foundation's work included Russia, until recently, but they quickly pivoted their efforts to Ukraine after the full-scale war began. CNN's David McKenzie has the story. ", "title": "How these Ukrainian soldiers show the effects of war on their faces", "description": "A group of American and Canadian surgeons called \"Face the Future\" work across the globe focusing on delicate reconstructive surgery. The foundation's work included Russia, until recently, but they quickly pivoted their efforts to Ukraine after the full-scale war began. CNN's David McKenzie has the story. ", "link": "https://www.cnn.com/videos/world/2023/03/31/facial-surgeons-ukrainian-soldiers-reconstruct-mckenzie-pkg-intl-vpx.cnn", "pubDate": "Fri, 31 Mar 2023 20:11:36 GMT", "feed_title": "CNN.com - RSS Channel - HP Hero", "feed_link": "https://www.cnn.com/index.html"}, {"id_field": "3f5b1013-732f-4dab-b8b9-8c0ccb6971f5", "embed_text": "59% of readers who took this week's news quiz got 8 or more questions right. How will you fare? - ", "title": "59% of readers who took this week's news quiz got 8 or more questions right. How will you fare?", "description": "null", "link": "https://www.cnn.com/interactive/2023/03/us/cnn-5-things-news-quiz-march-30-sec/", "pubDate": "null", "feed_title": "CNN.com - RSS Channel - HP Hero", "feed_link": "https://www.cnn.com/index.html"}, {"id_field": "5f594f1f-41b3-4c38-a79b-816bc897eaeb", "embed_text": "We tested over 30 vacuum models. Here are the six best for cleaning pet hair - ", "title": "We tested over 30 vacuum models. Here are the six best for cleaning pet hair", "description": "null", "link": "https://www.cnn.com/cnn-underscored/home/best-vacuum-for-pet-hair?iid=CNNUnderscoredHPcontainer", "pubDate": "null", "feed_title": "CNN.com - RSS Channel - HP Hero", "feed_link": "https://www.cnn.com/index.html"}, {"id_field": "6228508b-e6b5-4704-bd2c-de94bf2ebf2e", "embed_text": "Why skinny soda cans are everywhere  - Suddenly, your beverage is taller. ", "title": "Why skinny soda cans are everywhere ", "description": "Suddenly, your beverage is taller. ", "link": "https://www.cnn.com/2023/03/30/business/soda-cans-slim-aluminum/index.html", "pubDate": "Thu, 30 Mar 2023 15:13:40 GMT", "feed_title": "CNN.com - RSS Channel - HP Hero", "feed_link": "https://www.cnn.com/index.html"}, {"id_field": "6a29a668-62d8-4e55-80cc-55bb98845eb4", "embed_text": "This $26 Amazon dress is about to become your spring wardrobe staple - ", "title": "This $26 Amazon dress is about to become your spring wardrobe staple", "description": "null", "link": "https://www.cnn.com/cnn-underscored/reviews/amazon-msbasic-dress?iid=CNNUnderscoredHPcontainer", "pubDate": "null", "feed_title": "CNN.com - RSS Channel - HP Hero", "feed_link": "https://www.cnn.com/index.html"}, {"id_field": "922e4c7c-4ae3-4158-9c80-dec9ba8d9499", "embed_text": "A snowboarder got buried upside down in snow. See skier's quick reaction - Skier Francis Zuber sprang into action when he noticed a snowboarder had become trapped upside down in a tree well. Zuber, whose reaction has been applauded as a textbook example of what to do in such a situation, urged others to take up rescue courses.", "title": "A snowboarder got buried upside down in snow. See skier's quick reaction", "description": "Skier Francis Zuber sprang into action when he noticed a snowboarder had become trapped upside down in a tree well. Zuber, whose reaction has been applauded as a textbook example of what to do in such a situation, urged others to take up rescue courses.", "link": "https://www.cnn.com/videos/us/2023/03/31/snowboarder-rescue-mt-baker-washington-cprog-lon-orig-na.cnn", "pubDate": "Fri, 31 Mar 2023 12:33:33 GMT", "feed_title": "CNN.com - RSS Channel - HP Hero", "feed_link": "https://www.cnn.com/index.html"}, {"id_field": "b3232486-b242-4c49-93a4-7e948e301a51", "embed_text": "Our editors' favorite picks to shop from Wayfair's 5 Days of Deals sale - ", "title": "Our editors' favorite picks to shop from Wayfair's 5 Days of Deals sale", "description": "null", "link": "https://www.cnn.com/cnn-underscored/deals/wayfair-5-days-of-deals-sale-2023-03-31?iid=CNNUnderscoredHPcontainer", "pubDate": "null", "feed_title": "CNN.com - RSS Channel - HP Hero", "feed_link": "https://www.cnn.com/index.html"}, {"id_field": "7989e956-65de-49f2-b63b-65cffd69f6b4", "embed_text": "AI Desperately Needs Global Oversight - As ChatGPT and its ilk continue to spread, countries need an independent board to hold AI companies accountable and limit harms.", "title": "AI Desperately Needs Global Oversight", "description": "As ChatGPT and its ilk continue to spread, countries need an independent board to hold AI companies accountable and limit harms.", "link": "https://www.wired.com/story/ai-desperately-needs-global-oversight/", "pubDate": "Thu, 06 Apr 2023 13:00:00 +0000", "feed_title": "Wired", "feed_link": "https://www.wired.com"}, {"id_field": "e716b7fc-6994-43c7-975d-f75e7d65db1e", "embed_text": "NASA Is Getting Really Serious About Tracking Air Pollution - With new satellites and programs, the agency is tackling air quality from all angles\\u2014for the health of people and the planet.", "title": "NASA Is Getting Really Serious About Tracking Air Pollution", "description": "With new satellites and programs, the agency is tackling air quality from all angles\\u2014for the health of people and the planet.", "link": "https://www.wired.com/story/nasa-tracking-air-pollution/", "pubDate": "Fri, 07 Apr 2023 14:01:14 +0000", "feed_title": "Wired", "feed_link": "https://www.wired.com"}, {"id_field": "ee347254-8619-4dd4-bb8a-99371d91a332", "embed_text": "Free AI Video Generators Are Nearing a Crucial Tipping Point - Video memes made with algorithms are suddenly everywhere. Their sudden proliferation may herald an imminent explosion in the technology's capability.", "title": "Free AI Video Generators Are Nearing a Crucial Tipping Point", "description": "Video memes made with algorithms are suddenly everywhere. Their sudden proliferation may herald an imminent explosion in the technology's capability.", "link": "https://www.wired.com/story/ai-video-generators-are-nearing-a-crucial-tipping-point/", "pubDate": "Thu, 06 Apr 2023 16:00:00 +0000", "feed_title": "Wired", "feed_link": "https://www.wired.com"}, {"id_field": "48da54c7-6f71-4c7c-b834-99514e7da3c7", "embed_text": "Person Robbed at Gunpoint at 49-09 25th Ave, Woodside, New York, 11377", "title": "Person Robbed at Gunpoint at 49-09 25th Ave, Woodside, New York, 11377", "description": "null", "link": "null", "pubDate": "null", "feed_title": "Citizen", "feed_link": "null"}, {"id_field": "95fa3160-2b55-4cad-b687-13e2fa545132", "embed_text": "TechCrunch+ roundup: 5-year business models, RevOps tactics, how much to pay founders? - When a fighter has no reasonable chance of winning the match, throwing in the towel is the smart move. This also applies to startup founders.\\nTechCrunch+ roundup: 5-year business models, RevOps tactics, how much to pay founders? by Walter Thompson originally published on TechCrunch\\n", "title": "TechCrunch+ roundup: 5-year business models, RevOps tactics, how much to pay founders?", "description": "When a fighter has no reasonable chance of winning the match, throwing in the towel is the smart move. This also applies to startup founders.\\nTechCrunch+ roundup: 5-year business models, RevOps tactics, how much to pay founders? by Walter Thompson originally published on TechCrunch\\n", "link": "https://techcrunch.com/2023/04/11/techcrunch-roundup-5-year-business-models-revops-tactics-how-much-to-pay-founders/", "pubDate": "Tue, 11 Apr 2023 17:33:02 +0000", "feed_title": "TechCrunch", "feed_link": "null"}, {"id_field": "04380b09-19ed-49ab-bb7c-a6201f5f36a1", "embed_text": "Risk, Gambling, and Financialization", "title": "Risk, Gambling, and Financialization", "description": "null", "link": "https://humanjourney.us/the-changing-world-economy-section/risk-gambling-and-financialisation/", "pubDate": "null", "feed_title": "null", "feed_link": "null"}, {"id_field": "047d7216-e066-4813-a68f-ef7783594f8e", "embed_text": "15 years ago, GitHub officially launched", "title": "15 years ago, GitHub officially launched", "description": "null", "link": "https://github.blog/2008-04-10-we-launched/", "pubDate": "null", "feed_title": "null", "feed_link": "null"}, {"id_field": "0532f34a-4438-48af-8dc0-261e6f8dce0a", "embed_text": "Plane: Open-Source Jira, Linear and Height Alternative", "title": "Plane: Open-Source Jira, Linear and Height Alternative", "description": "null", "link": "https://github.com/makeplane/plane", "pubDate": "null", "feed_title": "null", "feed_link": "null"}, {"id_field": "077bc98c-c01d-44b8-93f2-27fe2a248e80", "embed_text": "Show HN: Tlk – A free, open-source video calling app for the web", "title": "Show HN: Tlk – A free, open-source video calling app for the web", "description": "null", "link": "https://tlk.li", "pubDate": "null", "feed_title": "null", "feed_link": "null"}, {"id_field": "08a43062-5223-4b92-8f48-56ec833bf29f", "embed_text": "What developers need to know about generative AI", "title": "What developers need to know about generative AI", "description": "null", "link": "https://github.blog/2023-04-07-what-developers-need-to-know-about-generative-ai/", "pubDate": "null", "feed_title": "null", "feed_link": "null"}, {"id_field": "0b7fba09-c16d-4d20-9583-19c0d70bb2c6", "embed_text": "Remarks 1–18 on GPT (compressed)", "title": "Remarks 1–18 on GPT (compressed)", "description": "null", "link": "https://www.lesswrong.com/posts/7qSHKYRnqyrumEfbt/remarks-1-18-on-gpt-compressed", "pubDate": "null", "feed_title": "null", "feed_link": "null"}, {"id_field": "0ec0f463-3799-4cbf-ba89-6aa6f7da8aad", "embed_text": "Melbourne scientists find enzyme that can make electricity out of hydrogen", "title": "Melbourne scientists find enzyme that can make electricity out of hydrogen", "description": "null", "link": "https://www.abc.net.au/news/2023-03-09/monash-university-air-electricity-enzyme-soil/102071786", "pubDate": "null", "feed_title": "null", "feed_link": "null"}, {"id_field": "121dc788-9cd6-44b6-a647-771769df9bc4", "embed_text": "Passing the Reins on Panfrost", "title": "Passing the Reins on Panfrost", "description": "null", "link": "https://rosenzweig.io/blog/passing-reins-panfrost.html", "pubDate": "null", "feed_title": "null", "feed_link": "null"}, {"id_field": "2cf2cc2d-ae77-4958-b081-7d0930a0123b", "embed_text": "American IQ scores have rapidly dropped, proving the 'Reverse Flynn effect'", "title": "American IQ scores have rapidly dropped, proving the 'Reverse Flynn effect'", "description": "null", "link": "https://www.popularmechanics.com/science/a43469569/american-iq-scores-decline-reverse-flynn-effect/", "pubDate": "null", "feed_title": "null", "feed_link": "null"}, {"id_field": "3ba61c2b-bc94-4ccf-9786-2a80581861f3", "embed_text": "Worried you're applying to a 'ghost job'? Here are some ways to tell", "title": "Worried you're applying to a 'ghost job'? Here are some ways to tell", "description": "null", "link": "https://artifact.news/s/z6p8guhbCFs=", "pubDate": "null", "feed_title": "null", "feed_link": "null"}, {"id_field": "9628d938-7574-4bf8-a636-bf3ac0157317", "embed_text": "Mutmut (2019)", "title": "Mutmut (2019)", "description": "null", "link": "https://nedbatchelder.com/blog/201903/mutmut.html", "pubDate": "null", "feed_title": "null", "feed_link": "null"}, {"id_field": "00c8b171-8e70-46c6-8039-b848684913da", "embed_text": "Masters right after college with no experience - im currently a software engineering student at college , 3rd year. ,i plan to get a masters degree in software engineering after my intern , my main goal is to travel abroad and getting a job from another country in ios development seems impossible , so i plan to take the master's route , now im confused , when i take the master's there is no going back and probably masters in SW will have nothing to do with IOS development , what should i take right now that doesn't seem like a waste of time and energy that will help my with my masters and take all the benifits of the increased base pay , should i change careers ? i'm still in college and have 1 year to figure out everything , thanks for reading i'm looking forward for your reply's!", "title": "Masters right after college with no experience", "description": "im currently a software engineering student at college , 3rd year. ,i plan to get a masters degree in software engineering after my intern , my main goal is to travel abroad and getting a job from another country in ios development seems impossible , so i plan to take the master's route , now im confused , when i take the master's there is no going back and probably masters in SW will have nothing to do with IOS development , what should i take right now that doesn't seem like a waste of time and energy that will help my with my masters and take all the benifits of the increased base pay , should i change careers ? i'm still in college and have 1 year to figure out everything , thanks for reading i'm looking forward for your reply's!", "link": "null", "pubDate": "null", "feed_title": "Reddit Feed", "feed_link": "https://www.reddit.com"}, {"id_field": "003cc806-6476-4f14-9bff-7d3422a42b7a", "embed_text": "Aí cara, parece que minha irmã sente.. 🥺💖💖💖", "title": "Aí cara, parece que minha irmã sente.. 🥺💖💖💖", "description": "null", "link": "https://twitter.com/i/web/status/1645568534427353088", "pubDate": "null", "feed_title": "Twitter Feed", "feed_link": "https://twitter.com"}, {"id_field": "0065b408-8cbc-405a-ba60-db60c505b5a4", "embed_text": "desisti de estudar ai fui fazer 1 carrd novo mas ficou mt feiooo  to sem criatividade nenhuma hj 💔 https://t.co/LRMGq9zAWx", "title": "desisti de estudar ai fui fazer 1 carrd novo mas ficou mt feiooo  to sem criatividade nenhuma hj 💔 https://t.co/LRMGq9zAWx", "description": "null", "link": "https://twitter.com/i/web/status/1645568469742817280", "pubDate": "null", "feed_title": "Twitter Feed", "feed_link": "https://twitter.com"}, {"id_field": "0094c85b-b67d-4bfb-9837-a226aea99546", "embed_text": "Hey! Say! JUMP山田涼介＆SixTONESジェシーらが神業に挑戦\n\n#橋本環奈 #HeySayJUMP #山田涼介 #SixTONES #ジェシー #THE神業チャレンジ https://t.co/JGw6dqpPjM", "title": "Hey! Say! JUMP山田涼介＆SixTONESジェシーらが神業に挑戦\n\n#橋本環奈 #HeySayJUMP #山田涼介 #SixTONES #ジェシー #THE神業チャレンジ https://t.co/JGw6dqpPjM", "description": "null", "link": "https://twitter.com/i/web/status/1645568635312947200", "pubDate": "null", "feed_title": "Twitter Feed", "feed_link": "https://twitter.com"}, {"id_field": "030cdf24-3e84-47e5-993a-b5dc0ccf493a", "embed_text": "Ce mec parle trop mal sur le physique des autres pour un mec moche j’ai la rage. https://t.co/G8K5Y76ZGJ", "title": "Ce mec parle trop mal sur le physique des autres pour un mec moche j’ai la rage. https://t.co/G8K5Y76ZGJ", "description": "null", "link": "https://twitter.com/i/web/status/1645568503217266695", "pubDate": "null", "feed_title": "Twitter Feed", "feed_link": "https://twitter.com"}, {"id_field": "0494243e-6ba6-4463-9399-e6a0d5f49dbd", "embed_text": "ビル・ゲイツ、AI開発停止を疑問視…「課題の解決になるとは思えない」（海外）(BUSINESS INSIDER JAPAN)https://t.co/o8m8eMDlDE", "title": "ビル・ゲイツ、AI開発停止を疑問視…「課題の解決になるとは思えない」（海外）(BUSINESS INSIDER JAPAN)https://t.co/o8m8eMDlDE", "description": "null", "link": "https://twitter.com/i/web/status/1645568549061283841", "pubDate": "null", "feed_title": "Twitter Feed", "feed_link": "https://twitter.com"}, {"id_field": "061f078e-723c-4089-8b70-5952b4409b34", "embed_text": "【ヤクルト】高津監督、節目200勝まであと１　先発サイスニード「自分のベストを出す」  https://t.co/QANJJPpWrD", "title": "【ヤクルト】高津監督、節目200勝まであと１　先発サイスニード「自分のベストを出す」  https://t.co/QANJJPpWrD", "description": "null", "link": "https://twitter.com/i/web/status/1645568638626459648", "pubDate": "null", "feed_title": "Twitter Feed", "feed_link": "https://twitter.com"}, {"id_field": "110fcee4-369c-4c88-9394-8e4f0233f5d8", "embed_text": "Hombre casi pierde la vida por ataque de su propio gallo de pelea (+Video)\n\nhttps://t.co/c6X9QuyHgp", "title": "Hombre casi pierde la vida por ataque de su propio gallo de pelea (+Video)\n\nhttps://t.co/c6X9QuyHgp", "description": "null", "link": "https://twitter.com/i/web/status/1645568633408483329", "pubDate": "null", "feed_title": "Twitter Feed", "feed_link": "https://twitter.com"}, {"id_field": "16bd79ca-f73b-49e5-b5f9-fe45e775a246", "embed_text": "小芝風花、圧巻のマシンガントークに拍手喝采！　『波よ聞いてくれ』会見はボケとツッコミの応酬  https://t.co/czdhMeSvds", "title": "小芝風花、圧巻のマシンガントークに拍手喝采！　『波よ聞いてくれ』会見はボケとツッコミの応酬  https://t.co/czdhMeSvds", "description": "null", "link": "https://twitter.com/i/web/status/1645568466563514368", "pubDate": "null", "feed_title": "Twitter Feed", "feed_link": "https://twitter.com"}, {"id_field": "3ec5b656-3988-4e99-a283-4a9fa5e3164e", "embed_text": "https://t.co/a2HUzagPtI", "title": "https://t.co/a2HUzagPtI", "description": "null", "link": "https://twitter.com/i/web/status/1645568467800846337", "pubDate": "null", "feed_title": "Twitter Feed", "feed_link": "https://twitter.com"}]