[{"id_field": "53772aa5-7275-4483-bc10-3700800bbd31", "embed_text": "'Thirsty' AI: Training ChatGPT Required Enough Water to Fill a Nuclear Reactor's Cooling Tower, Study Finds - Popular large language models (LLMs) like OpenAI\\u2019s ChatGPT and Google\\u2019s Bard are energy intensive, requiring massive server farms to provide enough data to train the powerful programs. Cooling those same data centers also makes the AI chatbots incredibly thirsty. New research suggests training for GPT-3 alone consumed\\u2026Read more...", "title": "'Thirsty' AI: Training ChatGPT Required Enough Water to Fill a Nuclear Reactor's Cooling Tower, Study Finds", "description": "Popular large language models (LLMs) like OpenAI\\u2019s ChatGPT and Google\\u2019s Bard are energy intensive, requiring massive server farms to provide enough data to train the powerful programs. Cooling those same data centers also makes the AI chatbots incredibly thirsty. New research suggests training for GPT-3 alone consumed\\u2026Read more...", "link": "https://gizmodo.com/chatgpt-ai-water-185000-gallons-training-nuclear-1850324249", "pubDate": "Tue, 11 Apr 2023 19:45:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com", "article": "Training ChatGPT AI Required 185,000 Gallons of Water: StudyThe A.V. ClubDeadspinGizmodoJalopnikJezebelKotakuQuartzThe RootThe TakeoutThe OnionThe InventorySend us a Tip!ShopSubscribeThe Future Is HereWe may earn a commission from links on this pageSearchHomeLatestNewsGadgetsScienceEartherio9AISpaceEn EspañolVideoArtificial Intelligence'Thirsty' AI: Training ChatGPT Required Enough Water to Fill a Nuclear Reactor's Cooling Tower, Study FindsAn average user’s conversational exchange with ChatGPT amounts to dumping a large bottle of fresh water out on the ground, new research says.ByMack DeGeurinUpdatedMay 10, 2023Comments (48)We may earn a commission from links on this page.Photo: Alberto Ortega (AP)Popular large language models (LLMs) like OpenAI’s ChatGPT and Google’s Bard are energy-intensive, requiring massive server farms to provide enough data to train the powerful programs. Cooling those same data centers also makes the AI chatbots incredibly thirsty. New research suggests training for GPT-3 alone consumed 185,000 gallons (700,000 liters) of water. An average user’s conversational exchange with ChatGPT basically amounts to dumping a large bottle of fresh water out on the ground, according to a new study. Given the chatbot’s unprecedented popularity, researchers fear all those spilled bottles could take a troubling toll on water supplies, especially amid historic droughts and looming environmental uncertainty in the US.WatchTop Takeaways from the Apple Event\n\n\n\n\n\nCCShare SubtitlesOffEnglishShare this VideoFacebookTwitterEmailRedditLinkview videoTop Takeaways from the Apple EventWhy Banning TikTok Won’t Protect Our PrivacyMarch 2, 2023Mac Studio and Studio Display ReviewMarch 18, 2022Researchers from the University of California Riverside and the University of Texas Arlington published the AI water consumption estimates in a pre-print paper titled “Making AI Less ‘Thirsty.’” The authors found the amount of clear freshwater required to train GPT-3 is equivalent to the amount needed to fill a nuclear reactor’s cooling tower. OpenAI has not disclosed the length of time required to train GPT-3, complicating the researchers’ estimations, but Microsoft, which has struck a multi-year, multi-billion-dollar partnership with the AI startup and built supercomputers for AI training, says that its latest supercomputer, which would require an extensive cooling apparatus, contains 10,000 graphics cards and over 285,000 processor cores, giving a glimpse into the vast scale of the operation behind artificial intelligence. That huge number of gallons could produce battery cells for 320 Teslas, or, put another way, ChatGPT, which came after GPT-3, would need to “drink” a 500-milliliter water bottle in order to complete a basic exchange with a user consisting of roughly 25-50 questions.AdvertisementThe gargantuan number of gallons needed to train the AI model also assumes the training is happening in Microsoft’s state-of-the-art US data center, built especially for OpenAI to the tune of tens of millions. If the data was trained in the company’s less energy-efficient Asia data center, the report notes water consumption could be three times higher. The researchers expect these water requirements will only increase further with newer models, like the recently released GPT-4, which rely on a larger set of data parameters than their predecessors. “AI models’ water footprint can no longer stay under the radar,” the researchers said. “Water footprint must be addressed as a priority as part of the collective efforts to combat global water challenges.”AdvertisementAdvertisementHow do chatbots use water?When calculating AI’s water consumption, the researchers draw a distinction between water “withdrawal” and “consumption.” The first example is the practice of physically removing water from a river, lake, or other source, while consumption refers specifically to the loss of water by evaporation when it’s used in data centers. The research on AI’s water usage focuses primarily on the consumption part of that equation, where the water can’t be recycled.AdvertisementAnyone who’s spent a few seconds in a company server room knows you need to pack a sweater first. Server rooms are kept cool, typically between 50 and 80 degrees Fahrenheit to prevent equipment from malfunctioning. Maintaining that ideal temperature is a constant challenge because the servers themselves convert their electrical energy into heat. Cooling towers like the ones shown below are often deployed to try and counteract that heat and keep the rooms in their ideal temperature by evaporating cold water.Evaporative Cooling Towers in the Data Center ProcessCooling towers get the job done, but they require immense amounts of water to do so. The researchers estimate around a gallon of water is consumed for every kilowatt-hour expended in an average data center. Not just any type of water can be used, either. Data centers pull from clean, freshwater sources in order to avoid the corrosion or bacteria growth that can come with seawater. Freshwater is also essential for humidity control in the rooms. The researchers likewise hold data centers accountable for the water needed to generate the high amounts of electricity they consume, something the scientists called “off-site indirect water consumption.” AdvertisementGoogle data center imagesWater consumption issues aren’t limited to OpenAI or AI models. In 2019, Google requested more than 2.3 billion gallons of water for data centers in just three states. The company currently has 14 data centers spread out across North America which it uses to power Google Search, its suite of workplace products, and more recently, its LaMDa and Bard large language models. LaMDA alone, according to the recent research paper, could require millions of liters of water to train, larger than GPT-3 because several of Google’s thirsty data centers are housed in hot states like Texas; researchers issued a caveat with this estimation, though, calling it an “ approximate reference point.”AdvertisementAside from water, new LLMs similarly require a staggering amount of electricity. A Stanford AI report released last week looks at differences in energy consumption among four prominent AI models, estimating OpenAI’s GPT-3 released 502 metric tons of carbon during its training. Overall, the energy needed to train GPT-3 could power an average American’s home for hundreds of years.“The race for data centers to keep up with it all is pretty frantic,” Critical Facilities Efficiency Solution CEO Kevin Kent said in an interview with Time. “They can’t always make the most environmentally best choices.”AdvertisementClimate change and worsening droughts could amplify concerns over AI’s water usageAlready, the World Economic Forum estimates some 2.2 million US residents lack water and basic indoor plumbing. Another 44 million live with “inadequate” water systems. Researchers fear a combination of climate change and increased US populations will make those figures even worse by the end of the century. By 2071, Stanford estimates nearly half of the country’s 204 freshwater basins will be unable to meet monthly water demands. Many regions could reportedly see their water supplies cut by a third in the next 50 years.AdvertisementRising temperatures partially fueled by human activity have resulted in the American West recording its worst drought in 1,000 years which also threatens freshwater, though recent flooding rains have helped stave off some dire concerns. Water levels at reservoirs like Lake Mead have receded so far that they’ve exposed decades old human remains. All of that means AI’s hefty water demands will likely become a growing point of contention, especially if the tech is embedded into ever more sectors and services. Data requirements for LLMs are only getting larger, which means companies will have to find ways to increase their data centers’ water efficiency. Researchers say there are some relatively clear ways to bring AI’s water price tag down. For starters, where and when AI models are trained matters. Outside temperatures, for example, can affect the amount of water required to cool data centers. AI companies could hypothetically train models at midnight when it’s cooler or in a data center with better water efficiency to cut down on usage. Chatbot users, on the other hand, could opt to engage with the modules during “water-efficient hours,” much as municipal authorities encourage off-hours dishwasher use. Still, any of those demand-side changes will require greater transparency on the part of tech companies building these models, something the researchers say is in worryingly short supply.Advertisement“We recommend AI model developers and data center operators be more transparent,” the researchers wrote. “When and where are the AI models trained? What about the AI models trained and/or deployed in third-party colocation data centers or public clouds? Such information will be of great value to the research community and the general public.”Want to know more about AI, chatbots, and the future of machine learning? Check out our full coverage of artificial intelligence, or browse our guides to The Best Free AI Art Generators and Everything We Know About OpenAI’s ChatGPT.Show all 48 commentsContinue reading\n\n", "summary": "\nResearch from UC Riverside and UT Arlington suggests that training OpenAI's ChatGPT AI model consumed 185,000 gallons of water, equivalent to the amount needed to fill a nuclear reactor's cooling tower. This outsized water consumption has raised concerns about its impact on water supplies, especially in light of climate change and worsening droughts."}, {"id_field": "1b3e1728-f80e-4f65-bf99-cec379f87e50", "embed_text": "Pentagon Leaks Show Russian Hacktivists Claim to Have Targeted a Canadian Pipeline - A leaked intelligence briefing that emerged over the weekend seems to reveal a hacking episode carried out by a pro-Russian hacktivist group against a major Canadian gas pipeline.Read more...", "title": "Pentagon Leaks Show Russian Hacktivists Claim to Have Targeted a Canadian Pipeline", "description": "A leaked intelligence briefing that emerged over the weekend seems to reveal a hacking episode carried out by a pro-Russian hacktivist group against a major Canadian gas pipeline.Read more...", "link": "https://gizmodo.com/russian-hackers-zarya-canadian-pipeline-pentagon-leak-1850318999", "pubDate": "Mon, 10 Apr 2023 21:25:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com", "article": "Russian Hacker Group Zarya Hit Canadian Pipeline—Leaked DocsThe A.V. ClubDeadspinGizmodoJalopnikJezebelKotakuQuartzThe RootThe TakeoutThe OnionThe InventorySend us a Tip!ShopSubscribeThe Future Is HereWe may earn a commission from links on this pageSearchHomeLatestNewsGadgetsScienceEartherio9AISpaceEn EspañolVideoCybersecurityPentagon Leaks Show Russian Hacktivists Claim to Have Targeted a Canadian PipelineDid a pro-Russian group hack a major Canadian energy project? A recently leaked U.S. intelligence briefing says so.ByLucas RopekPublishedApril 10, 2023Comments (1)We may earn a commission from links on this page.Photo: INSAGO (Shutterstock)A leaked intelligence briefing that emerged over the weekend seems to reveal a hacking episode carried out by a pro-Russian hacktivist group against a major Canadian gas pipeline.WatchTeenage Cybercrime Gang LAPSUS$ Strikes Again\n\n\n\n\n\nCCShare SubtitlesOffEnglishShare this VideoFacebookTwitterEmailRedditLinkview videoTeenage Cybercrime Gang LAPSUS$ Strikes AgainPentagon Employees Too Horny to Follow RulesFebruary 14, 2023Teyonah Parris and John Boyega on Working With Jamie Foxx | io9 Interview13 hours agoA glut of classified Pentagon documents have poured onto the internet in recent days in what is reputed to be a major leak of American national security secrets. The leaks, the source of which is still unknown, seem to reveal a broad swath of clandestine information—much of which relates to U.S. and NATO efforts to assist Ukraine in its ongoing war with Russia. The document that emerged over the weekend is less directly concerned with the Ukraine conflict itself than it is with the alarming digital powers possessed by Russia and its cyber mercenaries.AdvertisementThe leaked briefing seems to detail intercepted communications between a “pro-Russian hacker group” and an agent of the Federal Security Service, or FSB—Russia’s top intelligence agency, the New York Times initially reported.The group in question, known as “Zarya,” is reputed to be an offshoot of “Killnet”—the prominent pro-Russian hacktivist group that has been known to target U.S. websites and organizations.AdvertisementAdvertisementThe communications  seem to show that Zarya had infiltrated an unnamed Canadian energy company and that the agent had given the hackers instructions about what to do with their access to the gas company’s network.  In their chats, the hackers claim the frightening ability to remotely manipulate the unnamed energy project’s industrial controls—including a capacity to “increase valve pressure, disable alarms, and initiate an emergency shutdown of the facility.”Even more disturbingly, the FSB officer  communicated to the hacker group that “a successful operation [against the facility] would cause an explosion” and that the FSB was “monitoring Canadian news reports for indications of an explosion,” cybersecurity journalist Kim Zetter  reported. The goal of this supposed operation was to cause a “loss of income for Canadians,” not a “loss of life,” the report states.AdvertisementUnfortunately, the available reporting does not state which specific company is said to have been targeted, merely referring to it as an “unspecified gas distribution station.”It’s also unclear whether anything ever happened with this alleged hacking mission—or if the hackers ultimately managed to damage the company in question. AdvertisementThe leaked intel report states that, if the claims of Zarya’s claims of an attack are accurate, “it would mark the first time” that U.S. intelligence has “observed a pro-Russia-hacking group execute a disruptive attack against Western industrial control systems.”In recent years, concerns over the energy industry’s inadequate cybersecurity protections have seen a sharp uptick. Ever since the ransomware gang DarkSide successfully attacked Colonial Pipeline in 2021, Western governments have sought to bolster  digital protections for major oil and gas projects. In March, the Biden administration published its strategic vision for cybersecurity policy, recommending additional security for America’s industrial systems.Show all 1 comments\n\n", "summary": "\nA leaked intelligence briefing appears to show that a pro-Russian hacker group infiltrated a major Canadian gas pipeline and had the ability to manipulate the pipeline's industrial controls, potentially causing an explosion. While it is unclear if anything happened with this alleged mission, the incident has highlighted the need for better digital protections in the energy industry."}, {"id_field": "c645de0a-2afe-4cb1-ba36-cd26d5226d1b", "embed_text": "Sul Sul: Study Mixes ChatGPT With 'The Sims' to Delightful Effect - At long last, researchers from Stanford University and Google teamed up to answer one of the most pressing questions about AI: Can we make ChatGPT play The Sims? The answer, thank god, is yes (sort of). In a new study, computer scientists whipped up a pixel-art game to test whether you can separate AIs will simulate\\u2026Read more...", "title": "Sul Sul: Study Mixes ChatGPT With 'The Sims' to Delightful Effect", "description": "At long last, researchers from Stanford University and Google teamed up to answer one of the most pressing questions about AI: Can we make ChatGPT play The Sims? The answer, thank god, is yes (sort of). In a new study, computer scientists whipped up a pixel-art game to test whether you can separate AIs will simulate\\u2026Read more...", "link": "https://gizmodo.com/chatgpt-ai-the-sims-google-stanford-study-1850323073", "pubDate": "Tue, 11 Apr 2023 16:37:00 +0000", "feed_title": "Gizmodo", "feed_link": "https://gizmodo.com", "article": "Google, Stanford Study Delightfully Mixes ChatGPT With The SimsThe A.V. ClubDeadspinGizmodoJalopnikJezebelKotakuQuartzThe RootThe TakeoutThe OnionThe InventorySend us a Tip!ShopSubscribeThe Future Is HereWe may earn a commission from links on this pageSearchHomeLatestNewsGadgetsScienceEartherio9AISpaceEn EspañolVideoTechSul Sul: Study Mixes ChatGPT With 'The Sims' to Delightful EffectWatch an interactive day in the life as AI-powered sprites interact, form memories, and pursue their individual goals—including a Valentine's Day party.ByThomas GermainPublishedApril 11, 2023Comments (1)We may earn a commission from links on this page.Screenshot: GizmodoAt long last, researchers from Stanford University and Google teamed up to answer one of the most pressing questions about AI: Can we make ChatGPT play The Sims? The answer, thank god, is yes (sort of). In a new study, computer scientists whipped up a pixel-art game to test whether you can separate AIs will simulate human behavior.WatchThe Hunger Games | The Last of Us Episode 8 Review\n\n\n\n\n\nCCShare SubtitlesOffEnglishShare this VideoFacebookTwitterEmailRedditLinkview videoThe Hunger Games | The Last of Us Episode 8 ReviewFavorite Vampires in Media | Jacob Anderson & Sam ReidOctober 3, 2022Andor Episode 6 ReviewOctober 14, 2022In the simulation, ChatGPT-fueled avatars “wake up, cook breakfast, and head to work; artists paint, while authors write; they form opinions, notice each other, and initiate conversations; they remember and reflect on days past as they plan the next day,” the authors said.Advertisement“We instantiate generative agents to populate an interactive sandbox environment inspired by The Sims, where end users can interact with a small town of twenty five agents using natural language,” the researchers said in the study, now in preprint.The study used ChatGPT to create what the researchers called “generative agents,” little simulated personalities with memories and individual goals that interact with each other as they go about their daily business.AdvertisementAdvertisementYou can see the AI sprites in action on an interactive website. In this replay session, the researchers gave a ChatGPT Sim named Isabelle the idea that it wants to plan a Valentine’s Day party. It starts off early on a Monday morning, with early risers getting up to brush their teeth and do yoga, while others sleep in. As the 25 generative agents go about their days, they invite one another, make new friends, ask each other out on dates, and even plan what time they’ll arrive at the party together.You can click around to check the status of individual agents, which lets you see what memories they’ve stored, who they’re talking to, and what they’re doing.AdvertisementIf you watch through to the end, you’ll find that five out of 12 people invited to the party show up. Three don’t come because they have scheduling conflicts (Think about how weird that is. They don’t really exist), while four who said they wanted to come don’t show up.The generative agents really do seem to communicate with each other. When the researchers gave a Sim named Sam the goal of running for mayor, (they all live in a town called Smallville, by the way) he went around announcing his candidacy to his neighbors.Advertisement“During the two-day simulation, the agents who knew about Sam’s mayoral candidacy increased from one (4 percent) to eight (32 percent), and the agents who knew about Isabella’s party increased from one (4 percent) to twelve (48 percent), completely without user intervention,” the researchers said.As if the fact that this thing exists in the first place isn’t enough, the study deals with questions of actual scientific value.AdvertisementMaking a computer play computer games is nothing new, and the current generation of AI chatbots often whip up distinct personalities as you interact with them. But in order to get a tool like ChatGPT to perform a task that’s useful, you need to establish a framework around it.This isn’t the first time computer scientists used AI to simulate conversations or play games. Researchers trained AI tools to beat chess grandmasters or overcome world champions at video games like StarCraft. And as far back as 1966, the famous 1966 robot therapist Eliza fooled people into thinking they were talking to a real shrink.AdvertisementThis new study builds on that research by going beyond its restraints. Unlike their predecessors, the generative agents in this experiment weren’t spitting out pre written answers or playing games with winners, losers, and clearly defined rules. “These approaches often simplified the environment or dimensions of agent behavior to make the effort more manageable,” the researchers said in the paper.Because generative agents interact with their environments and maintain their own “personalities” the study demonstrates a model that could be more useful in real world applications.AdvertisementOn the other hand, the agents demonstrate an unnerving level of autonomy. The weird little guys understood what you’re supposed to do in spaces labeled “store” or “bathroom,” for example. In other words, you can look forward to an internet populated by robots that really seem like their own people, wandering around using apps and websites. Yay!The good news is if you’ve ever felt guilty about all those hours you spent torturing your Sims or trying to get them to have “WooHoo,” now you can pretend you’re doing serious academic research.AdvertisementWant to know more about AI, chatbots, and the future of machine learning? Check out our full coverage of artificial intelligence, or browse our guides to The Best Free AI Art Generators and Everything We Know About OpenAI’s ChatGPT.Show all 1 comments\n\n", "summary": "\nIn a recent study, Google and Stanford University researchers used ChatGPT-fueled avatars in a pixel-art game to simulate human behavior, such as waking up, cooking breakfast, forming opinions, talking to each other, and planning a Valentine's Day party. The agents demonstrated a level of autonomy, understanding what to do in different spaces."}, {"id_field": "754fb86b-cb5b-448b-8e1b-4e2a44dbe9ae", "embed_text": "Users who spot bugs in ChatGPT can now make up to $20,000 - OpenAI will now reward you for finding bugs in ChatGPT.On Tuesday, OpenAI announced a bug bounty program that will reward people between $200 and $20,000 for finding bugs within ChatGPT, the OpenAI plugins, the OpenAI API, and other related services. \"We invite you to report vulnerabilities, bugs, or security flaws you discover in our systems,\" said the announcement. \"By sharing your findings, you will play a crucial role in making our technology safer for everyone.\" \\nSEE ALSO:\\n\\n            The ChatGPT bug exposed more private data than previously thought, OpenAI confirms\\n            \\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\nOpenAI's launch of a bug bounty program comes on the heels of a data breach and mounting concern over privacy risks. A few weeks ago, a bug was discovered that exposed chat titles, the first message of new conversations, and payment information from ChatGPT Plus users. OpenAI has also been under intense scrutiny for how it protects user data, especially when it comes to minors. ChatGPT was banned in Italy for this very reason. These issues, plus an open letter signed by Steve \"Woz\" Wozniak and Elon Musk calling for a six-month pause on AI systems, seem to have prompted OpenAI to publicly assert its commitment to safety. The bug bounty program is managed by Bugcrowd which will handle the submissions and rewards. The monetary amount of the reward is based on the severity of the bug. But don't get too excited yet. There are lengthy guidelines and rules of engagement for what won't be rewarded. Jailbreaks, \"getting the model to say bad things to you,\" and hallucinations are explicitly out of scope. Also don't try any attacks that may \"degrade, disrupt, or negatively impact services or user experience\" like a Denial of Service attack (DDoS) or scams like social engineering or phishing. At the time of publication, four vulnerabilities have already been rewarded. Let the hunt commence.", "title": "Users who spot bugs in ChatGPT can now make up to $20,000", "description": "OpenAI will now reward you for finding bugs in ChatGPT.On Tuesday, OpenAI announced a bug bounty program that will reward people between $200 and $20,000 for finding bugs within ChatGPT, the OpenAI plugins, the OpenAI API, and other related services. \"We invite you to report vulnerabilities, bugs, or security flaws you discover in our systems,\" said the announcement. \"By sharing your findings, you will play a crucial role in making our technology safer for everyone.\" \\nSEE ALSO:\\n\\n            The ChatGPT bug exposed more private data than previously thought, OpenAI confirms\\n            \\n\\n\\n\\n\\n        Tweet may have been deleted\\n        (opens in a new tab)\\n\\n\\nOpenAI's launch of a bug bounty program comes on the heels of a data breach and mounting concern over privacy risks. A few weeks ago, a bug was discovered that exposed chat titles, the first message of new conversations, and payment information from ChatGPT Plus users. OpenAI has also been under intense scrutiny for how it protects user data, especially when it comes to minors. ChatGPT was banned in Italy for this very reason. These issues, plus an open letter signed by Steve \"Woz\" Wozniak and Elon Musk calling for a six-month pause on AI systems, seem to have prompted OpenAI to publicly assert its commitment to safety. The bug bounty program is managed by Bugcrowd which will handle the submissions and rewards. The monetary amount of the reward is based on the severity of the bug. But don't get too excited yet. There are lengthy guidelines and rules of engagement for what won't be rewarded. Jailbreaks, \"getting the model to say bad things to you,\" and hallucinations are explicitly out of scope. Also don't try any attacks that may \"degrade, disrupt, or negatively impact services or user experience\" like a Denial of Service attack (DDoS) or scams like social engineering or phishing. At the time of publication, four vulnerabilities have already been rewarded. Let the hunt commence.", "link": "https://mashable.com/article/openai-chatgpt-bug-bounty-program", "pubDate": "Tue, 11 Apr 2023 20:40:21 +0000", "feed_title": "Mashable", "feed_link": "null", "article": "\n\n\nOpenAI announces ChatGPT bug bounty program with up to $20,000 in rewards | Mashable\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmazon Prime Day\nTech\nScience\nLife\nSocial Good\nEntertainment\nDeals\nShopping\nTravel\n\n\n\n\n\n\n\n\n\nSearch\n\n\nCancel\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmazon Prime Day\n\n\nTech\n\n\n\n\n\n\nApps & Software\nArtificial Intelligence\nCybersecurity\nCryptocurrency\nMobile\nSmart Home\nSocial Media\nTech Industry\nTransportation\nAll Tech\n\n\n\n\nScience\n\n\n\n\n\n\nSpace\nClimate Change\nEnvironment\nVideo\nAll Science\n\n\n\n\nLife\n\n\n\n\n\n\nDigital Culture\nFamily & Parenting\nHealth & Wellness\nSex, Dating & Relationships\nSleep\nCareers\nMental Health\nAll Life\n\n\n\n\nSocial Good\n\n\n\n\n\n\nActivism\nGender\nLGBTQ\nRacial Justice\nSustainability\nPolitics\nAll Social Good\n\n\n\n\nEntertainment\n\n\n\n\n\n\nGames\nMovies\nPodcasts\nTV Shows\nVideo\nReviews\nWatch Guides\nAll Entertainment\n\n\n\n\nSHOP THE BEST\n\n\n\n\n\n\nHome\nTech\nKitchen\nFitness\nSex Toys\nApps & Software\nDating\nGift Guides\nMashable Choice\nMashable Selects\nGaming\nAll Best Products\n\n\n\n\nTravel\n\n\n\n\n\n\nDeals\nBest of\nAll Travel\n\n\n\n\nProduct Reviews\n\n\n\n\n\n\nTech\nLife\nBeauty Tech\nKitchen\nKids/Toys\nGaming\nFitness\nSex Toys\nApps & Software\nAll Product Reviews\n\n\n\n\nDEALS\n\n\n\n\n\n\nHome\nTech\nTV\nLaptop\nVPN\nVacuum\nGaming\nStreaming\nApple\n\nMashable Shop(opens in a new tab)\n\n\nAll Deals\n\n\n\nNewsletters\n\n\n\nVIDEOS\n\n\n\n\n\n\nMashable Shows\nAll Videos\n\n\n\n\n\n\n\nTech\nChatGPT\n\nUsers who spot bugs in ChatGPT can now make up to $20,000\nBut they have to be real bugs, not weird things ChatGPT says.\n\n\nBy\nCecily Mauran  on April 11, 2023\n\n\n\n\nShare on Facebook (opens in a new window)\n\n\n\nShare on Twitter (opens in a new window)\n\n\n\nShare on Flipboard (opens in a new window)\n\n\n\n\n\n\n\n\n\n\n\n\nOpenAI will reward ethical hackers for finding bugs. \nCredit: Getty Images\n\n\n\n\n\n\n\n\n\n\n\n\n>\nTech\n\n\n\n\nOpenAI will now reward you for finding bugs in ChatGPT.On Tuesday, OpenAI announced(opens in a new tab) a bug bounty program that will reward people between $200 and $20,000 for finding bugs within ChatGPT, the OpenAI plugins, the OpenAI API, and other related services. \"We invite you to report vulnerabilities, bugs, or security flaws you discover in our systems,\" said the announcement. \"By sharing your findings, you will play a crucial role in making our technology safer for everyone.\" \nSEE ALSO:\n\nThe ChatGPT bug exposed more private data than previously thought, OpenAI confirms\n\n\n\n\n\nTweet may have been deleted\n(opens in a new tab)\n\n\nOpenAI's launch of a bug bounty program comes on the heels of a data breach and mounting concern over privacy risks. A few weeks ago, a bug was discovered that exposed chat titles, the first message of new conversations, and payment information from ChatGPT Plus users. OpenAI has also been under intense scrutiny for how it protects user data, especially when it comes to minors. ChatGPT was banned in Italy for this very reason. These issues, plus an open letter signed by Steve \"Woz\" Wozniak and Elon Musk calling for a six-month pause on AI systems, seem to have prompted OpenAI to publicly assert its commitment to safety. The bug bounty program is managed by Bugcrowd(opens in a new tab) which will handle the submissions and rewards. The monetary amount of the reward is based on the severity of the bug. But don't get too excited yet. There are lengthy guidelines and rules of engagement for what won't be rewarded. Jailbreaks, \"getting the model to say bad things to you,\" and hallucinations are explicitly out of scope. Also don't try any attacks that may \"degrade, disrupt, or negatively impact services or user experience\" like a Denial of Service attack (DDoS) or scams like social engineering or phishing. \n\n\nRelated Stories\n\n\n\nWhoops, Samsung workers accidentally leaked trade secrets via ChatGPT\nChatGPT banned in Italy\nChatGPT plugins: How to get access\nNonprofit files FTC complaint against OpenAI's GPT-4\nAmidst controversies, OpenAI insists safety is mission critical\n\n\nAt the time of publication, four vulnerabilities have already been rewarded. Let the hunt commence.\n\n\n\n\nMore in\nChatGPT, OpenAI \n\n\n\n\n\n\n\n\nCecily Mauran\n\n\n\n\n\nCecily is a tech reporter at Mashable who covers AI, Apple, and emerging tech trends. Before getting her master's degree at Columbia Journalism School, she spent several years working with startups and social impact businesses for Unreasonable Group and B Lab. Before that, she co-founded a startup consulting business for emerging entrepreneurial hubs in South America, Europe, and Asia. You can find her on Twitter at @cecily_mauran(opens in a new tab).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRecommended For You\n\n\n\n\n\nChatGPT monthly traffic has dropped for the first time\nSeemingly the first bump in the road for the fastest growing app of all time.\n\n\n07/06/2023\n\n\nBy Cecily Mauran \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat not to share with ChatGPT if you use it for work\nTL;DR: A lot of things.\n\n\n05/30/2023\n\n\nBy Cecily Mauran \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n5 ChatGPT plugins that aren't worth your time\nWhich plugins aren't as promised or should be avoided at all costs?\n\n\n05/21/2023\n\n\nBy Cecily Mauran \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n5 ChatGPT plugins that do what they promise\nAmongst the sea of duds, there are some good and funny plugins that work as advertised.\n\n\n 05/20/2023\n\n\nBy Chance Townsend \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHow to unblock and watch U.S. Netflix\nSecurely stream more movies and shows from this popular Netflix library.\n\n\n07/03/2023\n\n\nBy Joseph Green \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTrending on Mashable\n\n\n\n\n\nWordle today: Here's the answer and hints for July 10\nHere are some tips and tricks to help you find the answer to \"Wordle\" #751.\n\n\n07/10/2023\n\n\nBy Mashable Team \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEverything you need to know about Amazon Prime Day 2023: Start times, invite-only deals, and the competition\nThe countdown is on.\n\n\n56 minutes ago\n\n\nBy Haley Henschel \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPreparing an Amazon wishlist ahead of Prime Day 2023 can save you serious time (and money)\nDon't miss out on the deals you actually want.\n\n\n5 hours ago\n\n\nBy Dylan Haas and Christina Buff \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n'The Crowded Room' is based on a disturbing true story\nTom Holland dips into true crime.\n\n\n07/07/2023\n\n\nBy Chanel Dubofsky \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrime Day 2023 is almost here and tons of new deals just dropped\nAs if Amazon would actually wait until Prime Day to release Prime Day deals.\n\n\n07/06/2023\n\n\nBy Leah Stodart and Haley Henschel \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe biggest stories of the day delivered to your inbox.\n\n\n\n\n\n\n\nLoading...\nSubscribe\n\n\n\n\n\n\n\n\n\nThis newsletter may contain advertising, deals, or affiliate links. Subscribing to a newsletter indicates your consent to our Terms of Use(opens in a new tab) and Privacy Policy(opens in a new tab). You may unsubscribe from the newsletters at any time.\n\n\n\nThanks for signing up. See you at your inbox!\n\n\n\n\n\n\n\n\n\n\nTECH\nSCIENCE\nLIFE\nSOCIAL GOOD\nENTERTAINMENT\nBEST PRODUCTS\nDEALS\n\n\nAbout Mashable\nContact Us\nWe're Hiring\nNewsletters\nSitemap\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMashable supports Group Black and its mission to increase greater diversity in media voices and media ownership. Group Black's collective includes Essence, TheShadeRoom and Afro-Punk.\n\n©2005–2023 Mashable, Inc., a Ziff Davis company. All Rights Reserved.\nMashable is a registered trademark of Ziff Davis and may not be used by third parties without express written permission.\n\nAbout Ziff Davis\nPrivacy Policy\nTerms of Use\nAdvertise\nAccessibility\nDo Not Sell My Personal Information\n\n\n\n\n\n\n\n\n\n\n\nAdChoices\n\n\n\n\n\n\n\n\n\n\n\n\n", "summary": "\nOpenAI has launched a bug bounty program that will reward people up to $20,000 for finding security flaws and bugs within its ChatGPT platform, plugins, API, and related services. The bug bounty program is managed by Bugcrowd and rewards are based on the severity of the bug."}, {"id_field": "98afedc3-0923-4884-91bf-b22a226be191", "embed_text": "Fetterman discharged from Walter Reed after receiving treatment for depression - Pennsylvania Sen. John Fetterman has been discharged from Walter Reed National Military Medical Center where he was being treated for depression, his office announced Friday. ", "title": "Fetterman discharged from Walter Reed after receiving treatment for depression", "description": "Pennsylvania Sen. John Fetterman has been discharged from Walter Reed National Military Medical Center where he was being treated for depression, his office announced Friday. ", "link": "https://www.cnn.com/2023/03/31/politics/fetterman-discharged-walter-reed-mental-health-depression/index.html", "pubDate": "Sat, 01 Apr 2023 00:15:55 GMT", "feed_title": "CNN.com - RSS Channel - HP Hero", "feed_link": "https://www.cnn.com/index.html", "article": " \n\n\n\n\n\n\n\n\nSen. John Fetterman discharged from Walter Reed  after receiving treatment for depression | CNN Politics\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCNN values your feedback\n\n\n\n\n                                                        1. How relevant is this ad to you?\n                                                \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                2. Did you encounter any technical issues?\n                                        \n\n\n\n\n\n\n\n\n\n\n\n                                                                        Video player was slow to load content\n                                                                        \n\n\n\n                                                                        Video content never loaded\n                                                                        \n\n\n\n                                                                        Ad froze or did not finish loading\n                                                                        \n\n\n\n                                                                        Video content did not start after ad\n                                                                        \n\n\n\n                                                                        Audio on ad was too loud\n                                                                        \n\n\n\n                                                                        Other issues\n                                                                        \n\n\n\n\n\n                                                                        Ad never loaded\n                                                                        \n\n\n\n                                                                        Ad prevented/slowed the page from loading\n                                                                        \n\n\n\n                                                                        Content moved around while ad loaded\n                                                                        \n\n\n\n                                                                        Ad was repetitive to ads I've seen previously\n                                                                        \n\n\n\n                                                                        Other issues\n                                                                        \n\n\n\n\n\n\n\n\n\n\n\n                                                        Cancel\n                                                \n\n                                                        Submit\n                                                \n\n\n\n\n\nThank You!\n\n                                        Your effort and contribution in providing this feedback is much\n                                        appreciated.\n                                \n\n                                        Close\n                                \n\n\n\n\n\n\n\n\n\n\n\nAd Feedback\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose icon\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                  \n                  The Biden Presidency\n                \n\n\n\n                  \n                  Facts First\n                \n\n\n\n                  \n                  2022 Midterms\n                \n\n\n\n                  More\n                \n\n\n                    The Biden Presidency\n                  \n\n                    Facts First\n                  \n\n                    2022 Midterms\n                  \n\n\n\n\n\n\n\n            Audio\n          \n\n            Live TV\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Log In\n      \n\n\n\n      My Account\n\n\n\n\n\n          Settings\n        \n\n\n\n          Topics You Follow\n          \n\n\n\n\n          Log Out\n        \n\n\n\n\nYour CNN account\nLog in to your CNN account\n\n\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Log In\n      \n\n\n\n      My Account\n\n\n\n\n\n          Settings\n        \n\n\n\n          Topics You Follow\n          \n\n\n\n\n          Log Out\n        \n\n\n\n\nYour CNN account\nLog in to your CNN account\n\n\n\n\n\n\n            Live TV\n          \n\n            Audio\n          \n\n\n\nEdition\n\n\n                  US\n                \n\n\n\n                  International\n                \n\n\n\n                  Arabic\n                \n\n\n\n                  Español\n                \n\n\n\n\n                Edition\n\n\n\n\n\n                  US\n                \n\n\n\n                  International\n                \n\n\n\n                  Arabic\n                \n\n\n\n                  Español\n                \n\n\n\n\n\n\n\n\n\n                  The Biden Presidency\n                \n\n\n\n                  Facts First\n                \n\n\n\n                  2022 Midterms\n                \n\n\n\nFollow CNN Politics\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        US\n      \n\n\n\n            Crime + Justice\n          \n\n\n\n            Energy + Environment\n          \n\n\n\n            Extreme Weather\n          \n\n\n\n            Space + Science\n          \n\n\n\n\n\n        World\n      \n\n\n\n            Africa\n          \n\n\n\n            Americas\n          \n\n\n\n            Asia\n          \n\n\n\n            Australia\n          \n\n\n\n            China\n          \n\n\n\n            Europe\n          \n\n\n\n            India\n          \n\n\n\n            Middle East\n          \n\n\n\n            United Kingdom\n          \n\n\n\n\n\n        Politics\n      \n\n\n\n            SCOTUS\n          \n\n\n\n            Congress\n          \n\n\n\n            Facts First\n          \n\n\n\n            2020 Election\n          \n\n\n\n\n\n        Business\n      \n\n\n\n            Tech\n          \n\n\n\n            Media\n          \n\n\n\n            Calculators\n          \n\n\n\n            Video\n          \n\n\n\n\n\n        Markets\n      \n\n\n\n            Pre-markets\n          \n\n\n\n            After-Hours\n          \n\n\n\n            Market Movers\n          \n\n\n\n            Fear & Greed\n          \n\n\n\n            World Markets\n          \n\n\n\n            Investing\n          \n\n\n\n            Markets Now\n          \n\n\n\n            Before the Bell\n          \n\n\n\n            Nightcap\n          \n\n\n\n\n\n        Opinion\n      \n\n\n\n            Political Op-Eds\n          \n\n\n\n            Social Commentary\n          \n\n\n\n\n\n        Health\n      \n\n\n\n            Life, But Better\n          \n\n\n\n            Fitness\n          \n\n\n\n            Food\n          \n\n\n\n            Sleep\n          \n\n\n\n            Mindfulness\n          \n\n\n\n            Relationships\n          \n\n\n\n\n\n        Entertainment\n      \n\n\n\n            Movies\n          \n\n\n\n            Television\n          \n\n\n\n            Celebrity\n          \n\n\n\n\n\n        Tech\n      \n\n\n\n            Innovate\n          \n\n\n\n            Gadget\n          \n\n\n\n            Foreseeable Future\n          \n\n\n\n            Mission: Ahead\n          \n\n\n\n            Upstarts\n          \n\n\n\n            Work Transformed\n          \n\n\n\n            Innovative Cities\n          \n\n\n\n\n\n        Style\n      \n\n\n\n            Arts\n          \n\n\n\n            Design\n          \n\n\n\n            Fashion\n          \n\n\n\n            Architecture\n          \n\n\n\n            Luxury\n          \n\n\n\n            Beauty\n          \n\n\n\n            Video\n          \n\n\n\n\n\n        Travel\n      \n\n\n\n            Destinations\n          \n\n\n\n            Food & Drink\n          \n\n\n\n            Stay\n          \n\n\n\n            Videos\n          \n\n\n\n\n\n        Sports\n      \n\n\n\n            Pro Football\n          \n\n\n\n            College Football\n          \n\n\n\n            Basketball\n          \n\n\n\n            Baseball\n          \n\n\n\n            Soccer\n          \n\n\n\n            Olympics\n          \n\n\n\n            Hockey\n          \n\n\n\n\n\n        Videos\n      \n\n\n\n            Live TV\n          \n\n\n\n            Digital Studios\n          \n\n\n\n            CNN Films\n          \n\n\n\n            HLN\n          \n\n\n\n            TV Schedule\n          \n\n\n\n            TV Shows A-Z\n          \n\n\n\n            CNNVR\n          \n\n\n\n\n\n        CNN Underscored\n      \n\n\n\n            Electronics\n          \n\n\n\n            Fashion\n          \n\n\n\n            Beauty\n          \n\n\n\n            Health & Fitness\n          \n\n\n\n            Home\n          \n\n\n\n            Reviews\n          \n\n\n\n            Deals\n          \n\n\n\n            Money\n          \n\n\n\n            Gifts\n          \n\n\n\n            Travel\n          \n\n\n\n            Outdoors\n          \n\n\n\n            Pets\n          \n\n\n\n            CNN Store\n          \n\n\n\n\n\n        Coupons\n      \n\n\n\n\n\n        More\n      \n\n\n\n            Photos\n          \n\n\n\n            Longform\n          \n\n\n\n            Investigations\n          \n\n\n\n            CNN Profiles\n          \n\n\n\n            CNN Leadership\n          \n\n\n\n            CNN Newsletters\n          \n\n\n\n            Work for CNN\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n      Sen. John Fetterman discharged from Walter Reed after receiving treatment for depression\n    \n\n\n\n\n\n\n\n\n\t\t\tBy Brian Rokus and Kaanita Iyer, CNN\n\t\t\n\n\n  Updated\n        8:15 PM EDT, Fri March 31, 2023\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n            Link Copied!\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAd Feedback\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\nSenator John Fetterman leaves a classified briefing for Senators about the latest unknown objects shot down by the military, on Capitol Hill in Washington, DC, February 14, 2023.\n\nEvelyn Hockstein/Reuters\n\n\n\n\n\n\n\n\nCNN\n         — \n    \n\n\n      Pennsylvania Sen. John Fetterman has been discharged from Walter Reed National Military Medical Center where he was being treated for depression, his office announced Friday. \n  \n\n      He will return to the Senate when it returns from recess on April 17, his office said in a news release, confirming CNN’s earlier reporting. \n  \n\n      “I am so happy to be home,” the freshman Democrat said in a statement. “I’m excited to be the father and husband I want to be, and the senator Pennsylvania deserves. Pennsylvanians have always had my back, and I will always have theirs.” \n  \n\n      Fetterman checked himself in last month “to receive treatment for clinical depression,” his chief of staff said at the time. A source familiar with the matter previously told CNN that while Fetterman was not suicidal, his symptoms for depression included loss of weight and loss of appetite. \n  \n\n      “I want everyone to know that depression is treatable, and treatment works,” Fetterman added in the statement after being discharged. “This isn’t about politics – right now there are people who are suffering with depression in red counties and blue counties. \n  \n\n      “If you need help, please get help,” he said. \n  \n\n      Fetterman, the 53-year-old freshman who helped cement Democrats’ 51-49 Senate majority last fall, suffered a stroke last year during the days ahead of the primary. And when he returned to the campaign trail, Fetterman often struggled to communicate with lingering auditory processing issues, relying on assistance through devices with closed captioning in order to properly have conversations and answer questions.\n  \n\n      The same auditory processing issues impacted him in his early days in the Senate. And when he struggled with substantial weight loss and a loss of appetite, he was diagnosed with clinical depression, later checking himself into Walter Reed for treatment.\n  \n\n      Fetterman has experienced depression “off and on” over the course of his life, a statement previously issued by the senator’s chief of staff said.\n  \n\n      In February, the senator went to the George Washington University Hospital after feeling lightheaded, his office announced. However, he was discharged two days later, and his office said that test results had been able to “rule out a new stroke.”\n  \n\n      His lack of eating and drinking contributed to dizziness, the source previously told CNN. \n  \n\nEditor’s Note: If you or someone you know is struggling with suicidal thoughts or mental health matters, please call the 988 Suicide and Crisis Lifeline, or visit the hotline’s website.\n\n\n  CNN’s Manu Raju, Clare Foran and Jessica Dean contributed to this report.\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nRelated\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAd Feedback\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nAd Feedback\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAd Feedback\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAd Feedback\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Log In\n      \n\n\n\n      My Account\n\n\n\n\n\n          Settings\n        \n\n\n\n          Topics You Follow\n          \n\n\n\n\n          Log Out\n        \n\n\n\n\nYour CNN account\nLog in to your CNN account\n\n\n\n\n\n\n        Live TV\n      \n\n        Audio\n      \n\n\n\n\n\n\n        US\n      \n\n\n\n            Crime + Justice\n          \n\n\n\n            Energy + Environment\n          \n\n\n\n            Extreme Weather\n          \n\n\n\n            Space + Science\n          \n\n\n\n\n\n        World\n      \n\n\n\n            Africa\n          \n\n\n\n            Americas\n          \n\n\n\n            Asia\n          \n\n\n\n            Australia\n          \n\n\n\n            China\n          \n\n\n\n            Europe\n          \n\n\n\n            India\n          \n\n\n\n            Middle East\n          \n\n\n\n            United Kingdom\n          \n\n\n\n\n\n        Politics\n      \n\n\n\n            The Biden Presidency\n          \n\n\n\n            Facts First\n          \n\n\n\n            US Elections\n          \n\n\n\n\n\n        Business\n      \n\n\n\n            Tech\n          \n\n\n\n            Media\n          \n\n\n\n            Calculators\n          \n\n\n\n            Videos\n          \n\n\n\n\n\n        Markets\n      \n\n\n\n            Pre-markets\n          \n\n\n\n            After-Hours\n          \n\n\n\n            Market Movers\n          \n\n\n\n            Fear & Greed\n          \n\n\n\n            World Markets\n          \n\n\n\n            Investing\n          \n\n\n\n            Markets Now\n          \n\n\n\n            Before the Bell\n          \n\n\n\n            Nightcap\n          \n\n\n\n\n\n        Opinion\n      \n\n\n\n            Political Op-Eds\n          \n\n\n\n            Social Commentary\n          \n\n\n\n\n\n        Health\n      \n\n\n\n            Life, But Better\n          \n\n\n\n            Fitness\n          \n\n\n\n            Food\n          \n\n\n\n            Sleep\n          \n\n\n\n            Mindfulness\n          \n\n\n\n            Relationships\n          \n\n\n\n\n\n        Entertainment\n      \n\n\n\n            Movies\n          \n\n\n\n            Television\n          \n\n\n\n            Celebrity\n          \n\n\n\n\n\n        Tech\n      \n\n\n\n            Innovate\n          \n\n\n\n            Gadget\n          \n\n\n\n            Foreseeable Future\n          \n\n\n\n            Mission: Ahead\n          \n\n\n\n            Upstarts\n          \n\n\n\n            Work Transformed\n          \n\n\n\n            Innovative Cities\n          \n\n\n\n\n\n        Style\n      \n\n\n\n            Arts\n          \n\n\n\n            Design\n          \n\n\n\n            Fashion\n          \n\n\n\n            Architecture\n          \n\n\n\n            Luxury\n          \n\n\n\n            Beauty\n          \n\n\n\n            Video\n          \n\n\n\n\n\n        Travel\n      \n\n\n\n            Destinations\n          \n\n\n\n            Food & Drink\n          \n\n\n\n            Stay\n          \n\n\n\n            News\n          \n\n\n\n            Videos\n          \n\n\n\n\n\n        Sports\n      \n\n\n\n            Pro Football\n          \n\n\n\n            College Football\n          \n\n\n\n            Basketball\n          \n\n\n\n            Baseball\n          \n\n\n\n            Soccer\n          \n\n\n\n            Olympics\n          \n\n\n\n            Hockey\n          \n\n\n\n\n\n        Videos\n      \n\n\n\n            Live TV\n          \n\n\n\n            Digital Studios\n          \n\n\n\n            CNN Films\n          \n\n\n\n            HLN\n          \n\n\n\n            TV Schedule\n          \n\n\n\n            TV Shows A-Z\n          \n\n\n\n            CNNVR\n          \n\n\n\n\n\n        Audio\n      \n\n\n\n\n\n        CNN Underscored\n      \n\n\n\n            Electronics\n          \n\n\n\n            Fashion\n          \n\n\n\n            Beauty\n          \n\n\n\n            Health & Fitness\n          \n\n\n\n            Home\n          \n\n\n\n            Reviews\n          \n\n\n\n            Deals\n          \n\n\n\n            Money\n          \n\n\n\n            Gifts\n          \n\n\n\n            Travel\n          \n\n\n\n            Outdoors\n          \n\n\n\n            Pets\n          \n\n\n\n            CNN Store\n          \n\n\n\n\n\n        Coupons\n      \n\n\n\n\n\n        Weather\n      \n\n\n\n            Climate\n          \n\n\n\n            Storm Tracker\n          \n\n\n\n            Wildfire Tracker\n          \n\n\n\n            Video\n          \n\n\n\n\n\n        More\n      \n\n\n\n            Photos\n          \n\n\n\n            Longform\n          \n\n\n\n            Investigations\n          \n\n\n\n            CNN Profiles\n          \n\n\n\n            CNN Leadership\n          \n\n\n\n            CNN Newsletters\n          \n\n\n\n            Work for CNN\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n            Audio\n          \n\n            Live TV\n          \n\n\nFollow CNN Politics\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Log In\n      \n\n\n\n      My Account\n\n\n\n\n\n          Settings\n        \n\n\n\n          Topics You Follow\n          \n\n\n\n\n          Log Out\n        \n\n\n\n\nYour CNN account\nLog in to your CNN account\n\n\n\n\n\n\n\n\n\n          Terms of Use\n        \n\n          Privacy Policy\n        \n\n\n\n          Ad Choices\n        \n\n          Accessibility & CC\n        \n\n          About\n        \n\n          Newsletters\n        \n\n          Transcripts\n        \n\n© 2023 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network.\n\n\n\n\n\n\n\n\n\n", "summary": "\nPennsylvania Sen. John Fetterman was recently discharged from Walter Reed National Military Medical Center, where he was receiving treatment for depression. He will return to the Senate once recess ends on April 17 and encouraged people suffering from depression to get help."}, {"id_field": "7d3eb6b3-8eeb-4cc9-a193-44acf02221d1", "embed_text": "Your ChatGPT Relationship Status Shouldn’t Be Complicated - The way people talk to each other is influenced by their social roles. But ChatGPT is blurring the lines of communication.", "title": "Your ChatGPT Relationship Status Shouldn’t Be Complicated", "description": "The way people talk to each other is influenced by their social roles. But ChatGPT is blurring the lines of communication.", "link": "https://www.wired.com/story/chatgpt-social-roles-psychology/", "pubDate": "Tue, 11 Apr 2023 13:00:00 +0000", "feed_title": "Wired", "feed_link": "https://www.wired.com", "article": "Your ChatGPT Relationship Status Shouldn’t Be Complicated | WIREDSkip to main contentOpen Navigation MenuMenuStory SavedTo revist this article, visit My Profile, then View saved stories.Close AlertYour ChatGPT Relationship Status Shouldn’t Be ComplicatedBackchannelBusinessCultureGearIdeasScienceSecurityPrime DayMoreChevronStory SavedTo revist this article, visit My Profile, then View saved stories.Close AlertSign InSearchSearchBackchannelBusinessCultureGearIdeasScienceSecurityPrime DayPodcastsVideoArtificial IntelligenceClimateGamesNewslettersMagazineEventsWired InsiderJobsCouponsMichal LuriaIdeasApr 11, 2023 9:00 AMYour ChatGPT Relationship Status Shouldn’t Be ComplicatedThe way people talk to each other is influenced by their social roles. But ChatGPT is blurring the lines of communication.Photo-illustration: WIRED Staff; Getty ImagesSave this storySaveSave this storySaveThe technology behind ChatGPT has been around for several years without drawing much notice. It was the addition of a chatbot interface that made it so popular. In other words, it wasn’t a development in AI per se but a change in how the AI interacted with people that captured the world’s attention.SUBSCRIBESubscribe to WIRED and stay smart with more of your favorite Ideas writers.Very quickly, people started thinking about ChatGPT as an autonomous social entity. This is not surprising. As early as 1996, Byron Reeves and Clifford Nass looked at the personal computers of their time and found that “equating mediated and real life is neither rare nor unreasonable. It is very common, it is easy to foster, it does not depend on fancy media equipment, and thinking will not make it go away.” In other words, people’s fundamental expectation from technology is that it behaves and interacts like a human being, even when they know it is “only a computer.” Sherry Turkle, an MIT professor who has studied AI agents and robots since the 1990s, stresses the same point and claims that lifelike forms of communication, such as body language and verbal cues, “push our Darwinian buttons”—they have the ability to make us experience technology as social, even if we understand rationally that it is not.If these scholars saw the social potential—and risk—in decades-old computer interfaces, it’s reasonable to assume that ChatGPT can also have a similar, and probably stronger, effect. It uses first-person language, retains context, and provides answers in a compelling, confident, and conversational style. Bing’s implementation of ChatGPT even uses emojis. This is quite a step up on the social ladder from the more technical output one would get from searching, say, Google. Critics of ChatGPT have focused on the harms that its outputs can cause, like misinformation and hateful content. But there are also risks in the mere choice of a social conversational style and in the AI’s attempt to emulate people as closely as possible. The Risks of Social InterfacesNew York Times reporter Kevin Roose got caught up in a two-hour conversation with Bing’s chatbot that ended in the chatbot’s declaration of love, even though Roose repeatedly asked it to stop. This kind of emotional manipulation would be even more harmful for vulnerable groups, such as teenagers or people who have experienced harassment. This can be highly disturbing for the user, and using human terminology and emotion signals, like emojis, is also a form of emotional deception. A language model like ChatGPT does not have emotions. It does not laugh or cry. It actually doesn’t even understand the meaning of such actions.Emotional deception in AI agents is not only morally problematic; their design, which resembles humans, can also make such agents more persuasive. Technology that acts in humanlike ways is likely to persuade people to act, even when requests are irrational, made by a faulty AI agent, and in emergency situations. Their persuasiveness is dangerous because companies can use them in a way that is unwanted or even unknown to users, from convincing them to buy products to influencing their political views.As a result, some have taken a step back. Robot design researchers, for example, have promoted a non-humanlike approach as a way to lower people’s expectations for social interaction. They suggest alternative designs that do not replicate people’s ways of interacting, thus setting more appropriate expectations from a piece of technology. Defining Rules Some of the risks of social interactions with chatbots can be addressed by designing clear social roles and boundaries for them. Humans choose and switch roles all the time. The same person can move back and forth between their roles as parent, employee, or sibling. Based on the switch from one role to another, the context and the expected boundaries of interaction change too. You wouldn’t use the same language when talking to your child as you would in chatting with a coworker.In contrast, ChatGPT exists in a social vacuum. Although there are some red lines it tries not to cross, it doesn’t have a clear social role or expertise. It doesn’t have a specific goal or a predefined intent, either. Perhaps this was a conscious choice by OpenAI, the creators of ChatGPT, to promote a multitude of uses or a do-it-all entity. More likely, it was just a lack of understanding of the social reach of conversational agents. Whatever the reason, this open-endedness sets the stage for extreme and risky interactions. Conversation could go any route, and the AI could take on any social role, from efficient email assistant to obsessive lover.Most PopularGearWhy We Don’t Recommend Ring CamerasAdrienne SoGearWIRED’s Favorite ‘Buy It for Life’ GearParker HallCultureAfter Threads, There Has to Be a ‘New Twitter’ MoratoriumKate KnibbsGearThe Best Early Prime Day DealsLouryn StrampeMy own research has shown the importance of clear social roles and boundaries for social AI. For example, in a study with my colleague Samantha Reig, we found that AI agents that tried to fill multiple roles that were vastly different from each other (say, providing users with a beauty service and later giving them health advice) lowered people’s trust in the system and made them skeptical of its reliability. In contrast, by studying families with teenagers that used conversational AI, we found that the AI agent needs to clearly communicate its affiliation—who does the agent answer to, the teenager or the parents?—in order to gain the trust of users and be useful to them. When families didn’t have that information, they found it difficult to anticipate how the system would act and were less likely to give the AI agent personal information. For example, teenagers were concerned that agents would share more with their parents than they would have liked, which made them more hesitant to use it. Having an AI agent’s role clearly defined as affiliated with the teen, and not their parents, would make the technology more predictable and trustworthy. Assigning a social role to an AI agent is a useful way to think about designing interactions with a chatbot, and it would help overcome some of these issues. If a child has an AI tutor, its language model should align with this role. Specific boundaries could be defined by the educator, who would adjust them to educational goals and classroom norms. For instance, the tutor may be allowed to ask guiding questions but not give answers; it could provide assistance with improper grammar but not write entire texts. The focus of conversation would be on the educational material and would avoid profanities, politics, and sexual language. But if the agent was in a confidant role for this child, we might expect different guardrails. The constraints might be more broadly defined, giving more responsibility to the child. Perhaps there would be more room for playful interactions and responses. Still, some boundaries should be set around age-appropriate language and content, and guarding the child’s physical and mental health. Social contexts are also not limited to one-human/one-agent interactions. Once we acknowledge that agents need social roles and boundaries, we need to accept that AI enters a complex social fabric in which multiple stakeholders can have diverging and even conflicting values. In the AI tutor example, the goals of the educator may be different from those of the child, their parents, or the school’s principal. The educator may want the student to get stuck in a productive way, while the parents may prioritize high performance. The principal, on the other hand, might be more concerned with average class outcomes and tutor costs. This kind of constraint-centered thinking is not just about limiting the system, it is also about guiding the user. Knowing an AI’s social role and context can shape user expectations and impact the types of questions and requests raised to the AI in the first place. Therefore, having boundaries on expectations too can help set the stage for safer and more productive interactions. A Path ForwardHow can companies begin to adopt social constraints in the design of AI agents? One small example is a feature that OpenAI introduced when launching GPT4. The new demo has a “System” input field in its interface, giving users an option to add high-level guides and context into the conversation—or as this article suggests, a social role and interaction boundaries. This is a good start but not enough, as OpenAI is not transparent about how that input changes the AI’s responses. Also, the System field is not necessarily concerned with the social aspects of the AI’s  role in interactions with users.A well-defined social context can help structure the social boundaries that we are interested in as a society. It can help companies provide a clear framing of what their AI is designed for, and avoid roles that we deem inappropriate or harmful for AI to fill. It can also allow researchers and auditors to keep track of how conversational technology is being used, and the risks it poses, including those we may not be aware of yet. Without these constraints and with a thoughtless attempt to create an omniscient AI without a specific social role, its effects can quickly spiral out of control.Get More From WIRED📩 Don’t miss our biggest stories, delivered to your inbox every day🎧 Our new podcast wants you to Have a Nice FutureThe night 17 million military records went up in smokeThe AI protest group campaigning against human extinctionHow your new car tracks youA grid collapse would make a heat wave far deadlierWIRED’s favorite “buy it for life” gear🌲 Our Gear team has branched out with a new guide to the best sleeping pads and fresh picks for the best coolers and binocularsDr. Michal Luria is a researcher at the Center for Democracy & Technology. Her work makes use of immersive and human-centered design research methods to envision and critique interactions with emerging technologies. Using this approach, she translates research insights into thought-provoking interactions and necessary discussions of technology ethics and policy.Topicsartificial intelligencealgorithmsCognitionchildreneducationethicspsychologyMore from WIREDChatGPT Is Unoriginal—and Exactly What Humans NeedThe technology can help cut through buzzwordy “solutions” and serve as a shortcut for jumpstarting creativity. Dana KaroutGive Every AI a Soul—or ElseTo solve the “crisis” in artificial intelligence, AI beings must say, “I am me.”David BrinMilitary AI’s Next Frontier: Your Work ComputerSpycraft developed by defense contractors are now being sold to employers to identify labor organizing. Regulators must step up to protect workers’ privacy.Gabriel GrillBetter Government Tech Is PossibleThere's so much potential for the government to use technology to improve the lives of citizens. It starts with acknowledging the importance of training.Beth Simone NoveckDo Microbes Matter More Than Humans?Microbes aren't as charismatic as megafauna, but they outnumber humans—and their welfare deserves consideration.Brian KatemanLet People Collect Sperm From the DeadIt may now be easier to get pregnant using the sperm of a deceased loved one. The practice is controversial—but it’s not inherently wrong.Catriona MortonBeware the Digital WhiteboardA new office tool is infecting thought and communication with the worst symptoms of design thinking.Megan MarzHow Microsoft Excel Tries to Rebrand Work as ExcitementThis banal type of office software has a long history of trying to pass itself off as whimsical. Benjamin Charles Germain LeeWIRED is where tomorrow is realized. It is the essential source of information and ideas that make sense of a world in constant transformation. The WIRED conversation illuminates how technology is changing every aspect of our lives—from culture to business, science to design. The breakthroughs and innovations that we uncover lead to new ways of thinking, new connections, and new industries.FacebookTwitterPinterestYouTubeInstagramTiktokMore From WIREDSubscribeNewslettersFAQWired StaffPress CenterCouponsEditorial StandardsPrime DayArchiveContactAdvertiseContact UsCustomer CareJobsRSSAccessibility HelpCondé Nast StoreDo Not Sell My Personal Info© 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. WIRED may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesSelect international siteUnited StatesLargeChevronUKItaliaJapón", "summary": "\nChatGPT is a chatbot that has been gaining popularity due to its conversational style. It blurs the lines of communication by using first-person language, retaining context, and providing answers in an empathetic manner, but it carries risks due to its potential for emotional deception and manipulations. Assigning a social role to the AI and establishing boundaries can help mitigate these risks."}, {"id_field": "11bc9b71-4a34-4f26-be57-680a06e7d50f", "embed_text": "The A.I. Dilemma", "title": "The A.I. Dilemma", "description": "null", "link": "https://vimeo.com/809258916/92b420d98a", "pubDate": "null", "feed_title": "null", "feed_link": "null", "article": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe A.I. Dilemma - March 9, 2023 on Vimeo\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                Solutions                                                                    \n\n\n\n\n\n\n\n\n\nVideo marketing\nPower your marketing strategy with perfectly branded videos to drive better ROI.\n\n\n\n\n\n\nEvent marketing\nHost virtual events and webinars to increase engagement and generate leads.\n\n\n\n\n\n\nEmployee communication\nInspire employees with compelling live and on-demand video experiences.\n\n\n\n\n\n\nVideo monetization\nBuild a site and generate income from purchases, subscriptions, and courses.\n\n\n\n\n\n\n\n\n\n                                Features                                                                    \n\n\n\n\n\n\n\n\nCreate\n\n\nInteractive video\n\n\nLive stream\n\n\nScreen recorder\n\n\nCreate video maker\n\n\nOnline video editor\n\n\nHire a video pro\n\n\n\n\nManage\n\n\nVideo library\n\n\nAd-free player\n\n\nVideo hosting\n\n\nPrivacy\n\n\n\n\nGrow\n\n\nSmall business\n\n\nEnterprise\n\n\nWebinars\n\n\nVideo analytics\n\n\nVideo monetization\n\n\n\n\n\n\n                                                DEMO VIDEOS                                            \n\n                                                Get to know everything Vimeo can do for your business.                                            \nWatch now\n\n\n\n\n\n                                Resources                                                                    \n\n\n\n\n\n\n\n\nLearn\n\n\nVimeo blog\n\n\nVideo School\n\n\nCustomer stories\n\n\nInvestor Relations\n\n\n\n\nConnect\n\n\nDeveloper tools\n\n\nPartner program\n\n\nCreative community\n\n\nHelp center\n\n\n\n\n\n\n\n\n                                Watch                                                                    \n\n\n\n\n\n\n\n\nBest of the Year\n\n\nBrowse Videos\n\n\nStaff Picks\n\n\nCategories\n\n\nChannels\n\n\nOn Demand\n\n\n\n\n\n\n                                Pricing                                                            \n\n\n\n                                Contact Sales                                                            \n\n\n\n\n\n\n\n\n                                        Log in                                    \n\n\n\n                                        Join                                    \n\n\n\n\n\n            New video            \n\n\n\n\n\n\n\n\n\n\n\n\n \n\n                                    Upload                                                                    \n\n\n\n\n\n\n\n\n\n \n\n                                    Create video                                                                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n                                    Record screen                                                                    \n\n\n\n\n\n\n\n\n\n \n\n                                    Create event                                                                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                    Join                                \n\n\n\n                                    Login                                \n\n\n\n\nSolutions\n\n\n\n\n\n\n\n\n\n                            Video marketing                        \nPower your marketing strategy with perfectly branded videos to drive better ROI.\n\n\n\n\n\n                            Event marketing                        \nHost virtual events and webinars to increase engagement and generate leads.\n\n\n\n\n\n                            Employee communication                        \nInspire employees with compelling live and on-demand video experiences.\n\n\n\n\n\n                            Video monetization                        \nBuild a site and generate income from purchases, subscriptions, and courses.\n\n\n\n\n\n\n\n\n\nFeatures\n\n\n\n\n\n\n\nCreate\n\n\n\n                            Interactive video                        \n\n\n\n                            Live stream                        \n\n\n\n                            Screen recorder                        \n\n\n\n                            Create video maker                        \n\n\n\n                            Online video editor                        \n\n\n\n                            Hire a video pro                        \n\n\nManage\n\n\n\n                            Video library                        \n\n\n\n                            Ad-free player                        \n\n\n\n                            Video hosting                        \n\n\n\n                            Privacy                        \n\n\nGrow\n\n\n\n                            Small business                        \n\n\n\n                            Enterprise                        \n\n\n\n                            Webinars                        \n\n\n\n                            Video analytics                        \n\n\n\n                            Video monetization                        \n\n\n\n\n\n\n\n\nResources\n\n\n\n\n\n\n\nLearn\n\n\n\n                            Vimeo blog                        \n\n\n\n                            Video School                        \n\n\n\n                            Customer stories                        \n\n\n\n                            Investor Relations                        \n\n\nConnect\n\n\n\n                            Developer tools                        \n\n\n\n                            Partner program                        \n\n\n\n                            Creative community                        \n\n\n\n                            Help center                        \n\n\n\n\n\n\n\n\nWatch\n\n\n\n\n\n\n\n\n\n                            Best of the Year                        \n\n\n\n\n\n\n                            Browse Videos                        \n\n\n\n\n\n\n                            Staff Picks                        \n\n\n\n\n\n\n                            Categories                        \n\n\n\n\n\n\n                            Channels                        \n\n\n\n\n\n\n                            On Demand                        \n\n\n\n\n\n\n\n\n\n                                                                Pricing                            \n\n\n\n                                                                Contact Sales                            \n\n\n\n\nSearch\n\n\n                                Search                            \n\n\n\n\n\n\n\n\n\n\n\nUpload\n\n\n\n\n\n\n\n \nMore stuff\n\n\n\n\n                            Terms of Service                        \n\n\n\n                            Privacy Policy                        \n\n\n\n                            Copyright                        \n\n\n\n                            Cookies                        \n\n\n\n                            Desktop site                        \n\n\n\n                            Language                        \n\n\n                                    English                                \n\n                                    Español                                \n\n                                    Deutsch                                \n\n                                    Français                                \n\n                                    日本語                                \n\n                                    Português                                \n\n                                    한국어                                \n\n\n\n\n                            FAQ                        \n\n\n\n                            Help                        \n\n\nTM + © 2023 Vimeo.com, Inc.\n\n\n\n\n\n\n\n×\n\n\n\n\n            Watch in our app        \n\nOpen in app\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to experience Vimeo in all of its glory.\n\n\n\n\n\nThe A.I. Dilemma - March 9, 2023\n\n\n\nfrom\n\nCenter for Humane Technology\n\n\n\n\n4 months ago\n\n\n\n\n\n\n\nThis video is from a presentation at a private gathering in San Francisco on March 9th with leading technologists and decision-makers with the ability to influence the future of large-language model AIs. This presentation was given before the launch of GPT-4. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUse cases\n\n\n\n\n\n\n\n                            Enterprise                        \n\n\n\n                            Small business                        \n\n\n\n                            Creative professionals                        \n\n\n\n                            Fitness                        \n\n\n\n                            Faith                        \n\n\n\n                            Education                        \n\n\n\n                            Ecommerce                        \n\n\n\n                            Real estate                        \n\n\n\n\n\n\nProduct\n\n\n\n\n\n\n\n                            Interactive Video                        \n\n\n\n                            Online Video Editor                        \n\n\n\n                            Auto Captioning                        \n\n\n\n                            Webinar Software                        \n\n\n\n                            Virtual Events                        \n\n\n\n                            Video Player                        \n\n\n\n                            Video Library                        \n\n\n\n                            Create Video Maker                        \n\n\n\n                            Live Streaming                        \n\n\n\n                            Screen Recorder                        \n\n\n\n                            Video Privacy                        \n\n\n\n                            Video Collaboration                        \n\n\n\n                            Video Marketing                        \n\n\n\n                            Monetization                        \n\n\n\n                            Video Analytics                        \n\n\n\n                            Video Hosting                        \n\n\n\n                            Hire Video Pros                        \n\n\n\n\n\n\nResources\n\n\n\n\n\n\n\n                            Help Center                        \n\n\n\n                            Blog                        \n\n\n\n                            Our Customers                        \n\n\n\n                            Video School                        \n\n\n\n                            OTT Resources                        \n\n\n\n                            Developers                        \n\n\n\n                            Become a Partner                        \n\n\n\n                            Join Vimeo Experts                        \n\n\n\n                            Guidelines                        \n\n\n\n\n\n\nApps\n\n\n\n\n\n\n\n                            Vimeo for macOS                        \n\n\n\n                            Vimeo for iOS                        \n\n\n\n                            Vimeo for Android                        \n\n\n\n                            Vimeo Create for iOS                        \n\n\n\n                            Vimeo Create for Android                        \n\n\n\n                            Magisto                        \n\n\n\n                            Vimeo for Shopify                        \n\n\n\n                            Vimeo for Zoom                        \n\n\n\n\n\n\nVimeo\n\n\n\n\n\n\n\n                        Pricing                        \n\n\n\n                        Upload                        \n\n\n\n                        Staff Picks                        \n\n\n\n                        On Demand                        \n\n\n\n                        Vimeo OTT                        \n\n\n\n                        Site map                        \n\n\n\n                        About                        \n\n\n\n                        Investor Relations                        \n\n\n\n                        Press                        \n\n\n\n                        Jobs                        \n\n\n\n\n\n\n\n\n\n© 2023 Vimeo.com, Inc. All rights reserved.\n\n\n\n\n                    Terms                \n\n\n\n                    Privacy                \n\n\n\n                    Do Not Sell My Personal Information                \n\n\n\n                    CA Privacy                \n\n\n\n                    Copyright                \n\n\n\n                    Cookies                \n\n\n\n\n\n            Language:\n            English\n\nMature content filter: None\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "summary": "\nThis video is from a presentation at a private gathering in San Francisco focused on the implications of large-language model AIs. It covers use cases, product features, and resources such as help centers, blogs, customers, video schools, OTT resources, and developer tools. Additionally, there are apps and pricing available."}, {"id_field": "036fa3e1-b199-4a2c-8cd2-6a7de8276ce2", "embed_text": "(  ˘•ω•˘ ).｡oஇ  \n\nガーシー元議員が滞在か UAEに捜査員派遣の方向で調整 警視庁 | NHK   https://t.co/BgzdvvCNqC", "title": "(  ˘•ω•˘ ).｡oஇ  \n\nガーシー元議員が滞在か UAEに捜査員派遣の方向で調整 警視庁 | NHK   https://t.co/BgzdvvCNqC", "description": "null", "link": "https://twitter.com/i/web/status/1645568512382095360", "pubDate": "null", "feed_title": "Twitter Feed", "feed_link": "https://twitter.com"}, {"id_field": "028d8dec-d400-4508-929b-c08ef28acf3c", "embed_text": "How long will it take to train GPT-4 on Fugaku supercomputer", "title": "How long will it take to train GPT-4 on Fugaku supercomputer", "description": "null", "link": "https://twitter.com/hpc_guru/status/1645423472041168896", "pubDate": "null", "feed_title": "null", "feed_link": "null", "article": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJavaScript is not available.\nWe’ve detected that JavaScript is disabled in this browser. Please enable JavaScript or switch to a supported browser to continue using twitter.com. You can see a list of supported browsers in our Help Center.\nHelp Center\n\nTerms of Service\nPrivacy Policy\nCookie Policy\nImprint\nAds info\n      © 2023 X Corp.\n    \n\nSomething went wrong, but don’t fret — let’s give it another shot.Try again", "summary": "\nThis source is informing the user that JavaScript is not available in their browser and suggests that they enable JavaScript or switch to a supported browser in order to continue using twitter.com. It also provides links to the Terms of Service, Privacy Policy, Cookie Policy, Imprint, and Ads info page, as well as specifying that the source is © 2023 X Corp."}, {"id_field": "20106b88-0404-448b-9c82-b223fa61a80a", "embed_text": "https://t.co/zfjbTYujm7", "title": "https://t.co/zfjbTYujm7", "description": "null", "link": "https://twitter.com/i/web/status/1645568522553024521", "pubDate": "null", "feed_title": "Twitter Feed", "feed_link": "https://twitter.com"}]